{"id":10417,"date":"2021-10-21T07:27:33","date_gmt":"2021-10-21T07:27:33","guid":{"rendered":"https:\/\/workspace.fiverr.com\/?page_id=10417"},"modified":"2021-11-04T12:28:55","modified_gmt":"2021-11-04T12:28:55","slug":"terms","status":"publish","type":"page","link":"https:\/\/workspace.fiverr.com\/terms\/","title":{"rendered":"Terms of Service"},"content":{"rendered":"<p>Last Updated: November 3, 2021<\/p>\n<p>Welcome to Fiverr Workspace, an online back office service designed for freelancers and small businesses. Please read these Terms of Service (the “<strong>Terms<\/strong>”), together with Fiverr’s Privacy Policy (available at https:\/\/www.fiverr.com\/privacy-policy) (“<strong>Privacy Policy<\/strong>”), fully and carefully before accessing or using workspace.fiverr.com, the Workspace platform, including the Workspace mobile app or any content, products, and\/or services made available by Workspace (all together the “<strong>Services<\/strong>” or “<strong>Workspace<\/strong>”). The Terms set forth the legally binding terms and conditions governing your access to and use of the Services.<\/p>\n<p>By registering to use and\/or using the Services in any manner, You, just as if You had done so in writing, (i) acknowledge that You have read and understood the Terms, (ii) represent and warrant that You are at least eighteen (18) years of age, and if applicable, have the authority to enter into these Terms on behalf of any person or entity for whom You are accessing or using the Services, and (iii) agree to these Terms and all other rules, policies, and procedures that may be published by us from time to time. You also acknowledge that you have read and understood the Privacy Policy. Certain parts of the Services may be subject to additional terms and conditions specified by us from time to time; Your use of such Services is subject to those additional terms and conditions, which are incorporated into these Terms by reference. These Terms are binding upon any use of the Services, including by Subscribers and Invited Users (each as defined below), and apply to You from the time that we provide You with access to the Services.<\/p>\n<p>The Services will evolve over time based on user feedback. We may amend these Terms from time to time. You may be required to click “accept” or “agree” to show your consent to an amended version of these Terms.<\/p>\n<p>You are solely responsible for ensuring that these Terms are in compliance with all laws, rules and regulations applicable to you. The right to access the Services is revoked where these Terms or use of the Services is prohibited or to the extent offering, sale or provision of the Services conflicts with any applicable law, rule or regulation.<\/p>\n<p>ARBITRATION NOTICE AND CLASS ACTION WAIVER: EXCEPT FOR CERTAIN TYPES OF DISPUTES DESCRIBED IN THE ARBITRATION CLAUSE &amp; CLASS ACTION WAIVER SECTION BELOW, YOU AGREE THAT DISPUTES BETWEEN YOU AND US WILL BE RESOLVED BY BINDING, INDIVIDUAL ARBITRATION AND YOU WAIVE YOUR RIGHT TO PARTICIPATE IN A CLASS ACTION LAWSUIT OR CLASS-WIDE ARBITRATION.<\/p>\n<p><strong><strong>1. DEFINITIONS<\/strong><\/strong><\/p>\n<p>“<strong>Fiverr<\/strong>”, “<strong>we<\/strong>” or “<strong>us<\/strong>” means Fiverr International Ltd. and all current and future global subsidiaries, affiliates, and\/or successors of Fiverr International Ltd.<\/p>\n<p>“<strong>Applicable Data Protection Laws<\/strong>” means the legislation protecting the fundamental rights and freedoms of individuals with regard to their right to privacy and Processing of Personal Data, including the GDPR and supplementing local laws.<\/p>\n<p>“<strong>Business Purpose<\/strong>” means a use of Personal Data for our or Subscriber’s operational or other notified purposes which is necessary and proportionate to achieve such purpose, and is compatible with the context in which the Personal Data was collected. Where “Business Purposes” are specifically defined under applicable law, that definition shall apply to these Terms.<\/p>\n<p>“<strong>Controller<\/strong>” shall mean any party to these Terms which alone or jointly with others determines the purposes and means of the Processing of Personal Data.<\/p>\n<p>“<strong>Data<\/strong>” means any data and\/or information inputted by You or on Your behalf into the Workspace Service, including but not limited to data and\/or information contained in any contracts and documents You work on through the Services.<\/p>\n<p>“<strong>Data Subject<\/strong>” means a natural person who can be identified, whether directly or indirectly, including by reference to an identification number, location data, online identified or to one or more factors specific to his physical, physiological, mental, economic, cultural or social identity (and to the extent that a corporate entity receives the same or similar protection as natural persons under applicable data protection laws, shall also include such corporate entities).<\/p>\n<p>“<strong>EU General Data Protection Regulation<\/strong>” or “<strong>GDPR<\/strong>” means Regulation (EU) 2016\/679 of the European Parliament and of the Council of April 27, 2016 on the protection of natural persons with regard to the Processing of personal data and on the free movement of such data;<\/p>\n<p>“<strong>Intellectual Property Right<\/strong>” means any patent, trademark, service mark, copyright, moral right, right in a design, know-how and any other intellectual or industrial property rights, anywhere in the world whether or not registered.<\/p>\n<p>“<strong>Invited User<\/strong>” means any person or entity, other than the Subscriber, that accesses or uses the Services with the authorization of the Subscriber from time to time.<\/p>\n<p>“<strong>Subscription Fee<\/strong>” means the monthly or annual fee (excluding any taxes) payable by You in accordance with the fee schedule set out on your Paid Subscription Plan.<\/p>\n<p>“<strong>Member State<\/strong>” means a country belonging to the European Union.<\/p>\n<p>“<strong>Organization<\/strong>” means the organization the Subscriber represents or the organization an Invited User has been added to and granted access to.<\/p>\n<p>“<strong>Paid Subscription Plan<\/strong>” means an Workspace subscription plan that requires the payment of Subscription Fees.<\/p>\n<p>“<strong>Personal Data<\/strong>” means any information relating to an identified or identifiable Data Subject;<\/p>\n<p>“<strong>Processing<\/strong>” means any operation or set of operations which is\/are performed upon Personal Data, whether or not by automatic means, such as collection, recording, organization, consultation, use, disclosure by transmission, dissemination or otherwise making available, alignment or combination, blocking, erasure or destruction.<\/p>\n<p>“<strong>Processor<\/strong>” shall mean any party to these Terms which Processes Personal Data on behalf of the Controller.<\/p>\n<p>“<strong>Service Data<\/strong>” includes all confidential and non-confidential data that the Subscriber transfers or otherwise makes accessible to us in connection with using the Services. Service Data shall include Personal Data such as the contact details and financial information relating to third parties other than the Invited User or Subscriber.<\/p>\n<p>“<strong>Subscriber<\/strong>” means the person or entity who registers to use the Services, whether for free or under a Paid Subscription Plan, and\/or any person or entity on whose behalf that person registers to use the Services.<\/p>\n<p>“<strong>Subscriber Personal Data<\/strong>” means any Personal Data relating to any Subscriber or representative of the Subscriber who is an individual.<\/p>\n<p>“<strong>You<\/strong>” or “<strong>user<\/strong>” means any user or visitor of the Service including Subscriber or Invited User. “<strong>Your<\/strong>” has a corresponding meaning.<\/p>\n<p><strong><strong>2. USE OF SOFTWARE<\/strong><\/strong><\/p>\n<p>Subject to these Terms, Fiverr grants You a non-exclusive, non-transferable and non-sublicensable (except as expressly permitted herein) license and right to access and use the Services in accordance with your role as either a Subscriber or Invited User, whichever is applicable. You acknowledge and agree that:<\/p>\n<p>the Subscriber determines who is an Invited User and what level of user role access to the relevant Subscriber account and Service(s) that Invited User has;<\/p>\n<p>the Subscriber is responsible for all Invited Users’ use of the Services;<\/p>\n<p>the Subscriber controls each Invited User’s level of access to the relevant Subscriber account and Service(s) at all times and can revoke or change an Invited User’s access, or level of access, at any time and for any reason, in which case that person or entity will cease to be an Invited User or shall have that different level of access, as the case may be; and<\/p>\n<p>if there is any dispute between a Subscriber and an Invited User regarding access to any Subscriber account or Service(s), the Subscriber shall decide what access or level of access to the relevant Data or Service(s) that Invited User shall have, if any.<\/p>\n<p><strong><strong>3. WORKSPACE IS NOT A SUBSTITUTE FOR A LAWYER OR LAW FIRM<\/strong><\/strong><\/p>\n<p>YOU HEREBY ACKNOWLEDGE AND AGREE THAT NO ATTORNEY-CLIENT RELATIONSHIP EXISTS, OR WILL EVER BE CREATED, BETWEEN YOU AND FIVERR UNDER ANY CIRCUMSTANCES. FIVERR, ITS SERVICES, AND ITS FORMS, TEMPLATES, AND OTHER CONTENT ARE NOT A LAW FIRM OR A SUBSTITUTE FOR A LAW FIRM. FIVERR CANNOT AND DOES NOT RENDER ANY LEGAL SERVICES TO YOU, AND THE SERVICES ARE NOT, AND SHOULD NEVER BE, A SUBSTITUTE FOR LEGAL ADVICE OR LEGAL SERVICES. WITHOUT LIMITING THE FOREGOING, YOU ACKNOWLEDGE AND AGREE THAT ANY FORMS, TEMPLATES, OR CONTENT PROVIDED THROUGH THE SERVICES ARE PRESENTED “AS IS” WITHOUT WARRANTIES, EXPRESS OR IMPLIED, OF ANY KIND AND DO NOT CONSTITUTE LEGAL ADVICE, AND THAT ANY SERVICE THROUGH WHICH YOU USE A FORM OR TEMPLATE TO GENERATE AND\/OR SEND A CONTRACT OR A DEMAND LETTER IS NOT A LEGAL SERVICE. NO INFORMATION PROVIDED THROUGH THE SERVICE IS INTENDED TO BE, AND MUST NOT BE TAKEN TO BE, FACTUAL OR ACCURATE LEGAL ADVICE. YOUR RELIANCE ON ANY FORM, TEMPLATE, OR OTHER CONTENT PROVIDED THROUGH THE SERVICES IS SOLELY AT YOUR OWN RISK. YOUR COMMUNICATIONS WITH FIVERR ARE NOT ATTORNEY WORK-PRODUCT AND ARE NOT PROTECTED UNDER ANY PRIVILEGE, INCLUDING ATTORNEY-CLIENT PRIVILEGE.<\/p>\n<p>YOU HEREBY ACKNOWLEDGE AND AGREE THAT FIVERR IS NOT, AND WILL NOT BE, A PARTY TO ANY LEGAL DISPUTE THAT MAY ARISE BETWEEN YOU AND ANY OTHER PERSON OR ENTITY TO WHOM YOU MAY HAVE SENT A CONTRACT, DEMAND LETTER, INVOICE, OR OTHER DOCUMENT THAT YOU MAY HAVE CREATED USING A FORM, TEMPLATE, OR OTHER CONTENT PROVIDED BY FIVERR.<\/p>\n<p>The Services allow You to create Your own documents with an eye towards memorializing certain details between You and Your clients. We do not review or edit the documents You create for completeness, grammar, spelling, consistency, accuracy or legal merit. We do not draw legal conclusions, provide legal advice, opine on Your legal rights or options, or apply the facts You enter to the law. If You need legal advice, or if Your back office service needs are substantial or complex, we encourage You to hire a lawyer. Our forms and templates may not work well for complex agreements. You agree to completely and accurately fill out any questionnaires required of those documents. You represent and warrant that any document You electronically sign via the Workspace Service will be truthful.<\/p>\n<p>YOU AGREE TO REVIEW AND EDIT FOR YOUR PURPOSES ANY DOCUMENTS YOU CREATE USING THE SERVICES AND YOU SHALL BE SOLELY RESPONSIBLE FOR THOSE DOCUMENTS. Federal, state or local law (statutory, common or otherwise), constitution, treaty, convention, ordinance, code, rule, regulation, order, injunction, judgment, decree, ruling or other similar requirement enacted, adopted, promulgated or applied by a governmental authority, consumer contracts (collectively, “<strong>Law<\/strong>”) and publicly available facts about entities that issue consumer contracts are voluminous and ever-changing. Accordingly, we cannot and do not guarantee that any information provided through the Services is current. Law relevant to consumers varies depending on the relevant jurisdiction (for example, the applicable U.S. state), and our documents are not, and cannot be, necessarily customized to Your jurisdiction. Your purchase and use of the documents made available through the Services for Your own personal purposes is not practice of the law by us or You. Unlike a lawyer’s advice, the documents made available through the Services are not customized to Your particular circumstances or needs.<\/p>\n<p><strong><strong>4. PAYMENT<\/strong><\/strong><\/p>\n<p><strong>Billing<\/strong>: Upon registering for a Paid Subscription Plan, you acknowledge that the Services have an initial and recurring payment feature, and you accept responsibility for all recurring charges prior to cancellation. FIVERR MAY SUBMIT MONTHLY OR ANNUAL (AS APPLICABLE) CHARGES WITHOUT FURTHER AUTHORIZATION FROM YOU, UNTIL YOU PROVIDE PRIOR NOTICE (RECEIPT OF WHICH IS CONFIRMED BY FIVERR) THAT YOU HAVE TERMINATED THIS AUTHORIZATION OR WISH TO CHANGE YOUR PAYMENT METHOD. SUCH NOTICE WILL NOT AFFECT CHARGES SUBMITTED BEFORE FIVERR REASONABLY COULD ACT. TO TERMINATE YOUR AUTHORIZATION OR CHANGE YOUR PAYMENT METHOD, PLEASE GO TO THE SUBSCRIPTION SETTINGS PAGE ON WORKSPACE SERVICE.<\/p>\n<p><strong>Invoices<\/strong>: An invoice for the Subscription Fee will be issued either on a monthly or annual basis (based on the chosen Paid Subscription Plan), starting on the date You registered Yourself or Your Organization to a Paid Subscription Plan. All invoices will include the Subscription Fee for a one (1) month \/ one (1) year period of use. We will continue invoicing You monthly and\/or yearly (as applicable) until this Agreement is terminated in accordance with Section 10. All of our invoices will be sent to You, or to a billing contact whose details are provided by You (“Billing Contact”), by email. You are responsible for payment of all taxes in addition to the Subscription Fee.<\/p>\n<p><strong>Automatic renewal and Termination of Paid Subscription Plan<\/strong>: At the end of each billing period your Paid Subscription Plan will be renewed automatically, and the applicable Services will automatically continue for the same duration, provided that You continue to pay the prescribed Subscription Fee when due. You may terminate the Paid Subscription Plan within thirty (30) days prior to the expiration of the then applicable Paid Subscription Plan. Otherwise, You will be charged Subscription Fees for the next Paid Subscription Plan.<\/p>\n<p><strong>Subscription<\/strong> <strong>Fee changes<\/strong>: We may change the amount of the Subscription Fee at our sole discretion from time to time subject to an advance notice to You. We may also offer users free trials, special discounts and\/or waive certain Subscription Fees, subject always to our sole discretion.<\/p>\n<p><strong>Payment processors<\/strong>:<\/p>\n<ul>\n<li>We use a third-party payment processing companies (“<strong>Payment Processor<\/strong>”) to bill You through a payment account linked to Your account for use of the Services, as well as to enable processing of payments made to You for Invoices tendered by You. The processing of payments will be subject to the terms, conditions and privacy policies of the Payment Processor in addition to these Terms. We are not responsible for errors by the Payment Processor. By choosing to register to a Paid Subscription Plan, you agree to pay us, through the Payment Processor, all charges at the prices then in effect in accordance with the applicable payment terms and You authorize us, through the Payment Processor, to charge your chosen payment provider (your “<strong>Payment Method<\/strong>”). You agree to make payment using that selected Payment Method. We reserve the right to correct any errors or mistakes that it or its Payment Processor makes even if it has already requested or received payment.<\/li>\n<li>Currently, our Payment Processor for charging Subscription Fees is Stripe (https:\/\/stripe.com). We also use Stripe to process payments to You for invoices tendered by You. If you use Stripe, you agree to the Stripe terms of service (located at https:\/\/stripe.com\/payment-terms\/legal) and privacy policy (located at https:\/\/stripe.com\/us\/privacy).<\/li>\n<li>In certain locations, you may also use WePay, Inc. (“<strong>WePay<\/strong>”) to process payments to You for invoices tendered by You. The WePay terms of service are available here: https:\/\/go.wepay.com\/terms-of-service-us. The WePay privacy policy is available here: https:\/\/go.wepay.com\/privacy-policy-us. If you use the WePay service, you agree to the WePay terms of service and privacy policy. If you have questions regarding the WePay terms of service or privacy policy, please refer to the WePay website (www.wepay.com) or contact WePay at https:\/\/support.wepay.com\/hc\/en-us.<\/li>\n<li>In certain locations, we may also use PayPal to process payments to You for invoices tendered by You. If you use PayPal, you agree to PayPal’s terms of service (located at https:\/\/www.paypal.com\/us\/webapps\/mpp\/ua\/useragreement-full) and privacy policy (located at https:\/\/www.paypal.com\/us\/webapps\/mpp\/ua\/privacy-full).<\/li>\n<\/ul>\n<p><strong>Reaffirmation of Authorization<\/strong>: Your non-termination or continued use of the Services reaffirms that we are authorized to charge You for those Services. We may submit those charges for payment and you will be responsible for such charges. This does not waive our right to seek payment directly from you. Your charges may be payable in advance, in arrears, per usage, or as otherwise described when you initially selected to use the Services.<\/p>\n<p><strong>Preferential pricing or discounts<\/strong>: You may from time to time be offered preferential pricing or discounts for the Services. Eligibility for such preferential pricing or discounts is conditional upon Your acceptance of responsibility for payment of any Subscription Fees in relation to all of Your Organizations, as applicable. Without prejudice to any other rights that we may have under these Terms or at law, we reserves the right to render invoices for the full (non-discounted) Subscription Fees due or suspend or terminate Your use of the Services in respect of any or all of Your Organizations in the event that any invoices for those Subscription Fees are not paid in full by the due date for payment.<\/p>\n<p><strong>Automated Bank transaction data delivered into Your Workspace account<\/strong>: Where available, automated bank account transaction data feeds are generally provided to You free of charge. However, we reserve the right to pass on any charges related to the provision of bank feed data on a case-by-case basis at our sole discretion. We would first inform You via email to indicate what those charges are likely to be (as such charges may vary depending on Your bank and Your volume of bank feeds). You have the option to decide to discontinue use of automated bank feeds at any time. To exercise this option, You must notify us of which automated bank account transaction data feeds You want to discontinue. Upon receiving such notice we will arrange for such feeds to be terminated in accordance with each bank’s usual practices.<\/p>\n<p><strong>30 Days Refund<\/strong>: If you are unhappy with your Paid Subscription Plan for any reason, you can ask for a refund within 30 days of your initial purchase. You can ask for a refund by contacting the Workspace support team. The refund process usually takes 5-10 business days, depending on your financial institution, however, in some cases, refunds may take up to 30 days to appear in your account. If it has been more than 10 business days since the refund was processed by us, please contact your bank directly to inquire about the status of the refund. The refund is available for your first subscription purchase only. Other than as stated in this section, the Subscription Fee is non-cancelable and non-refundable.<\/p>\n<p><strong>Workspace PAY<\/strong>: In certain locations we may offer certain users a seamless onboarding to payment processing services, without requiring users to connect their own Payment Processor to their Workspace account (such service is referred to as “<strong>Pay<\/strong>”). In order to use Pay, You will be required to accept the <a href=\"https:\/\/stripe.com\/connect-account\/legal\">Stripe Connected Account Agreement<\/a>. You also authorise us to forward Stripe your account information in order to process payments made to You by Your clients. We may require that you provide additional information as part of the onboarding or money withdrawal process. You are responsible for the accuracy and completeness of any information about your account details as provided to us as part of the Pay service registration and\/or money withdrawal process. In case that an ACH transfer is failed due to inaccurate information provided by You, You will be responsible to pay any transaction fees associated with such failed transaction.<\/p>\n<p>If you choose to use Workspace’s Pay service, you agree to pay a service fee that is mostly based on the amounts paid by your clients through Pay for your services, and you will pay us such fee per each transaction, as set forth on the Paid Subscription Plan. Current fees are 2.9% + 30 ¢ per credit card transaction (+1% for international cards) and 1.5% per ACH. If you agree to refund any fees to your clients, you will pay us any transaction costs associated with such refund. We may deduct any of the abovementioned fees from payments that are processed through Pay. We may change the prices for Pay at any time. If we do change prices, such change will be notified on the Workspace website at least 30 days in advance. Your continued use of Pay after the price change becomes effective will be considered an agreement to pay the changed amount. You shall be responsible for all taxes associated with the Pay services.<\/p>\n<p><strong>Chargebacks<\/strong>: Payments made by your clients through Pay may be disputed and charged back by your clients (a “Chargeback”). In the event of a Chargeback, You shall owe and immediately pay us the Chargeback amount, as well as any associated fees, fines or penalties associated by such Chargeback. We may deduct any such amounts from payments that are processed through Pay on Your behalf and\/or from your account balance.<\/p>\n<p><strong><strong>5. YOUR OBLIGATIONS AND RESPONSIBILITIES<\/strong><\/strong><\/p>\n<p><strong>General obligations<\/strong>: You must only use the Services for Your own lawful internal business purposes, in accordance with these Terms and any additional or amended terms and conditions posted by us and\/or noticed to you by us.<\/p>\n<p><strong>Registration<\/strong>: You must provide accurate and complete information and keep Your account information updated. You shall not: (i) select or use as a username a name of another person with the intent to impersonate that person; (ii) use as a username a name subject to any rights of a person other than You without appropriate authorization; or (iii) use, as a username, a name that is otherwise offensive, vulgar or obscene. You may never use another person’s user account or registration information for the Services without permission. You must notify us immediately of any change in Your eligibility to use the Services, breach of security or unauthorized use of your account. You should never publish, distribute or post login information for your account. You shall have the ability to delete Your account, either directly or through a request made to one of our employees or affiliates.<\/p>\n<p><strong>Access conditions<\/strong>: You must ensure that all usernames and passwords required to access the Services are kept secure and confidential. You must immediately notify us of any unauthorized use of Your passwords or any other breach of security and we will reset Your password. You must take all other actions that we will reasonably deem necessary to maintain or enhance the security of our computing systems and networks and Your access to the Services.<\/p>\n<p><strong>Prohibited Uses<\/strong>: As a condition of use, You promise not to use the Services for any purpose that is prohibited by these Terms. You are responsible for all of Your activity in connection with the Services. When accessing and using the Services, You shall not (and shall not permit any third party to) either (i) take any action or (ii) upload, download, post, submit, transmit, input, or otherwise distribute or facilitate distribution of any Data on or through the Services that:<\/p>\n<ul>\n<li>infringes any patent, trademark, trade secret, copyright, right of publicity or other right of any other person or entity or violates any law or contractual duty;<\/li>\n<li>You know is false, misleading, untruthful or inaccurate;<\/li>\n<li>is offensive, unlawful, threatening, abusive, harassing, defamatory, libelous, deceptive, fraudulent, invasive of another’s privacy, tortious, obscene, vulgar, pornographic, offensive, profane, contains or depicts nudity, contains or depicts sexual activity, or is otherwise inappropriate as determined by us in our sole discretion;<\/li>\n<li>constitutes unauthorized or unsolicited advertising, junk or bulk e-mail (“<strong>spamming<\/strong>”);<\/li>\n<li>contains software viruses or any other computer codes, files, or programs that are designed or intended to disrupt, damage, limit or interfere with the proper function of any software, hardware, or telecommunications equipment or to damage or obtain unauthorized access to any system, data, password or any other of our information or of any third party;<\/li>\n<li>may damage our, or any other person or entity’s, computing devices or software or may in any way which may impair the functionality of our Services or other systems used to deliver the Services or impair the ability of any other user to use the Services;<\/li>\n<li>constitutes an attempt to modify, copy, adapt, reproduce, disassemble, decompile or reverse engineer any computer programs used to deliver the Services or to operate the Services except as is strictly necessary to use either of them for normal operation;<\/li>\n<li>constitutes an attempt to undermine the security or integrity of our computing systems or networks or, where the Services are hosted by a third party, that third party’s computing systems and networks;<\/li>\n<li>uses any robot, spider, crawlers or other automatic device, process, software or queries that intercepts, “mines,” scrapes or otherwise accesses the Site to monitor, extract, copy or collect information or data from or through the Site, or engage in any manual process to do the same;<\/li>\n<li>removes any copyright notice, identification or any other proprietary notices;<\/li>\n<li>constitutes an attempt to gain unauthorized access to any materials other than those to which You have been given express permission to access or to the computer system on which the Services are hosted;<\/li>\n<li>impersonates any person or entity, including any of our employees or representatives; or<\/li>\n<li>includes anyone’s identification documents or sensitive financial information.<\/li>\n<\/ul>\n<p><strong>Usage Limitations<\/strong>: Your use of the Services may be subject to limitations, including but not limited to monthly transaction volumes and the number of calls You are permitted to make against our application programming interface. Any such limitations will be specified within the applicable Services.<\/p>\n<p><strong>Affiliate Program<\/strong>: From time to time we may implement an affiliate program through which entities may help us obtain Subscribers in exchange for an affiliate referral fee. The terms of the affiliate program will be specified by us at the time of implementation with an affiliate.<\/p>\n<p><strong>Communication Conditions<\/strong>: As a condition of these Terms, if You use any communication tools available through the Services (such as any forum, chat room or message center), You agree only to use such communication tools for lawful and legitimate purposes. You must not use any such communication tool for posting or disseminating any material unrelated to the use of the Services, including (but not limited to): offers of goods or services for sale, unsolicited commercial e-mail, files that may damage any other person’s computing devices or software, content that may be offensive to any other users of the Services, or material in violation of any law (including material that is protected by copyright or trade secrets which You do not have the right to use). When You make any communication on the Services, You represent that You are permitted to make such communication. We are under no obligation to ensure that the communications on the Services are legitimate or that they are related only to the use of the Services. As with any other mobile- or web-based forum, You must exercise caution when using the communication tools available on the Services. However, we do reserve the right to remove any communication at any time at its sole discretion.<\/p>\n<p><strong>Indemnity<\/strong>: You agree to defend, indemnify, and hold harmless Fiverr, its affiliates, and each of its respective employees, contractors, directors, suppliers and representatives from all liabilities, claims, and expenses, including reasonable attorneys’ fees, that arise from or relate to Your use or misuse of, or access to, the Services, including Your violation of the Terms, infringement by You or any third party using Your account or identity in the Services of any intellectual property or other right of any person or entity, and Your breach of any of these Terms or any obligation You may have to Fiverr, including (but not limited to) any costs relating to the recovery of any Subscription Fees that are due but have not been paid by You. We reserve the right to assume the exclusive defense and control of any matter otherwise subject to indemnification by You, in which event You will assist and cooperate with us in asserting any available defenses.<\/p>\n<p><strong><strong>6. DATA PROTECTION<\/strong><\/strong><\/p>\n<p>Fiverr shall process Subscriber Personal Data as Controller under Applicable Data Protection Laws. To learn more about how we use Subscriber Personal Data, please refer to our Privacy Policy, available through the link mentioned at the beginning of these Terms. To the extent that the Subscriber Personal Data includes Personal Data on Data Subjects other than the Subscriber itself, the Subscriber undertakes to inform such Data Subjects of our external Privacy Policy prior to the sharing of such Personal Data.<\/p>\n<p>In relation to Service Data, the Subscriber shall act as Controller and Workspace as Processor for the purposes of making such Service Data available to the Subscriber and preparing reports and documents integrating such Service Data. The Subscriber acknowledges that it is responsible for compliance with its obligations as Controller in this respect.<\/p>\n<p>With respect to the Processing of Service Data, we shall:<\/p>\n<ul>\n<li>Process such Service Data only on behalf of the Subscriber for one or more Business Purposes and on documented instructions from the Subscriber, including with regard to transfers of Personal Data to a third country, unless permitted or required to do so by Applicable Data Protection Laws or other European Union, Member State, or other law to which Fiverr is subject to; in the event of a conflicting legal requirement, Fiverr shall inform the Subscriber of that legal requirement before Processing, unless that law prohibits such information on important grounds of public interest;<\/li>\n<li>not sell Service Data, nor retain, use, or disclose Service Data for any purpose other than the Business Purposes outlined in these Terms or other applicable agreement with the Subscriber;<\/li>\n<li>only transfer Service Data to countries outside of the European Economic Area and Israel if it has provided appropriate safeguards as required by Applicable Data Protection Laws;<\/li>\n<li>ensure that persons authorised to Process such Service Data have committed themselves to confidentiality or are under an appropriate statutory obligation of confidentiality;<\/li>\n<li>implement appropriate technical and organisational measures to ensure a level of security appropriate to the risk, taking into account in particular the risks that are presented by Processing, in particular from accidental or unlawful destruction, loss, alteration, unauthorised disclosure of, or access to Service Data transmitted, stored or otherwise Processed, and ensure that any natural person acting under the authority of Fiverr who has access to Service Data does not Process them except on instructions from the Subscriber, unless he or she is required to do so by Union or Member State law;<\/li>\n<li>respect the following conditions for engaging another sub-processor:\n<ul>\n<li>We shall be authorised to engage other sub-processors, subject to informing the Subscriber of the intended change(s) concerning the addition or replacement of sub-processors, thereby giving the Subscriber the opportunity to object to such changes;<\/li>\n<li>Where we engage another sub-processor for carrying out specific Processing activities on behalf of the Subscriber, we shall impose on that other processor the same data protection obligations as set out in this clause, by way of a contract or other legal act under Union or Member State law. Where that other subprocessor fails to fulfil its data protection obligations, we shall remain fully liable to the Subscriber for the performance of that other processor’s obligations.<\/li>\n<\/ul>\n<\/li>\n<li>taking into account the nature of the Processing, assist the Subscriber by appropriate technical and organisational measures, insofar as this is possible, for the fulfilment of the Subscriber’s obligation to respond to requests for exercising the Data Subject’s rights under Applicable Data Protection Laws;<\/li>\n<li>taking into account the nature of Processing and the information available to Workspace, assist the Subscriber in ensuring compliance with the Subscriber’s obligations under Applicable Data Protection Laws in relation to security of processing, to the notification of any breach of Personal Data to supervisory authorities and Data Subjects where relevant, to the carrying out of data protection impact assessments where required and to prior consultation of the supervisory authority;<\/li>\n<li>at the choice of the Subscriber, delete or return all such Service Data to the Subscriber after the end of the provision of the Workspace Service, and delete existing copies unless Applicable Data Protection Laws requires storage of the Service Data;<\/li>\n<li>make available to the Subscriber all information necessary to demonstrate compliance with these obligations set out in this clause and allow for and assist with audits, including inspections, conducted by the Subscriber or another auditor mandated by the Subscriber. Such audits may only take place at most once per year and during working hours, subject to a minimum of two weeks’ prior notice. The Subscriber undertakes to carry out such an audit through a qualified third-party independent auditor selected by the Subscriber and obliged in writing to maintain confidentiality towards us unless this third-party independent auditor is subject to the general statutory duty of professional secrecy.<\/li>\n<\/ul>\n<p>For the avoidance of doubt, with respect to the Processing of Service Data, we shall be entitled to a reasonable fee from Subscriber for any assistance described herein, and we shall not be liable towards the Subscriber for any breach of Applicable Data Protection Laws that is attributable in whole or in part to the Subscriber or the Subscriber’s instructions.<\/p>\n<p><strong><strong>7. INTELLECTUAL PROPERTY<\/strong><\/strong><\/p>\n<p><strong>Genera<\/strong>l: Except as expressly provided herein, we alone retain all Intellectual Property Rights relating to the Services. Any suggestions, ideas, enhancement requests, feedback, recommendations or other information or documentation provided by You relating to the Services (“Feedback”) shall be assigned by You to us. We will be free to use or disseminate Feedback. You will not copy, distribute, reproduce or use any of the foregoing except as expressly permitted under these Terms.<\/p>\n<p><strong>Ownership of Data<\/strong>: You shall retain all Intellectual Property Rights (if any) in Your Data. You hereby grant us a license to use, copy, transmit, store, and back-up Your information and Data for the purposes of enabling You to access and use the Services and for any other purpose related to provision of the Services to You. You also hereby grant us a license and right to use the Data anonymously and in the aggregate to improve the Services and provide the Services to other customers.<\/p>\n<p><strong>Backup of Data<\/strong>: You must maintain copies of all Data inputted into the Services. We adhere to industry-standard policies and procedures to prevent data loss, but do not make any guarantees that there will be no loss of Data. We expressly exclude liability for any loss of Data no matter how caused.<\/p>\n<p><strong>Third party applications and Your Data<\/strong>: The Services may permit You to link to certain other websites, services or resources (“<strong>Third-Party Applications<\/strong>”) on the Internet, and certain Third-Party Applications may contain links to the Services. If You choose to enable Third-Party Applications for use in conjunction with the Services, You do so at Your own risk. These Third-Party Applications are not under our control. You acknowledge that we may allow the providers of those Third-Party Applications to access Your Data as required for the interoperation of such Third-Party Applications with the Services. You further acknowledge and agree that we shall not be responsible or liable, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any Third-Party Application, or for any disclosure, modification or deletion of Your Data by any Third-Party Applications. We are not responsible for the privacy practices of any Third-Party Applications, and urges You to read the privacy policies of any Third-Party Applications before enabling their use in conjunction with the Services.<\/p>\n<p><strong>Third party content<\/strong>: Content from other users, suppliers, advertisers, and other third parties, including Third-Party Applications, may be made available to You through the Services. Because Fiverr does not control such content, You agree that Fiverr is not responsible for any such content. Fiverr does not make any guarantees about the accuracy, currency, suitability, or quality of the information in such content, and Fiverr assumes no responsibility for unintended, offensive, indecent, objectionable, inaccurate, misleading, or unlawful content made available by other users, advertisers, and other third parties or violation of any third party rights related to such content. You understand that by using the Services You may be exposed to third-party websites that You find. Fiverr makes no warranty, representation, endorsement, or guarantee regarding, and accepts no responsibility for, the quality, content, nature or reliability of Third-Party Applications accessible through the Services. We provide these links for Your convenience only and do not control such websites. The inclusion of links to such websites does not imply any endorsement of the materials on such Third-Party Applications or any association with their operators. The Services may contain links to websites that are operated by Fiverr but which operate under different terms. It is Your responsibility to review the privacy policies and terms of service of any other website or mobile application that You visit. YOU AGREE THAT IN NO EVENT WILL FIVERR BE LIABLE TO YOU IN CONNECTION WITH ANY WEBSITES, CONTENT, MATERIALS, OR PRACTICES OF ANY THIRD PARTY.<\/p>\n<p><strong><strong>8. WARRANTIES AND ACKNOWLEDGEMENTS<\/strong><\/strong><\/p>\n<p><strong>Authority<\/strong>: You warrant that where You have registered to use the Services on behalf of another person or entity, You have the authority to agree to these Terms on behalf of that person or entity and to bind that person or entity to perform any and all obligations that You become subject to by virtue of these Terms, without limiting Your own personal obligations under these Terms.<\/p>\n<p><strong>Acknowledgement<\/strong>: You acknowledge that: You are also authorized to access the processed information and Data that is made available to You through Your use our Services (whether that information and Data is Your own or that of anyone else).<\/p>\n<p>We have no responsibility to any person other than You and nothing in this Agreement confers, or purports to confer, a benefit on any person other than You. If You use our Services on behalf of or for the benefit of anyone other than Yourself (whether a body corporate or otherwise) You acknowledge and agree that:<\/p>\n<ul>\n<li>You are responsible for (i) ensuring that You have the right to do so; and (ii) authorizing any person or entity who is given access to Data;<\/li>\n<li>You agree that we have no obligation to provide any person or entity access to such information or Data without Your authorization and may refer any requests for information to You to address; and<\/li>\n<li>You will indemnify us against any claims or loss relating to:\n<ul>\n<li>Our refusal to provide any person access to Your information or Data in accordance with these Terms,<\/li>\n<li> We make available information or Data to any person with Your authorization.<\/li>\n<\/ul>\n<\/li>\n<li>We do not warrant that use of the Services will be uninterrupted or error-free. Among other things, the operation and availability of the systems used for accessing the Service, including public telephone services, computer networks and the Internet, can be unpredictable and may from time to time interfere with or prevent access to the Services. We are not in any way responsible for any such interference or prevention of Your access or use of the Services.<\/li>\n<li>We are not Your accountant and use of the Services does not constitute the receipt of accounting advice. If You have any accounting questions, please contact an accountant.<\/li>\n<li>It is Your sole responsibility to determine that the Services meet the needs of Your business and are suitable for the purposes for which they are used.<\/li>\n<li>You remain solely responsible for complying with all applicable accounting, tax and other laws. It is Your responsibility to check that storage of and access to Your Data via the Services that will comply with laws applicable to You (including any laws requiring You to retain records).<\/li>\n<\/ul>\n<p><strong>Consumer guarantees<\/strong>: You warrant and represent that You are acquiring the right to access and use the Services for the purposes of a business and that, to the maximum extent permitted by law, any statutory consumer guarantees or legislation intended to protect non-business consumers in any jurisdiction does not apply to the supply of the Services, or the Terms.<\/p>\n<p><strong>Warranty Disclaimer<\/strong>: THE SERVICES PROVIDED BY FIVERR TO YOU ARE PROVIDED “AS IS”, “AS AVAILABLE”, WITH ALL FAULTS AND WITHOUT WARRANTIES, REPRESENTATIONS OR CONDITIONS OF ANY KIND. FIVERR HEREBY DISCLAIMS ALL EXPRESS, IMPLIED, OR STATUTORY WARRANTIES, REPRESENTATIONS OR CONDITIONS, WHETHER WRITTEN OR ORAL, INCLUDING ANY IMPLIED WARRANTIES OF MERCHANTABILITY, TITLE, NONINFRINGEMENT, SECURITY, RELIABILITY, COMPLETENESS, QUIET ENJOYMENT, ACCURACY, QUALITY, INTEGRATION OR FITNESS FOR A PARTICULAR PURPOSE. FIVERR DOES NOT WARRANT THAT THE SERVICES WILL OPERATE WITHOUT INTERRUPTION OR BE ERROR FREE. CERTAIN STATE LAWS MAY NOT ALLOW LIMITATIONS ON IMPLIED WARRANTIES; IF THESE LAWS APPLY TO YOU, SOME OR ALL OF THE ABOVE DISCLAIMERS, EXCLUSIONS, OR LIMITATIONS MAY NOT APPLY TO YOU, AND YOU MAY HAVE ADDITIONAL RIGHTS.<\/p>\n<p><strong><strong>9. LIMITATION OF LIABILITY<\/strong><\/strong><\/p>\n<p>TO THE MAXIMUM EXTENT PERMITTED BY LAW, FIVERR EXCLUDES ALL LIABILITY AND RESPONSIBILITY TO YOU (OR ANY OTHER PERSON) IN CONTRACT, TORT (INCLUDING NEGLIGENCE), STRICT LIABILITY OR ANY OTHER LEGAL OR EQUITABLE THEORY WITH RESPECT TO THE SERVICES, FOR ANY (I) LOSS (INCLUDING LOSS OF INFORMATION, DATA, COST OF PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES, PROFITS AND SAVINGS), (II) BUGS, VIRUSES, TROJAN HORSES, OR THE LIKE (REGARDLESS OF THE SOURCE OF ORIGINATION) OR (III) SPECIAL, INDIRECT, INCIDENTAL, PUNITIVE, COMPENSATORY, CONSEQUENTIAL DAMAGES RESULTING FROM ANY USE OF, OR RELIANCE ON, THE SERVICES. CERTAIN STATE LAWS MAY NOT ALLOW FOR THE LIMITATION OR EXCLUSION OF LIABILITY OR FOR THE LIMITATION OR EXCLUSION OF CERTAIN DAMAGES. IF THESE LAWS APPLY TO YOU, SOME OR ALL OF THE ABOVE DISCLAIMERS, EXCLUSIONS, OR LIMITATIONS MAY NOT APPLY TO YOU. IN SUCH CASES, FIVERR’s LIABILITY WILL BE LIMITED TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW. NOTHING IN THESE TERMS SHALL AFFECT ANY NON-WAIVABLE STATUTORY RIGHTS THAT APPLY TO YOU.<\/p>\n<p>IF YOU SUFFER ANY DIRECT LOSS OR DAMAGE AS A RESULT OF YOUR USE OF THE SERVICES, ANY CLAIM BY YOU AGAINST FIVERR WILL BE LIMITED IN RESPECT OF ANY ONE INCIDENT, OR SERIES OF CONNECTED INCIDENTS, TO THE FEES PAID BY YOU IN THE PREVIOUS TWELVE (12) MONTHS. ANY REFERENCE TO FIVERR IN THIS SECTION ALSO INCLUDES ITS DIRECTORS, EMPLOYEES, AGENTS, PARTNERS, SUPPLIERS OR CONTENT PROVIDERS. THE FOREGOING LIMITATIONS WILL APPLY TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW.<\/p>\n<p>If You are not satisfied with the Services, Your sole and exclusive remedy is to terminate these Terms or Paid Subscription Plan, as applicable, in accordance with these Terms.<\/p>\n<p><strong><strong>10. TERMINATION<\/strong><\/strong><\/p>\n<p><strong>Closing your Workspace account:<\/strong> You may close your Workspace account at any time, subject to payment of all applicable Subscription Fees with respect to your Paid Subscription Plan.<\/p>\n<p><strong>Termination by Fiverr<\/strong>:We reserve the right to put any account on hold or permanently disable accounts due to breach of these Terms of Service or due to any illegal, fraudulent or inappropriate use of the Services. Users with disabled accounts will not be able to use the Services. Users who have violated our Terms of Service and had their account disabled may contact our Customer Support team for more information surrounding the violation and status of the account.<\/p>\n<p><strong>Prepaid Subscriptions<\/strong>: Expect for the 30 Days Refund described herein, we will not provide any refund for any remaining prepaid period for a prepaid Subscription Fee subscription.<\/p>\n<p><strong>Accrued Rights<\/strong>: Termination of this Agreement is without prejudice to any rights and obligations of the parties accrued up to and including the date of termination. On termination of this Agreement You will:<\/p>\n<ul>\n<li>remain liable for any accrued charges and amounts which become due for payment before or after termination;<\/li>\n<li>remain obligated to refrain from any actions prohibited by the Terms that survive termination; and<\/li>\n<li>immediately cease to use our Services.<\/li>\n<\/ul>\n<p><strong>11. HELP DESK<\/strong><\/p>\n<p><strong>Technical Problems<\/strong>: In the case of technical problems, please check the support provided on the Workspace’s website or email us at workspace-support@fiverr.com.<\/p>\n<p><strong>Service availability<\/strong>: While we intend that the Services should be available from 10:00am to 3:00am EST during business days, it is possible that on occasions the Services may be unavailable to permit maintenance or other development activity to take place. If for any reason we have to interrupt the Services for longer periods than we would normally expect, we will use reasonable endeavors to publish in advance details of such activity.<\/p>\n<p><strong><strong>12. APPLE DEVICE AND APPLICATION TERMS<\/strong><\/strong><\/p>\n<p>If you are accessing the Services via an application on a device provided by Apple, Inc. (“<strong>Apple<\/strong>”) or an application obtained through the Apple App Store, the following shall apply:<\/p>\n<p>Both You and Apple acknowledge that these Terms are concluded between You and Fiverr only, and not with Apple, and that Apple is not responsible for, does not endorse, and is not involved in the application;<\/p>\n<p>The application is licensed to You on a limited, non-exclusive, non-transferrable, non-sublicensable basis, solely to be used in connection with the Services for Your private, personal, non-commercial use, subject to these Terms as they are applicable to the Services;<\/p>\n<p>You will only use the application in connection with an Apple device that You own or control;<\/p>\n<p>You acknowledge and agree that Apple has no obligation whatsoever to furnish any maintenance and support services with respect to the application;<\/p>\n<p>In the event of any failure of the application to conform to any applicable warranty, including those implied by law, You may notify Apple of such failure; upon notification, Apple’s sole warranty obligation to You will be to refund to You the purchase price, if any, of the application;<\/p>\n<p>You acknowledge and agree that Fiverr, and not Apple, is responsible for addressing any claims You or any third party may have in relation to the application;<\/p>\n<p>You acknowledge and agree that, in the event of any third party claim that the application or Your possession and use of the application infringes that third party’s intellectual property rights, Fiverr, and not Apple, will be responsible for the investigation, defense, settlement and discharge of any such infringement claim;<\/p>\n<p>You represent and warrant that You are not located in a country subject to a U.S. Government embargo, or that has been designated by the U.S. Government as a “terrorist supporting” country, and that You are not listed on any U.S. Government list of prohibited or restricted parties;<\/p>\n<p>Both You and Fiverr acknowledge and agree that, in Your use of the application, You will comply with any applicable third party terms of service which may affect or be affected by such use; and<\/p>\n<p>Both You and Fiverr acknowledge and agree that Apple and Apple’s subsidiaries are third party beneficiaries of these Terms, and that upon your acceptance of these Terms, Apple will have the right (and will be deemed to have accepted the right) to enforce these Terms against you as the third party beneficiary hereof.<\/p>\n<p><strong><strong>13. ARBITRATION CLAUSE &amp; CLASS ACTION WAIVER – IMPORTANT – PLEASE REVIEW AS THIS AFFECTS YOUR LEGAL RIGHTS:<\/strong><\/strong><\/p>\n<p>YOU AGREE THAT ALL DISPUTES BETWEEN YOU AND US (WHETHER OR NOT SUCH DISPUTE INVOLVES A THIRD PARTY) WITH REGARD TO YOUR RELATIONSHIP WITH US, INCLUDING WITHOUT LIMITATION DISPUTES RELATED TO THESE TERMS OF USE, YOUR USE OF THE SERVICES, AND\/OR RIGHTS OF PRIVACY AND\/OR PUBLICITY, WILL BE RESOLVED BY BINDING, INDIVIDUAL ARBITRATION UNDER THE STREAMLINED ARBITRATION RULES AND PROCEDURES OF JUDICIAL ARBITRATION AND MEDIATION SERVICES, INC. (“JAMS”) THEN IN EFFECT, BY ONE COMMERCIAL ARBITRATOR WITH SUBSTANTIAL EXPERIENCE IN RESOLVING INTELLECTUAL PROPERTY AND COMMERCIAL CONTRACT DISPUTES, WHO SHALL BE SELECTED FROM THE APPROPRIATE LIST OF JAMS ARBITRATORS IN ACCORDANCE WITH SUCH RULES. JUDGMENT UPON THE AWARD RENDERED BY SUCH ARBITRATOR MAY BE ENTERED IN ANY COURT OF COMPETENT JURISDICTION. NOTWITHSTANDING THE FOREGOING OBLIGATION TO ARBITRATE DISPUTES, EACH PARTY SHALL HAVE THE RIGHT TO PURSUE INJUNCTIVE OR OTHER EQUITABLE RELIEF AT ANY TIME, FROM ANY COURT OF COMPETENT JURISDICTION. DISCOVERY AND RIGHTS TO APPEAL IN ARBITRATION ARE GENERALLY MORE LIMITED THAN IN A LAWSUIT, AND OTHER RIGHTS THAT YOU AND WE WOULD HAVE IN COURT MAY NOT BE AVAILABLE IN ARBITRATION. As an alternative, You may bring your claim in Your local “small claims” court, if permitted by that small claims court’s rules and if within such court’s jurisdiction, unless such action is transferred, removed or appealed to a different court. You may bring claims only on Your own behalf. Neither You nor Fiverr will participate in a class action or class-wide arbitration for any claims covered by this agreement to arbitrate. YOU ARE GIVING UP YOUR RIGHT TO PARTICIPATE AS A CLASS REPRESENTATIVE OR CLASS MEMBER ON ANY CLASS CLAIM YOU MAY HAVE AGAINST US INCLUDING ANY RIGHT TO CLASS ARBITRATION OR ANY CONSOLIDATION OF INDIVIDUAL ARBITRATIONS. You also agree not to participate in claims brought in a private attorney general or representative capacity, or consolidated claims involving another person’s account, if we are a party to the proceeding. Any provision of applicable law notwithstanding, the arbitrator will not have authority to award damages, remedies or awards that conflict with these Terms. You agree that regardless of any statute or law to the contrary, any claim or cause of action arising out of, related to or connected with the use of the Services or these Terms must be filed within one (1) year after such claim of action arose or be forever banned. If the prohibition against class actions and other claims brought on behalf of third parties contained above is found to be unenforceable, then all of the preceding language in this Arbitration Clause &amp; Class Action Waiver section will be null and void. This arbitration agreement will survive the termination of Your relationship with us.<\/p>\n<p>If the prohibition against class actions and other claims brought on behalf of third parties contained above is found to be unenforceable, then all of the preceding language in this Arbitration section will be null and void. This arbitration agreement will survive the termination of your relationship with us.<\/p>\n<p><strong><strong>14. GENERAL<\/strong><\/strong><\/p>\n<p><strong>Entire agreement<\/strong>: These Terms, which as stated above incorporate by reference the Privacy Policy and any additional or amended terms and conditions applicable to the Services, constitute the entire agreement between you and us with respect to the Services, and supersede all prior or contemporaneous communications and proposals (whether oral, written or electronic) between You and us with respect to the Services.<\/p>\n<p><strong>Modification<\/strong>: We reserve the right, at our sole discretion, to modify or replace any of these Terms, or change, suspend, or discontinue the Services at any time by posting a notice on Workspace or by sending You notice through the Services, via e-mail or by another appropriate means of electronic communication. We may also impose limits on certain features and services or restrict Your access to parts or all of the Services without notice or liability. It is Your responsibility to check these Terms periodically for changes. If you disagree with any changes we make, You can close your account at any time (according to these Terms) through Your account settings, otherwise, you agree to be bound by the updated terms, which will apply to Your continued use of the Services going forward. Your use of the Services is subject to the Terms in effect at the time of such use.<\/p>\n<p><strong>Force majeure<\/strong>: We shall not be liable for any failure to perform our obligations hereunder where such failure results from any cause beyond our reasonable control, including, without limitation, mechanical, electronic or communications failure or degradation.<\/p>\n<p><strong>Assignment<\/strong>: These Terms are personal to You, and You may not assign, transfer or sublicense (except as expressly permitted hereunder) Your license and\/or right hereunder without our written consent. We may assign, transfer or delegate any of its rights and obligations hereunder without consent.<\/p>\n<p><strong>Agency<\/strong>: No agency, partnership, joint venture, or employment relationship is created as a result of these Terms.<\/p>\n<p><strong>No waiver<\/strong>: Our failure to enforce any part of these Terms shall not constitute a waiver of our right to later enforce that or any other part of these Terms. Waiver of compliance in any particular instance does not mean that we will waive compliance in the future. In order for any waiver of compliance with these Terms to be binding, we must provide You with written notice of such waiver through one of our authorized representatives.<\/p>\n<p><strong>Headings<\/strong>: The section and paragraph headings in these Terms are for convenience only and shall not affect their interpretation.<\/p>\n<p><strong>Governing law and jurisdiction<\/strong>: These Terms shall be governed by and construed in accordance with the laws of the State of New York law, including its conflict of law rules, and the laws of the United States. You agree that any dispute arising from or relating to the subject matter of these Terms shall be governed by the exclusive jurisdiction and venue of the state and federal courts in New York County, New York.<\/p>\n<p><strong>Severability<\/strong>: If any provision of these Terms is found to be unenforceable or invalid, that provision will be limited or eliminated to the minimum extent necessary so that these Terms will otherwise remain in full force and effect and enforceable. The failure of either party to exercise in any respect any right provided for herein shall not be deemed a waiver of any further rights hereunder.<\/p>\n<p><strong>Notices<\/strong>: Any notice given under these Terms by either party to the other must be in writing by email and will be deemed to have been given on transmission. Notices to us must be sent to workspace-support@fiverr.com or to any other email address notified by email to You by us. Notices to You will be sent to the email address which You provided when setting up Your access to the Services.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Last Updated: November 3, 2021 Welcome to Fiverr Workspace, an online back office service designed for freelancers and small businesses. Please read these Terms of Service<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Terms of Service - Fiverr Workspace<\/title>\n<meta name=\"description\" content=\"Please read these Terms of Service (the “Terms”), together with Fiverr’s Privacy Policy (available at https:\/\/www.fiverr.com\/privacy-policy) (“Privacy Policy”)\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/workspace.fiverr.com\/terms\/\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"Terms of Service - Fiverr Workspace\" \/>\n<meta name=\"twitter:description\" content=\"Please read these Terms of Service (the “Terms”), together with Fiverr’s Privacy Policy (available at https:\/\/www.fiverr.com\/privacy-policy) (“Privacy Policy”)\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"44 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Terms of Service - Fiverr Workspace","description":"Please read these Terms of Service (the “Terms”), together with Fiverr’s Privacy Policy (available at https:\/\/www.fiverr.com\/privacy-policy) (“Privacy Policy”)","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/workspace.fiverr.com\/terms\/","twitter_card":"summary_large_image","twitter_title":"Terms of Service - Fiverr Workspace","twitter_description":"Please read these Terms of Service (the “Terms”), together with Fiverr’s Privacy Policy (available at https:\/\/www.fiverr.com\/privacy-policy) (“Privacy Policy”)","twitter_misc":{"Est. reading time":"44 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/workspace.fiverr.com\/#organization","name":"Fiverr","url":"https:\/\/workspace.fiverr.com\/","sameAs":[],"logo":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#logo","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","width":512,"height":512,"caption":"Fiverr"},"image":{"@id":"https:\/\/workspace.fiverr.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/workspace.fiverr.com\/#website","url":"https:\/\/workspace.fiverr.com\/","name":"Fiverr Workspace","description":"","publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/workspace.fiverr.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/workspace.fiverr.com\/terms\/#webpage","url":"https:\/\/workspace.fiverr.com\/terms\/","name":"Terms of Service - Fiverr Workspace","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/#website"},"datePublished":"2021-10-21T07:27:33+00:00","dateModified":"2021-11-04T12:28:55+00:00","description":"Please read these Terms of Service (the “Terms”), together with Fiverr’s Privacy Policy (available at https:\/\/www.fiverr.com\/privacy-policy) (“Privacy Policy”)","breadcrumb":{"@id":"https:\/\/workspace.fiverr.com\/terms\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/workspace.fiverr.com\/terms\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/workspace.fiverr.com\/terms\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Fiverr Workspace","item":"https:\/\/workspace.fiverr.com\/"},{"@type":"ListItem","position":2,"name":"Terms of Service"}]}]}},"_links":{"self":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/pages\/10417"}],"collection":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/comments?post=10417"}],"version-history":[{"count":0,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/pages\/10417\/revisions"}],"wp:attachment":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media?parent=10417"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}