{"id":1117,"date":"2020-11-25T22:15:30","date_gmt":"2016-10-10T08:05:30","guid":{"rendered":"https:\/\/blog.and.co\/?p=1117"},"modified":"2021-11-03T13:23:51","modified_gmt":"2021-11-03T13:23:51","slug":"advice-on-how-to-live-your-most-successful-freelance-life","status":"publish","type":"post","link":"https:\/\/workspace.fiverr.com\/blog\/advice-on-how-to-live-your-most-successful-freelance-life\/","title":{"rendered":"Advice on How to Live Your Most Successful Freelance Life"},"content":{"rendered":"<p><span style=\"font-weight: 400\">A busy freelancer spends a lot of time by herself, but we freelancers also have a lot to learn from one another. That&#8217;s why we took some time to talk to freelancers Carol D&#8217;Annunzio and Katie Lane. <\/span><br \/>\nBoth had important things to say about transitioning to a full-time freelance career, how to manage (and make more) money, and how to lead a successful freelance life. Take a few minutes to evaluate where you are in your career by checking out their interviews below.<\/p>\n<h2>Carol D&#8217;Annunzio Shares Her Thoughts on Residual Freelance Income<\/h2>\n<p><span style=\"font-weight: 400\">Carol D’Annunzio is a writer and editor who helps self-publishing authors and solo entrepreneurs get better reviews on Amazon (and other review sites), sell more e-books and info products, and feel more confident in their writing abilities. To get your complimentary guide, “<\/span><i><span style=\"font-weight: 400\">The Top 5 Grammar Mistakes and How to Correct Them” go to<\/span><\/i><a href=\"https:\/\/www.carolda.com\/\"> <i><span style=\"font-weight: 400\">https:\/\/www.carolda.com\/<\/span><\/i><\/a><i><span style=\"font-weight: 400\">. <\/span><\/i><br \/>\n<b>AND CO: When did you begin freelancing? Do you do it full-time? If so, did you leave a traditional career behind? Tell us about your transition to full-time freelance work (or, if you freelance part-time, how you supplement your day job with freelance work).<\/b><br \/>\nCarol: I began freelancing part-time in 2005 after the birth of my son. Prior to this, I worked full-time in an insurance agency. I had the boss from hell and going to work was a nightmare so beginning my maternity leave was such a relief. I knew that going back to regular employment wasn’t going to be an option so I seized the opportunity during my maternity leave to take an online class for Virtual Assistants. That was my first freelance business.<br \/>\nI was lucky. At the time I started my business, my husband was working full-time and we had money in the bank so it was a relatively easy transition into freelance work, at least financially. My husband has since opened his own trucking company.<br \/>\n<b>AND CO: What are the most important traits a freelancer should have? Why? Did you have these traits when you started or did you learn them as you went along?<\/b><br \/>\nCarol: The most important traits a freelancer should have are passion and perseverance. There are many people who begin a freelance career thinking they can make a quick buck. However, if you don’t have passion, if you don’t love what you do, the novelty of owning your business will wear out quickly; especially if you don’t start making money right away.<br \/>\nYou also need perseverance because it takes time and effort to build a successful, lasting career. Freelancing is a marathon not a sprint. When I started my business I thought I would quickly get clients and have a flourishing career immediately. Not so much! It took time to build relationships and I had to face unexpected obstacles in getting my business off the ground.<br \/>\n<b>AND CO: What have you learned about yourself from your pursuit of a freelancing career? Do you have any juicy success or failure stories you can share with us?<\/b><br \/>\nCarol: I’ve learned that it is okay to have more than one passion and to change course when necessary. I used to feel so scattered and partly ADD (I’m not) because I’ve always had a lot of things I liked to do. Being a freelancer allows me to encompass many of those passions into my life.<br \/>\n<span style=\"font-weight: 400\">I’ve also learned that going out of your comfort zone isn’t just okay, it is a <\/span><i><span style=\"font-weight: 400\">good<\/span><\/i><span style=\"font-weight: 400\"> thing! I am an introvert by nature and it takes a lot for me to put myself in unfamiliar situations. However, when I do, it is almost always a rewarding and growing experience. But this took time. I mentioned that transitioning to freelancing was easy from a financial perspective; however, transitioning my mindset was difficult. I had to work through fears, anxiety and doubts, and to be honest, I still face them at times. It is a matter of pushing through.<\/span><br \/>\nNo, I don’t have any juicy success or failure stories. Mine is the tale of slowly plodding along doing the next necessary thing and tweaking as I go!<br \/>\n<b>AND CO: What are some ways that freelancers can increase their income (ideally while simultaneously decreasing working hours)?<\/b><br \/>\nCarol: I was raised with the idea that the more you worked the more you will make. I’ve since learned that isn’t always true. The term “residual income” was a foreign concept until recently. Residual income comes from making or producing something once and then getting a continual income from that product. A couple of ways freelancers can use residual income to increase their income include writing books and creating online courses.<br \/>\nAnother way freelancers can increase their income is through affiliate marketing. With affiliate marketing, you can sell other people’s products and be paid a certain amount of commission off the sale. I am not an expert in affiliate marketing, by any means, but I have made a small, yet consistent, amount of money this way.<br \/>\n<b>AND CO: If a friend or family member were thinking about pursuing a freelance career, what advice would you give them?<\/b><br \/>\nCarol: Don’t let perfectionism or fear stop you. In the beginning, I spent endless amounts of time researching, planning, and getting everything I thought I “needed” to start a business–but didn’t actually start the business. I wanted everything to be just perfect. But this perfectionism was nothing more than a manifestation of fear. Once I acknowledged this I was able to work through the fear and get going. Therefore, remember there is no such thing as perfectionism, if you really want to start a freelance career, start it, even if you have to do it afraid.<\/p>\n<h2>Katie Lane Talks Negotiations, Finances for Freelancers<\/h2>\n<p><span style=\"font-weight: 400\">Katie Lane is an attorney and negotiation coach who works with artists and freelancers to help them protect their rights and get paid fairly for the work they do.  Based in Portland, Oregon, she helps her clients successfully handle all sorts of sticky conflicts and shares negotiation and legal info for creative professionals on her blog, <\/span><a href=\"https:\/\/www.workmadeforhire.net\/blog\"><span style=\"font-weight: 400\">Work Made For Hire<\/span><\/a><span style=\"font-weight: 400\">. Her favorite thing is teaching people who are intimidated by negotiation how to get what they want with confidence and calm. You can follow her on Twitter @_katie_lane.<\/span><br \/>\n<b>AND CO: When did you begin freelancing? Do you do it full-time? If so, did you leave a traditional career behind? Tell us about your transition to full-time freelance work (or, if you freelance part-time, how you supplement your day job with freelance work).<\/b><br \/>\nKatie: I started my business part-time in 2012. I had a full-time job in the compliance department of our local electric utility at the time and it came with all those great benefits like health insurance and regular paychecks, so I didn’t want to go to work for myself full-time until I knew whether or not I would actually like it and could get clients. I loved it and had no problem attracting clients so I spent about two years paying off debt and socking away savings. My wife is a cartoonist and author so we wanted to make sure we have enough savings to supplement our income when I transitioned to working for myself full-time. It was a long two years maintaining my day job and building my business full time, but having now benefited from all of that work, I’m glad I did it that way. I’ve been working for myself full time since April 2014.<br \/>\n<b>AND CO: What are the most important traits a freelancer should have? Why? Did you have these traits when you started or did you learn them as you went along?<\/b><br \/>\nKatie: There are a lot of different traits that help manage a freelance career, but I think the most important is self-compassion. This is hard work: not only are you doing the work that you’re really good at and that you love, you also have to learn how to run a business. When you work for yourself, you end up doing a lot of stuff you aren’t very good at because you’re the only one available to do everything that a small business demands. You have to be kind to yourself and accept that mistakes will happen, even when you try really hard to avoid them.<br \/>\nI talked to a lot of friends who worked for themselves before I went full-time and asked about their experiences. One of those friends, a fellow solo attorney, told me, “Katie, you will have bills that will get paid late, and I don’t mean by a couple days. You need to start being OK with that right now. Because the money will come, you will be fine, but it won’t be like what you’re used to in a salary job.” At the time I thought it was kind of depressing advice, or that I could plan around it, but he was right and I now realize what he was really saying was, “Be kind to yourself.”<br \/>\n<b>AND CO: What have you learned about yourself from your pursuit of a freelancing career? Do you have any juicy success or failure stories you can share with us?<\/b><br \/>\nI have learned so much about myself from this work, and I thought I knew myself pretty darn well before I started my business. I’ve learned how fantastic it feels to do work every day that I’m passionate about and that uses my talents and skills. I love the comradery of working with clients who are also working for themselves; I love that I get to help them lighten the load on legal issues so they can focus more on what they’re really good at and care about. I’ve learned the incredible value of asking for help – you may start out doing All The Jobs, but if you’re going to sustain a freelance career, you have to ask for help.<br \/>\n<b>AND CO: What are some ways that freelancers can increase their income (ideally while simultaneously decreasing working hours)?<\/b><br \/>\nKatie: I have to say this because it’s kind of my thing: negotiate! Don’t accept the first number a client offers you and don’t focus just on the numbers when you negotiate over money. Instead, focus on value. What are they getting from you and what do you have to give up to work with them? Make sure your compensation actually compensates you for the value you provide. And if it doesn’t, say no to the job. If you don’t turn down bad jobs, you won’t have the time, capacity or energy to take on good ones.<br \/>\nI resisted this so much when I was working for other people and now I don’t know why: building systems for things you do on a regular basis. Whether that’s templates or checklists or automating tasks, if it saves you time and energy it makes you money. I’ve realized over time that while certain parts of my work are incredibly valuable for my clients, not everything I do is. If I can spend less time on the stuff that has less personal value for my clients but needs to be done, I can spend more time on the work that they do value and that provides greater financial rewards. Or I can just work less, which is also great. You don’t need to write that email from scratch every time. You can have clients fill out online forms to gather information you need.<br \/>\nI also think it’s important to make sure you get outside feedback on your business on a regular basis. It’s easy to get so focused on what you’re doing that you don’t appreciate what clients and potential clients find truly valuable about your work. Solicit feedback from clients and peers to make sure that you’re offering the services and products people find most valuable. By doing this I’ve learned that there are things I can offer that I think of as easy and not very valuable but that my clients and audience really appreciate.<br \/>\n<b>AND CO: If a friend or family member were thinking about pursuing a freelance career, what advice would you give them?<\/b><br \/>\nKatie: Pay off any consumer debt you have and consolidate the rest of your debt as best you can before you start working for yourself full time. Save as much money as you can to supplement your income; it’s much easier to say no to bad jobs when you know you have savings. Seek out other freelancers and talk with them about how they work, but understand that there are certain things you can only learn from experience. When you work for yourself, it’s easy to become isolated, so take steps to make sure you see friends and talk with peers on a regular basis. Be kind to yourself. You can absolutely do this.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A busy freelancer spends a lot of time by herself, but we freelancers also have a lot to learn from one another. That&#8217;s why we took<\/p>\n","protected":false},"author":67,"featured_media":7747,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[16],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Advice on How to Live Your Most Successful Freelance Life<\/title>\n<meta name=\"description\" content=\"Freelancer always has a lot to learn from one another. Take a few minutes to evaluate where you are in your career by checking out their interviews below.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/workspace.fiverr.com\/blog\/advice-on-how-to-live-your-most-successful-freelance-life\/\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"Advice on How to Live Your Most Successful Freelance Life\" \/>\n<meta name=\"twitter:description\" content=\"Freelancer always has a lot to learn from one another. Take a few minutes to evaluate where you are in your career by checking out their interviews below.\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"JOHN ARTHUR\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Advice on How to Live Your Most Successful Freelance Life","description":"Freelancer always has a lot to learn from one another. Take a few minutes to evaluate where you are in your career by checking out their interviews below.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/workspace.fiverr.com\/blog\/advice-on-how-to-live-your-most-successful-freelance-life\/","twitter_card":"summary_large_image","twitter_title":"Advice on How to Live Your Most Successful Freelance Life","twitter_description":"Freelancer always has a lot to learn from one another. Take a few minutes to evaluate where you are in your career by checking out their interviews below.","twitter_misc":{"Written by":"JOHN ARTHUR","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/workspace.fiverr.com\/#organization","name":"Fiverr","url":"https:\/\/workspace.fiverr.com\/","sameAs":[],"logo":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#logo","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","width":512,"height":512,"caption":"Fiverr"},"image":{"@id":"https:\/\/workspace.fiverr.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/workspace.fiverr.com\/#website","url":"https:\/\/workspace.fiverr.com\/","name":"Fiverr Workspace","description":"","publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/workspace.fiverr.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/blog\/advice-on-how-to-live-your-most-successful-freelance-life\/#primaryimage","inLanguage":"en-US","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/workspace.fiverr.com\/blog\/advice-on-how-to-live-your-most-successful-freelance-life\/#webpage","url":"https:\/\/workspace.fiverr.com\/blog\/advice-on-how-to-live-your-most-successful-freelance-life\/","name":"Advice on How to Live Your Most Successful Freelance Life","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/advice-on-how-to-live-your-most-successful-freelance-life\/#primaryimage"},"datePublished":"2016-10-10T08:05:30+00:00","dateModified":"2021-11-03T13:23:51+00:00","description":"Freelancer always has a lot to learn from one another. Take a few minutes to evaluate where you are in your career by checking out their interviews below.","breadcrumb":{"@id":"https:\/\/workspace.fiverr.com\/blog\/advice-on-how-to-live-your-most-successful-freelance-life\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/workspace.fiverr.com\/blog\/advice-on-how-to-live-your-most-successful-freelance-life\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/workspace.fiverr.com\/blog\/advice-on-how-to-live-your-most-successful-freelance-life\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Fiverr Workspace","item":"https:\/\/workspace.fiverr.com\/"},{"@type":"ListItem","position":2,"name":"Advice on How to Live Your Most Successful Freelance Life"}]},{"@type":["Article","BlogPosting"],"@id":"https:\/\/workspace.fiverr.com\/blog\/advice-on-how-to-live-your-most-successful-freelance-life\/#article","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/blog\/advice-on-how-to-live-your-most-successful-freelance-life\/#webpage"},"author":{"@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/45ec0d0aed45bf5e67cbf6daffa6ad3d"},"headline":"Advice on How to Live Your Most Successful Freelance Life","datePublished":"2016-10-10T08:05:30+00:00","dateModified":"2021-11-03T13:23:51+00:00","mainEntityOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/advice-on-how-to-live-your-most-successful-freelance-life\/#webpage"},"wordCount":2189,"publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"image":{"@id":"https:\/\/workspace.fiverr.com\/blog\/advice-on-how-to-live-your-most-successful-freelance-life\/#primaryimage"},"thumbnailUrl":"","articleSection":["LIFESTYLE"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/45ec0d0aed45bf5e67cbf6daffa6ad3d","name":"JOHN ARTHUR","image":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/7f627ea99bdc36afc0c196aca21f3011?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/7f627ea99bdc36afc0c196aca21f3011?s=96&d=mm&r=g","caption":"JOHN ARTHUR"},"description":"John Arthur is a contributor for AND CO. Beyond writing, he is passionate about music and is a member of the band, The Deafening Colors.","sameAs":["https:\/\/www.thedeafeningcolors.com"]}]}},"_links":{"self":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/1117"}],"collection":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/users\/67"}],"replies":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/comments?post=1117"}],"version-history":[{"count":0,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/1117\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media?parent=1117"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/categories?post=1117"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/tags?post=1117"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}