{"id":11312,"date":"2021-12-28T08:31:28","date_gmt":"2021-12-28T08:31:28","guid":{"rendered":"https:\/\/workspace.fiverr.com\/?p=11312"},"modified":"2022-03-27T08:41:09","modified_gmt":"2022-03-27T08:41:09","slug":"the-ultimate-digital-nomad-packing-list","status":"publish","type":"post","link":"https:\/\/workspace.fiverr.com\/blog\/the-ultimate-digital-nomad-packing-list\/","title":{"rendered":"The Ultimate Digital Nomad Packing List"},"content":{"rendered":"\n<p>If you’re toying with the idea of pursuing a nomadic lifestyle or contemplating a long-term trip, the way you pack will be significantly different than the way an average traveler would. No doubt you’ll have special considerations that stationary workers and casual travelers don’t have. So, what do you pack when you travel as a digital nomad? These packing tips will help you be a productive and happy remote worker—from anywhere!<\/p>\n\n\n\n<h3>Digital Nomad Backpacks<\/h3>\n\n\n\n<p>Let’s start with what you’re putting everything in: your backpack. As a frequent—in fact, constant—traveler, you don’t want to waste time rummaging around your bag, or waiting for one at luggage carousels. And, you want to make sure your stuff is safe. When selecting a backpack, make sure you look for a product that:<\/p>\n\n\n\n<ul><li>Provides numerous pockets for top-notch organization<\/li><li>Has a TSA-friendly panel for your laptop<\/li><li>Has zippers that let you lock up<\/li><li>Is carry-on size<\/li><li>Is built to last (you’ll be taking it everywhere, after all)<\/li><\/ul>\n\n\n\n<p>One option to consider: <a href=\"https:\/\/www.tortugabackpacks.com\/products\/outbreaker-travel-backpack\">Tortuga’s Outbreaker backpack<\/a> (available in two sizes: 35-liter and 45-liter). As a digital nomad, I love that I can easily slip my laptop in and out of the bag and it’s protected in its own pouch. The built in organizational panels and zippered compartments that make it easy for me to find a charger, toothbrush, pair of socks, or whatever else I may need quickly. For the extreme Type A’s among us, Tortuga also offers packing cubes for meticulous compartmentalization. The wet\/dry bag is perfect for stashing dirty laundry, or perhaps that damp swimsuit or muddy pair of shoes. Add the packable duffle, which is conveniently exactly the dimensions of a personal item on major airlines as overflow space for those few things you’re inevitably going to pick up along the way. When it comes to which bag to choose for heading to the coffee shop or co-working space, a well-designed, waterproof daypack with well-padded shoulder straps is a must. Waterproof and durable are key if you’re planning to carry laptop in it and you need it to hold up over the long haul as a digital nomad.<\/p>\n\n\n\n<h3>Electronics<\/h3>\n\n\n\n<p>Electronics (and the accessories that accompany them) are perhaps the biggest consideration and the most carefully selected items that remote workers will bring with them. Here’s a good starting list:<\/p>\n\n\n\n<ul><li>Laptop &amp; case<\/li><li>Mouse<\/li><li>Kindle<\/li><li>Smartphone<\/li><li>Camera, extra batteries and case (optional if you have a smartphone)<\/li><li>GoPro (highly optional)<\/li><li>External battery<\/li><li>Universal adapter, like the Loop all-in-one<\/li><li>Headphones<\/li><li>Chargers<\/li><li>External hard drive, or thumb drive (there are thumb drives with up to 1TB of space, of space, but most nomads opt for 32GB)<\/li><li>A lock to keep it all safe in your bag or hostel locker<\/li><\/ul>\n\n\n\n<p>Before we move on, there are a couple more considerations for digital nomads and their electronics.<\/p>\n\n\n\n<h4>Laptop<\/h4>\n\n\n\n<p>I love my MacBook Air, but some digital nomads will want a computer that they can get repaired anywhere in the world (Apple doesn’t have stores in a lot of the more popular destinations). For them, a netbook is a good option. Dell and HP are popular brands for this. I’ve also tested out traveling with an Android tablet and keyboard combo. Though light, I found that I was a little slower working on it. So, it’s fine for a month or two, but probably not a full year of travel.<\/p>\n\n\n\n<h4>Camera<\/h4>\n\n\n\n<p>Depending on the scope of your work, a smartphone camera might be good enough. For something with a higher photo quality, a mirrorless camera is the way to go. They’re point-and-shoot size, but DSLR quality.<\/p>\n\n\n\n<h4>Electronics Insurance<\/h4>\n\n\n\n<p>Picking up some basic electronics insurance is likely a good idea. Think of insurance as investing in your future interests. As a nomad, you need to make sure you’re protecting your stuff, and opting for an affordable yet comprehensive travel insurance policy is smart way to safeguard yourself against the cost of replacing valuable electronics. Full disclosure: I’ve never purchased travel insurance. However, after sharing an office with the team at <strong>WorldNomads<\/strong> (a travel insurance provider) and getting an iPad swiped in Hawaii, I think that was a poor decision on my part, especially for those longer trips where I carried more electronics than usual. If you’re traveling with a lot of electronics, I recommend springing for insurance. With any policy, you’ll need do your due diligence and read the fine print, since not all providers have your electronics covered in the base fee. Worth noting, “Claims for lost, stolen, or destroyed laptops and tablets fall under the travel insurance coverage for baggage,” according to Travel Insurance Review (www.travelinsurancereview.net).<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><strong><em>Nomad tip:<\/em><\/strong><\/p><p><strong><em>“Add extra money in your budget to fix and\/or purchase new electronics. Computers get fried from constant motion, salt, sand, sun and charging in different voltages. Phones get dropped into squat toilets accidentally and break, SIM cards get lost, and all of this matters when being connected is your top priority.”<\/em><\/strong><\/p><p><strong><em>Kelly Lewis, Founder, Go! Girl Guides, Nepal<\/em><\/strong><\/p><\/blockquote>\n\n\n\n<h4>Digital Storage Solution<\/h4>\n\n\n\n<p>Leave the giant external hard drive at home and get a 64GB or 128GB USB drive or SD card ($20 to $100+ depending on make\/model). These things are so small you barely even notice them in your computer and are incredibly valuable if your job requires you to work with large files.<\/p>\n\n\n\n<h4>Headphones<\/h4>\n\n\n\n<p>I use my headphones pretty much every day whether I am working, at the gym, or just wandering the city. You will want to invest in a good pair that can block out the noise while you’re working at cafes or co-working spaces. If you are going to be taking regular client calls, spring for over-the-ear headphones with a dedicated microphone so you don’t have to worry about noise in public areas.<\/p>\n\n\n\n<h4>Travel Speaker<\/h4>\n\n\n\n<p>If you work on a team like I do, it’s nice to have music playing on a&nbsp;portable Bluetooth speaker that everyone can listen to. These are fairly inexpensive and easily fit in the side pocket of your backpack. Plus, they’re instant party starters at hostels.<\/p>\n\n\n\n<h4>HDMI Cable<\/h4>\n\n\n\n<p>It may seem like a strange thing to carry, but my HDMI cable has actually saved me more times than I can count. Costing less than $10, they take up almost no room, and allow you to connect to TVs and external monitors; perfect for working or watching movies on a bigger screen.<\/p>\n\n\n\n<h4>Kindle (or other e-book reader)<\/h4>\n\n\n\n<p>Some people might disagree with me on this, but if you’re like me, you spend a lot of time reading on flights, buses, and trains. A Kindle is much easier to read on than a phone, and you can store hundreds of books to last your entire trip.<\/p>\n\n\n\n<h3>Clothing<\/h3>\n\n\n\n<p>Of course, you are also going to be living out of your bag, so you’ll need more than just work gear. Doing laundry while traveling is much easier, and less expensive, than you might think. For clothes, digital nomads —who are usually longer term travelers, as well — should still stick to the seven-day rule. I’ll often allow myself a couple of extra pairs of underwear and one nicer outfit when I’m on the road for months at a time, since I want to feel like myself (even if I’m working outside of my comfort zone). For clothes, here’s a good place to start:<\/p>\n\n\n\n<ul><li>5 to 7 days’ worth of shirts, socks, and underwear<\/li><li>1 warm jacket, for long nights and colder weather locations<\/li><li>1 pair of comfortable shoes: Unless you’re planning some multi-day climbs, you don’t need special shoes to travel.<\/li><li>1 pair of flip-flops<\/li><li>1 bathing suit<\/li><li>1 pair of zip-off pants: Far from the most “on trend” option, these are nice to have in places where the weather can change at any moment.<\/li><li>1 pair of dark jeans: Dark jeans are versatile enough to be worn around town or to nicer restaurants and meetings.<\/li><li>1 pair of shorts<\/li><li>1 pair of mesh shorts, for home &amp; sleeping<\/li><\/ul>\n\n\n\n<p>I’ll also make sure that I can work out in at least one of these outfit combos, usually basic colored leggings and a T-shirt I don’t mind getting dirty, since staying healthy on the road is so important.<\/p>\n\n\n\n<h4>Professional Outfit<\/h4>\n\n\n\n<p>You never know what opportunities might arise while you are traveling, so it definitely makes sense to bring at least one nicer button down shirt. Dark jeans and sneakers will suit you fine for nicer settings, but if you are trying to make a good impression with a potential client or investor, your Tiger Beer tank top isn’t going to cut it.<\/p>\n\n\n\n<h3>Toiletries<\/h3>\n\n\n\n<p>Traveling for months at a time with only a 3-oz. bottle of shampoo is rough. While I won’t detail every item you’ll need to pack, here are some essential items to include in your own list:<\/p>\n\n\n\n<ul><li>A bar of soap, rather than body wash<\/li><li>Collapsible bottles<\/li><li>Lip balm, tweezers, nail clippers, &amp; basic medications<\/li><li>Travel-sized deodorants<\/li><li>A comb, not a brush<\/li><li>Toothbrush &amp; toothpaste<\/li><li>Feminine hygiene products for women<\/li><li>Band-Aids, ibuprofen and other basic first aid items<\/li><\/ul>\n\n\n\n<p>For travel beauty, keep it simple and versatile. Bar soaps last longer and do double duty as laundry soap, collapsible bottles allow you to refill, travel-sized deodorant lasts forever, and a comb is more compact than a brush. Stowaway Cosmetics make travel-sized beauty products designed to be used on the road without taking up excessive space. As an added bonus, the products are cruelty-free!<\/p>\n\n\n<span class='bctt-click-to-tweet'><span class='bctt-ctt-text'><a href='https:\/\/twitter.com\/intent\/tweet?url=https%3A%2F%2Fworkspace.fiverr.com%2Fblog%2Fthe-ultimate-digital-nomad-packing-list%2F&#038;text=What%20should%20you%20pack%20if%20you%27re%20about%20to%20become%20a%20digital%20nomad%3F%20This%20packing%20list%20covers%20it%20all.%20&#038;via=andco&#038;related=andco' target='_blank'rel=\"noopener noreferrer\">What should you pack if you&#039;re about to become a digital nomad? This packing list covers it all.  <\/a><\/span><a href='https:\/\/twitter.com\/intent\/tweet?url=https%3A%2F%2Fworkspace.fiverr.com%2Fblog%2Fthe-ultimate-digital-nomad-packing-list%2F&#038;text=What%20should%20you%20pack%20if%20you%27re%20about%20to%20become%20a%20digital%20nomad%3F%20This%20packing%20list%20covers%20it%20all.%20&#038;via=andco&#038;related=andco' target='_blank' class='bctt-ctt-btn'rel=\"noopener noreferrer\">Click To Tweet<\/a><\/span>\n\n\n\n<h3>Lifestyle<\/h3>\n\n\n\n<p>Bring the items that make you happy since even when you are thousands of miles from home, you’re not on vacation. This is your life, and you’ll want the things that make you you. A few “comforts of home” you might want to pack if you’re traveling longer term include:<\/p>\n\n\n\n<h4>Portable\/Personal Coffeemaker<\/h4>\n\n\n\n<p>Unless you’re renting an apartment or staying at a major hotel, chances are you won’t have a coffeemaker on hand. As such, the Bodum French Press Thermos is a great product to have if you can fit it in your bag.<\/p>\n\n\n\n<h4>Tupperware &amp; Sporks<\/h4>\n\n\n\n<p><a href=\"https:\/\/www.charlieontravel.com\">Charlie On Travel<\/a>, a green travel blog, recommends traveling with Tupperware and sporks to reduce plastic waste and be more eco-friendly. Hey, you’ve gotta carry those yummy airplane snacks in something, right? Her sporks are from <a href=\"https:\/\/www.lightmyfire.com\">Light My Fire<\/a>&nbsp;and come with a case to keep your bag clean.<\/p>\n\n\n\n<h4>Collapsible Water Bottle<\/h4>\n\n\n\n<p>Charlie and I both agree on this one: Bring a water bottle, but make sure it’s collapsible. That way, it doesn’t take up a ton of room in your backpack when it’s not in use.<\/p>\n\n\n\n<h4>Running Shoes &amp; Yoga Mat<\/h4>\n\n\n\n<p>I hate running, but I’ve got to admit, it really is the most portable exercise. Stay active, and put those shoes to use on the trail, too (because hiking boots are a pain anyway, am I right?). As for yoga, my favorite mat is the foldable <a href=\"https:\/\/www.gaiam.com\">Gaiam<\/a>&nbsp;travel mat, which is ideal for on-the-road flow sessions.<\/p>\n\n\n\n<h3>Other essentials<\/h3>\n\n\n\n<p>The following items didn’t fit nicely in our other categories, but they’re no less important for digital nomads on the road:<\/p>\n\n\n\n<ul><li>Passport (take a photo of your passport and have a print backup)<\/li><li>Travel towel (or sarong)<\/li><li>Travel flashlight or headlamp<\/li><li>Eye mask &amp; earplugs<\/li><li>Pen<\/li><li>Small notebook<\/li><li>A day-bag<\/li><li>A laundry line or rope<\/li><li>Duct tape (because it can fix almost anything)<\/li><li>One piece of non-digital entertainment, like a book or pack of cards<\/li><\/ul>\n\n\n\n<h3>Final advice for packing<\/h3>\n\n\n\n<p>Limit your “just in case” items to the things that you know you absolutely won’t be able to get on the road (which isn’t much, really) or would be in a huge pickle without (like a luggage lock).<\/p>\n\n\n\n<h3>Now that your bag is ready to go, are you?<\/h3>\n\n\n\n<p>At the same time, bring the things that make you, well, you. Whether it’s a coffee maker or your running shoes, you’ll want to adapt, not ditch, your stationary life for your nomadic one. By traveling with few belongings and being as flexible as possible, you will make the logistics of the experience easier. Now that your bag is ready to go, are you? <em><strong>This post was written by Jennifer Miller, Editor, Tortuga Backpacks, as part of our Digital Nomad series.For more info on being a digital nomad, check out our <a href=\"https:\/\/workspace.fiverr.com\/blog\/setting-your-business-goals-as-a-digital-nomad\/\">eBook<\/a>.<\/strong><\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you’re toying with the idea of pursuing a nomadic lifestyle or contemplating a long-term trip, the way you pack will be significantly different than the<\/p>\n","protected":false},"author":13,"featured_media":10341,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[12],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>The Ultimate Digital Nomad Packing List - Fiverr Workspace<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/workspace.fiverr.com\/blog\/the-ultimate-digital-nomad-packing-list\/\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"The Ultimate Digital Nomad Packing List - Fiverr Workspace\" \/>\n<meta name=\"twitter:description\" content=\"If you’re toying with the idea of pursuing a nomadic lifestyle or contemplating a long-term trip, the way you pack will be significantly different than the\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/3Z1hQfew.jpeg\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"AND CO\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"The Ultimate Digital Nomad Packing List - Fiverr Workspace","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/workspace.fiverr.com\/blog\/the-ultimate-digital-nomad-packing-list\/","twitter_card":"summary_large_image","twitter_title":"The Ultimate Digital Nomad Packing List - Fiverr Workspace","twitter_description":"If you’re toying with the idea of pursuing a nomadic lifestyle or contemplating a long-term trip, the way you pack will be significantly different than the","twitter_image":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/3Z1hQfew.jpeg","twitter_misc":{"Written by":"AND CO","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/workspace.fiverr.com\/#organization","name":"Fiverr","url":"https:\/\/workspace.fiverr.com\/","sameAs":[],"logo":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#logo","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","width":512,"height":512,"caption":"Fiverr"},"image":{"@id":"https:\/\/workspace.fiverr.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/workspace.fiverr.com\/#website","url":"https:\/\/workspace.fiverr.com\/","name":"Fiverr Workspace","description":"","publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/workspace.fiverr.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/blog\/the-ultimate-digital-nomad-packing-list\/#primaryimage","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/3Z1hQfew.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/3Z1hQfew.jpeg","width":1200,"height":576},{"@type":"WebPage","@id":"https:\/\/workspace.fiverr.com\/blog\/the-ultimate-digital-nomad-packing-list\/#webpage","url":"https:\/\/workspace.fiverr.com\/blog\/the-ultimate-digital-nomad-packing-list\/","name":"The Ultimate Digital Nomad Packing List - Fiverr Workspace","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/the-ultimate-digital-nomad-packing-list\/#primaryimage"},"datePublished":"2021-12-28T08:31:28+00:00","dateModified":"2022-03-27T08:41:09+00:00","breadcrumb":{"@id":"https:\/\/workspace.fiverr.com\/blog\/the-ultimate-digital-nomad-packing-list\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/workspace.fiverr.com\/blog\/the-ultimate-digital-nomad-packing-list\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/workspace.fiverr.com\/blog\/the-ultimate-digital-nomad-packing-list\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Fiverr Workspace","item":"https:\/\/workspace.fiverr.com\/"},{"@type":"ListItem","position":2,"name":"The Ultimate Digital Nomad Packing List"}]},{"@type":["Article","BlogPosting"],"@id":"https:\/\/workspace.fiverr.com\/blog\/the-ultimate-digital-nomad-packing-list\/#article","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/blog\/the-ultimate-digital-nomad-packing-list\/#webpage"},"author":{"@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/4ff06c2bbb3e54c6e56865d711d49c64"},"headline":"The Ultimate Digital Nomad Packing List","datePublished":"2021-12-28T08:31:28+00:00","dateModified":"2022-03-27T08:41:09+00:00","mainEntityOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/the-ultimate-digital-nomad-packing-list\/#webpage"},"wordCount":2088,"publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"image":{"@id":"https:\/\/workspace.fiverr.com\/blog\/the-ultimate-digital-nomad-packing-list\/#primaryimage"},"thumbnailUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/3Z1hQfew.jpeg","articleSection":["Digital Nomad"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/4ff06c2bbb3e54c6e56865d711d49c64","name":"AND CO","image":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/ecc254b0e766561e981565a2b90a2774?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/ecc254b0e766561e981565a2b90a2774?s=96&d=mm&r=g","caption":"AND CO"},"sameAs":["https:\/\/workspace.fiverr.com\/"]}]}},"_links":{"self":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/11312"}],"collection":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/users\/13"}],"replies":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/comments?post=11312"}],"version-history":[{"count":0,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/11312\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media\/10341"}],"wp:attachment":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media?parent=11312"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/categories?post=11312"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/tags?post=11312"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}