{"id":11532,"date":"2022-04-10T10:29:58","date_gmt":"2022-04-10T10:29:58","guid":{"rendered":"https:\/\/workspace.fiverr.com\/?p=11532"},"modified":"2022-04-10T10:30:00","modified_gmt":"2022-04-10T10:30:00","slug":"what-is-an-invoice","status":"publish","type":"post","link":"https:\/\/workspace.fiverr.com\/blog\/what-is-an-invoice\/","title":{"rendered":"What is an invoice? Everything you need to know about invoices"},"content":{"rendered":"\n<p>Where you’re a freelancer or a large company, sending invoices is an essential part of any successful business. However, for freelancers who don’t have a dedicated financial team, invoicing can be time consuming and overwhelming, if you don’t know precisely what you’re doing. We’ve put together a comprehensive overview of exactly what an invoice is, why it’s an important process for freelancers to master, and what you need to create a professional invoice that will ensure you get paid on time.<\/p>\n\n\n\n<h2>What is an invoice?<\/h2>\n\n\n\n<p>An invoice is a document that records a transaction between a buyer and a seller. It provides a detailed breakdown of the costs associated with the goods or services sold, and provides terms of payment, details of any discounts or additional handling costs, and the seller’s bank details to ensure seamless processing. Invoicing is a key part of the accounting process, allowing businesses to track revenue expenditure and freelancers to request and track payments for products and services.<\/p>\n\n\n\n<h3>Why are invoices important for freelancers?<\/h3>\n\n\n\n<p>It is essential that both businesses and freelancers are able to keep accurate records of their transactions. There are a number of reasons why sending detailed invoices to each of your clients is vital for maintaining a successful freelance business.&nbsp;<\/p>\n\n\n\n<h3>Taxes and Auditing<\/h3>\n\n\n\n<p>As a freelancer, you are not on a regular payroll. This means that you are responsible for paying your own taxes and Social Security contributions, if you’re a US citizen. In order to remain compliant, you’ll need to keep meticulous records of all of your invoices in one place, so that if <a href=\"https:\/\/turbotax.intuit.ca\/tips\/what-small-businesses-should-know-about-the-audit-process-6134\" target=\"_blank\" rel=\"noreferrer noopener\">you are audited<\/a>, you’ll be able to prove how much you’ve earned for each of your services rendered.<\/p>\n\n\n\n<h3>Settling Disputes<\/h3>\n\n\n\n<p>Having a record of the work that you have delivered to your client can come in handy, if there is a dispute. A dispute may entail a client questioning the amount of work you’ve done, the time spent on the job, or the terms that were agreed upon.<\/p>\n\n\n\n<h3>Securing Payments Professionally<\/h3>\n\n\n\n<p>Sending an invoice to a client is the most professional way of requesting payment. Asking for payment is already a contentious issue, so instead of informally asking for payment in an email, sending a formal, detailed invoice is best professional practice. If you’re going to be dealing with established businesses, they will expect – insist on, in fact – a comprehensive invoice for their records, so it’s best to be prepared with an invoice before they have to chase you down to make payment. Automating your invoicing is a great way to ensure that invoices are sent out on time and payments are made promptly.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"800\" height=\"534\" src=\"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2022\/04\/Invoice.jpg\" alt=\"\" class=\"wp-image-11533\" srcset=\"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2022\/04\/Invoice.jpg 800w, https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2022\/04\/Invoice-300x200.jpg 300w, https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2022\/04\/Invoice-768x513.jpg 768w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/figure>\n\n\n\n<h2>What are the different types of invoices?<\/h2>\n\n\n\n<p>There are many different types of invoices that are used in a range of circumstances. Typically, freelancers will only make use of a standard invoice or final invoice, but it’s important to know the difference between the main types of invoices, in case your client requires a specific type. We have outlined some of the most common types of invoices for freelancers.<\/p>\n\n\n\n<h3>Invoice<\/h3>\n\n\n\n<p>As mentioned, an invoice is a detailed record of your transaction with a client. It is usually sent to the client after you have delivered the work and are ready to collect payment. For obvious reasons, this type of invoice is referred to as a final or standard invoice. For the purposes of this guide, we’ll be referring to a final or standard invoice, as this is typically the most common invoice used by freelancers. A final invoice will have all of the information needed for the client to make a payment, as well as everything you need to keep an accurate record of your sales. An invoice is different to a receipt in that.<\/p>\n\n\n\n<p><strong>When to send: <\/strong>After completion and delivery of the project<\/p>\n\n\n\n<h3><strong>Proforma invoice<\/strong><\/h3>\n\n\n\n<p><a href=\"https:\/\/www.investopedia.com\/terms\/p\/pro-forma-invoice.asp\" target=\"_blank\" rel=\"noreferrer noopener\">Proforma invoices<\/a> are often confused with standard invoices. In fact, a proforma invoice is something entirely different to a record of goods or services purchased. A proforma invoice is sent, before you complete your services and details what the services will entail, along with what costs are involved. A proforma invoice is similar to <a href=\"https:\/\/www.yellow.com.au\/business-hub\/8-advantages-of-offering-a-quote-to-your-customers\/\" target=\"_blank\" rel=\"noreferrer noopener\">a quote<\/a> or a detailed proposal, in that your client can refer to it to see what you’ll cover and your estimated pricing. However, unlike a quote or a proposal, a proforma invoice is considered a binding agreement. The terms of sale, however, might still change before you begin the project, but the costing remains accurate to allow the client to prepare funds and avoid rate changes before the transaction is finalized.<\/p>\n\n\n\n<p><strong>When to send:<\/strong> Before starting the job, so as to ensure you and the client are on the same page<\/p>\n\n\n\n<h3><strong>I<\/strong>nterim and Retainer Invoices<\/h3>\n\n\n\n<p>Interim and retainer invoices are useful if you’ve been hired by a client for a very big project that entails different stages, or if you’ve been hired for ongoing work. <a href=\"https:\/\/www.adobe.com\/sign\/hub\/document-types\/types-of-invoices\" target=\"_blank\" rel=\"noreferrer noopener\">An interim invoice<\/a> is well-suited to large projects that can be separated into stages. Rather than sending one final invoice at the end of the project, you can send an interim invoice after completing each stage. This allows the client to compensate you in stages for the work you’ve completed. A retainer invoice is used when a client has booked your services in advance on a recurring basis. You’ll typically send a retainer invoice at the beginning of the month, which will cover a certain amount of work or hours that need to be completed throughout that month.<\/p>\n\n\n\n<p><strong>When to send: <\/strong>Interim invoices are sent after each stage of the project has been completed and retainer invoices are sent at the beginning of each retainer period, or as outlined in your retainer contract<\/p>\n\n\n\n<h3>Timesheet invoice<\/h3>\n\n\n\n<p>If you charge by the hour instead of per project, a timesheet invoice might be helpful for you. A timesheet invoice outlines the amount of hours worked, your cost per hour, and the total amount payable. If you’re charging by the hour, you will probably need to track the hours that you spend working, so <a href=\"https:\/\/workspace.fiverr.com\/time-tracking\/\" target=\"_blank\" rel=\"noreferrer noopener\">an invoicing system with a built-in time tracker<\/a> can save you from manually filling out those dreaded time sheets.<\/p>\n\n\n\n<p><strong>When to send: <\/strong>After completion and delivery of the project<\/p>\n\n\n\n<h2><strong>What information is included in an invoice?<\/strong><\/h2>\n\n\n\n<p>There are standard elements that should be included in an invoice to eliminate any confusion and ensure that the payment process is seamless.<\/p>\n\n\n\n<ul><li>Your contact details, including your name, address, contact number, and email address<\/li><li>Your client’s details, including their business name, name of contact person, business address, contact number, and email address<\/li><li>The date you send the invoice<\/li><li>The final date you expect payment to be made<\/li><li>An invoice number <\/li><li>A description of the work, including clear details about the services rendered. You can itemize this list if you have performed more than one service.<\/li><li>The amount due for each service rendered<\/li><li>The total amount payable<\/li><li>Your payment terms, including how you expect to be paid and the time period they have in which to compensate you (typically <a href=\"https:\/\/blog.apruve.com\/the-difference-between-net-30-and-due-in-30-days\" target=\"_blank\" rel=\"noreferrer noopener\">30 days<\/a>). <\/li><li>Remember to include your banking details for local bank payments, or your bank code for international payments. If you’re using an online payment platform, you should include a link to the payment portal.<\/li><\/ul>\n\n\n\n<h2><strong>What is an invoice number?<\/strong><\/h2>\n\n\n\n<p>An invoice number is a unique number that allows you to identify each invoice. An invoice number is important for tracking, referencing, and general accounting purposes. It allows you to see exactly when payment was made and by whom, so as to avoid any confusion. You can either use sequential numbers or referential numbers for invoicing. With each new order, sequential numbers (e.g. 00101, 00102, 00103..) can be increased incrementally and eliminate the chances of double invoicing, but the numbers do not signify anything about the order itself, so it’s not very helpful when trying to identify orders at a glance. Referential numbers make invoices easier to identify by encoding information about the order into the invoice number. You can use your client’s initials, the project type, or the date of the order in your invoice number to identify which invoice number belongs to which project quickly and easily (e.g. FWS-02-22). You can also use a combination of sequential and referential numbers to easily identify your invoice and have a well-organized system that increases incrementally (e.g. FWS-02-22-001, FWS-02-22-002…).<\/p>\n\n\n\n<h2>How to create an invoice<\/h2>\n\n\n\n<h3> Design an invoice template<\/h3>\n\n\n\n<p>Creating an invoice might seem like a daunting task, but it doesn’t have to be a complicated process. If you’re creating your invoice manually, you’ll probably want to design a template that you can simply update each time you complete an order. Just because you’re a freelancer doesn’t mean you can’t have unique branding. Personalizing your invoice is important to signify that you’re a professional, who has thought about your brand’s style and general aesthetic. To this end, you’ll want to i<strong>nclude your custom logo<\/strong> at the top of the invoice and integrate your color palette and brand’s font into the document. Try to keep your font legible and professional when dealing with numbers. Your numbers should all be in a table with service line items, rates, and totals set out in a logical way. Once you’re done with creating your invoice, you should always save and send it as a PDF so it can’t be altered.<\/p>\n\n\n\n<h3>Automate your invoicing<\/h3>\n\n\n\n<p>Of course, automating the invoicing process will save you valuable time and resources. Fiverr Workspace allows you to generate branded and <a href=\"https:\/\/workspace.fiverr.com\/invoicing\/\" target=\"_blank\" rel=\"noreferrer noopener\">customized invoices<\/a> within seconds. Beyond creating invoices quickly and efficiently, the platform allows you to accept secure payments directly through your invoices, send automated reminders to clients, when payments are due, track if your invoice has been opened, and notify you when you’ve been paid. You have the option of sending a recurring invoice for retainer clients or a milestone invoice for large projects, which is essentially an interim invoice. If you’re wanting to send a timesheet invoice, Fiverr Workspace has an in-built time tracker that allows you to track your work hours on the platform and generate your invoices automatically. <\/p>\n\n\n\n<p>Leveraging the power of invoice automation can significantly reduce the amount of time you spend on admin, eliminate unnecessary errors, and ensure that this crucial part of being a freelancer is stress-free, so you can focus on providing exceptional services to your growing client base.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Where you’re a freelancer or a large company, sending invoices is an essential part of any successful business. However, for freelancers who don’t have a dedicated<\/p>\n","protected":false},"author":142,"featured_media":10945,"comment_status":"closed","ping_status":"closed","sticky":true,"template":"","format":"standard","meta":[],"categories":[2],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>What Is An Invoice? | Learn About Invoices | Fiverr Workspace<\/title>\n<meta name=\"description\" content=\"What is an invoice? What information is included in an invoice? What are the different types of invoices? Fiverr Workspace answer these questions and more\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/workspace.fiverr.com\/blog\/what-is-an-invoice\/\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"What Is An Invoice? | Learn About Invoices | Fiverr Workspace\" \/>\n<meta name=\"twitter:description\" content=\"What is an invoice? What information is included in an invoice? What are the different types of invoices? Fiverr Workspace answer these questions and more\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/11\/free-invoice-template-woman@2x.png\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Fiverr Workspace Team\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"What Is An Invoice? | Learn About Invoices | Fiverr Workspace","description":"What is an invoice? What information is included in an invoice? What are the different types of invoices? Fiverr Workspace answer these questions and more","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/workspace.fiverr.com\/blog\/what-is-an-invoice\/","twitter_card":"summary_large_image","twitter_title":"What Is An Invoice? | Learn About Invoices | Fiverr Workspace","twitter_description":"What is an invoice? What information is included in an invoice? What are the different types of invoices? Fiverr Workspace answer these questions and more","twitter_image":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/11\/free-invoice-template-woman@2x.png","twitter_misc":{"Written by":"Fiverr Workspace Team","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/workspace.fiverr.com\/#organization","name":"Fiverr","url":"https:\/\/workspace.fiverr.com\/","sameAs":[],"logo":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#logo","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","width":512,"height":512,"caption":"Fiverr"},"image":{"@id":"https:\/\/workspace.fiverr.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/workspace.fiverr.com\/#website","url":"https:\/\/workspace.fiverr.com\/","name":"Fiverr Workspace","description":"","publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/workspace.fiverr.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/blog\/what-is-an-invoice\/#primaryimage","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/11\/free-invoice-template-woman@2x.png","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/11\/free-invoice-template-woman@2x.png","width":1440,"height":1164},{"@type":"WebPage","@id":"https:\/\/workspace.fiverr.com\/blog\/what-is-an-invoice\/#webpage","url":"https:\/\/workspace.fiverr.com\/blog\/what-is-an-invoice\/","name":"What Is An Invoice? | Learn About Invoices | Fiverr Workspace","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/what-is-an-invoice\/#primaryimage"},"datePublished":"2022-04-10T10:29:58+00:00","dateModified":"2022-04-10T10:30:00+00:00","description":"What is an invoice? What information is included in an invoice? What are the different types of invoices? Fiverr Workspace answer these questions and more","breadcrumb":{"@id":"https:\/\/workspace.fiverr.com\/blog\/what-is-an-invoice\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/workspace.fiverr.com\/blog\/what-is-an-invoice\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/workspace.fiverr.com\/blog\/what-is-an-invoice\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Fiverr Workspace","item":"https:\/\/workspace.fiverr.com\/"},{"@type":"ListItem","position":2,"name":"What is an invoice? Everything you need to know about invoices"}]},{"@type":["Article","BlogPosting"],"@id":"https:\/\/workspace.fiverr.com\/blog\/what-is-an-invoice\/#article","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/blog\/what-is-an-invoice\/#webpage"},"author":{"@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/961918685cb457bf79d10553e5d84fc7"},"headline":"What is an invoice? Everything you need to know about invoices","datePublished":"2022-04-10T10:29:58+00:00","dateModified":"2022-04-10T10:30:00+00:00","mainEntityOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/what-is-an-invoice\/#webpage"},"wordCount":1774,"publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"image":{"@id":"https:\/\/workspace.fiverr.com\/blog\/what-is-an-invoice\/#primaryimage"},"thumbnailUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/11\/free-invoice-template-woman@2x.png","articleSection":["Freelance knowledge"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/961918685cb457bf79d10553e5d84fc7","name":"Fiverr Workspace Team","image":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/bb707af8aaaf3ce4991ba4e0ce5d55a0?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/bb707af8aaaf3ce4991ba4e0ce5d55a0?s=96&d=mm&r=g","caption":"Fiverr Workspace Team"}}]}},"_links":{"self":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/11532"}],"collection":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/users\/142"}],"replies":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/comments?post=11532"}],"version-history":[{"count":0,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/11532\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media\/10945"}],"wp:attachment":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media?parent=11532"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/categories?post=11532"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/tags?post=11532"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}