{"id":1427,"date":"2020-11-25T22:15:35","date_gmt":"2016-11-14T08:40:58","guid":{"rendered":"https:\/\/blog.and.co\/?p=1427"},"modified":"2021-11-03T13:23:50","modified_gmt":"2021-11-03T13:23:50","slug":"taking-your-personal-brand-to-next-level","status":"publish","type":"post","link":"https:\/\/workspace.fiverr.com\/blog\/taking-your-personal-brand-to-next-level\/","title":{"rendered":"Taking Your Personal Brand to the Next Level"},"content":{"rendered":"<p><span style=\"font-weight: 400\">News flash: You don’t control your brand. <\/span><br \/>\n<span style=\"font-weight: 400\">Your audience (or lack thereof) does. Or, as author Marty Neumeier puts it in his <\/span><i><span style=\"font-weight: 400\">Brand Gap<\/span><\/i><span style=\"font-weight: 400\">: <\/span><br \/>\n<i><span style=\"font-weight: 400\">“[Your brand] is not what you say it is. It’s what they say it is.” <\/span><\/i><br \/>\n<span style=\"font-weight: 400\">In other words, a brand is not a logo, a couple of canonical fonts and colors, and the latest tagline. <\/span><br \/>\n<span style=\"font-weight: 400\">It’s an identity. <\/span><br \/>\n<span style=\"font-weight: 400\">And as anyone who’s studied a little postmodernism or psychology knows, identity is a social construct. It’s an amalgam of <\/span><i><span style=\"font-weight: 400\">what you say<\/span><\/i><span style=\"font-weight: 400\"> your brand is and what <\/span><i><span style=\"font-weight: 400\">other people feel<\/span><\/i><span style=\"font-weight: 400\"> about your brand.<\/span><br \/>\n<span style=\"font-weight: 400\">So if you already established a personal and\/or freelance brand and want to take it a few steps further, you’ve got to focus on how people perceive you <\/span><i><span style=\"font-weight: 400\">now<\/span><\/i><span style=\"font-weight: 400\">. To find out how people perceive you now, just ask. <\/span><br \/>\n<span style=\"font-weight: 400\">How you ask that question will look a little different depending on what work you’ve already done, but it all boils down to finding out what people think about the “you” you’ve worked so hard to define on the web. You might sit down with people who know your work and ask them what <\/span><i><span style=\"font-weight: 400\">they<\/span><\/i><span style=\"font-weight: 400\"> think you’re passionate about, what you’re good at, and where your expertise lies. Or you might send a survey out to your newsletter list and ask for their thoughts on what you publish now, and what they want to see more of.<\/span><br \/>\n<span style=\"font-weight: 400\">However you gather this intel on your personal brand, the important thing is the next step, when you ask yourself:<\/span><br \/>\n<span style=\"font-weight: 400\"><em>Is this the brand I want to be?<\/em> <\/span><br \/>\n<span style=\"font-weight: 400\">If your answer’s a resounding “yes,” you’re in a very good place. Don’t get me wrong: it’ll take some work to build your freelance brand and extend your influence further. But most of that work will be about doubling-down on what you’re already doing. More on that in a moment. <\/span><br \/>\n<span style=\"font-weight: 400\">If your answer to the question “is this the brand I want” is a “not so much,” the job’s a bit different, and I’ll dive into that toward the end of this article.<\/span><br \/>\n<span style=\"font-weight: 400\">But first, let’s see what you need to focus on if your personal brand looks good, but you want to go a step further.<\/span><\/p>\n<h2><b>How to extend a personal brand you already love<\/b><\/h2>\n<p><span style=\"font-weight: 400\">If you dig what people think and say about you already — or if it at least accurately captures what you’re <\/span><i><span style=\"font-weight: 400\">trying<\/span><\/i><span style=\"font-weight: 400\"> to do with your personal brand, congrats! Your next steps are all about doing what you already do, but doing more of it, better.<\/span><\/p>\n<h3><b>Take a look at your personal website and social properties<\/b><\/h3>\n<p><span style=\"font-weight: 400\">First step is to take a look at the core of your personal brand: those online spaces where you built the foundation of your personal brand. <\/span><br \/>\n<span style=\"font-weight: 400\">Review the work you’ve shared, the blogs you’ve posted, and the tweets you fire out to the world. Take a look at the little snippets of text you use to brand yourself on these profiles, and always ask yourself: <\/span><\/p>\n<ul>\n<li><b><b>Am I doing the best possible job of representing my brand?<\/b><\/b><\/li>\n<li><b>Does this particular profile align with or connect to my other profiles?<\/b><span style=\"font-weight: 400\"> I.e., do your Twitter and LinkedIn profiles look and feel they represent the same person, or are they totally divergent? <\/span><\/li>\n<li><b>Is what I’m doing in this space valuable?<\/b><span style=\"font-weight: 400\"> I.e., is the time you’re investing on this network or website yielding tangible results for your personal brand?<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400\">If you don’t feel like your self-descriptions represent your brand, edit them. And think carefully about the value of consistency or divergence across your profiles. <\/span><br \/>\n<span style=\"font-weight: 400\">Ensuring that they’re consistent from network to network will ensure everyone’s getting the same experience of you — but it can certainly be valuable to spice things up from network to network. For instance, you might use the same headshot on both LinkedIn and Twitter, but you might <\/span><i><span style=\"font-weight: 400\">not<\/span><\/i><span style=\"font-weight: 400\"> post your expletive-filled tirade against Trump on LinkedIn.<\/span><br \/>\n<span style=\"font-weight: 400\">Or maybe you totally do. Maybe <\/span><i><span style=\"font-weight: 400\">that’s<\/span><\/i><span style=\"font-weight: 400\"> your brand. <\/span><br \/>\n<span style=\"font-weight: 400\">The idea here is that there’s no one rule that applies equally to all of us. The important thing is to think carefully about how your present yourself online, and make sure everything you do on each work is <\/span><i><span style=\"font-weight: 400\">intentional<\/span><\/i><span style=\"font-weight: 400\">, and not just the result of a 3 a.m., wine-fueled tweetstorm. <\/span><\/p>\n<h3><b>Build (more) relationships<\/b><\/h3>\n<p><span style=\"font-weight: 400\">Since a brand is a social construct — i.e., more about what <\/span><i><span style=\"font-weight: 400\">they<\/span><\/i><span style=\"font-weight: 400\"> think than what <\/span><i><span style=\"font-weight: 400\">you<\/span><\/i><span style=\"font-weight: 400\"> say — socializing is an incredibly powerful tool for building your brand and influence as a freelancer. <\/span><br \/>\n<span style=\"font-weight: 400\">So, try to engage more. If you’ve mostly been broadcasting whatever content you create (be it articles or designs or sound bytes), then try jumping into conversations on topics you care about <\/span><i><span style=\"font-weight: 400\">without<\/span><\/i><span style=\"font-weight: 400\"> sharing some external URL. Or if the reverse is true, try broadcasting more of your content. <\/span><br \/>\n<span style=\"font-weight: 400\">Also, dig deeper into your social worlds. Most social networks go quite deep, with all kinds of little niche groups springing up across their scattered URLs. <\/span><br \/>\n<span style=\"font-weight: 400\">So spend a day searching through Facebook and LinkedIn for groups focused on topics you care about. Devote some time to trawling Twitter for others who speak on the same topics and industries you do, follow them, and explore their work. Ditto for Google+, if you’re on there. And look out for some <\/span><a href=\"https:\/\/www.slacklist.info\/\"><span style=\"font-weight: 400\">Slack teams you might join<\/span><\/a><span style=\"font-weight: 400\">. <\/span><br \/>\n<span style=\"font-weight: 400\">The key here, as is always true with social networks, is to be human, and be genuine. Don’t contribute <\/span><i><span style=\"font-weight: 400\">just<\/span><\/i><span style=\"font-weight: 400\"> because you want to extend your freelance brand. Contribute because you <\/span><i><span style=\"font-weight: 400\">care<\/span><\/i><span style=\"font-weight: 400\"> about the topic and the community. If the groups you join truly reflect the same concerns as your personal brand, it shouldn’t be hard. <\/span><br \/>\n<span style=\"font-weight: 400\">The best part about these communities, when it comes to sharing your own content, is that they’ll become the <\/span><i><span style=\"font-weight: 400\">perfect<\/span><\/i><span style=\"font-weight: 400\"> sounding boards for your work. They’ll often provide feedback on in-progress creations, and help spread the word for fleshed-out stuff. Super powerful.<\/span><\/p>\n<h3><b>Double down on your core topics<\/b><\/h3>\n<p><span style=\"font-weight: 400\">Take a look at the stuff you create and share with the world, and think carefully about how you can do more with that. <\/span><br \/>\n<span style=\"font-weight: 400\">If you’ve built a reputation as a commentator on interaction design, consider how you might deepen that reputation. If you wrote a listicle about the qualities of great interactions, maybe take a deep dive into each quality, and turn it into a series. Or better yet, a whole ebook! Or build a website that curates and comments on super interaction designs on the web, like a <\/span><a href=\"https:\/\/www.useronboard.com\/\"><span style=\"font-weight: 400\">UserOnboard<\/span><\/a><span style=\"font-weight: 400\"> for interactions. Or create an email course to help others learn what makes for an awesome interaction. <\/span><br \/>\n<span style=\"font-weight: 400\">You might even start putting a price tag on your expertise. Maybe charge for that ebook, instead of putting it out there for free? <\/span><\/p>\n<h3><b>Aim higher with your publications<\/b><\/h3>\n<p><span style=\"font-weight: 400\">If you’ve been building your brand for a while, chances are that you already publish a ton of stuff, most of it for free. Whether it’s articles on Medium, Dribbble shots, Instagrams, or long-winded rants on Facebook, you publish. <\/span><br \/>\n<span style=\"font-weight: 400\">But as you’ve probably learned, getting any attention for all that publishing you do can be tough. <\/span><br \/>\n<span style=\"font-weight: 400\">So let others do the work for you, and maybe get paid for it too. Find Medium Publications that might want your work and submit to them. Pitch esteemed industry publications like Smashing Magazine, UX Booth, and A List Apart. Put together some talk outlines and see if you can’t get HOW, Typo, or Generate to bite.<\/span><\/p>\n<h3><b>“Work” for free<\/b><\/h3>\n<p><span style=\"font-weight: 400\">You know how you know you’ve made it? <\/span><br \/>\n<span style=\"font-weight: 400\">When other professionals in your space <\/span><i><span style=\"font-weight: 400\">want your opinion<\/span><\/i><span style=\"font-weight: 400\">. When they’re not asking for your feedback because you’re just part of the process, but because they value your opinions and experience and feel like their work will be that much better with your input. <\/span><br \/>\n<span style=\"font-weight: 400\">So embrace those moments when Joe from your last gig wants you to review his latest landing page. Offer to help people in one of those communities you recently joined (see “Build (more) relationships” above) write or edit their next blog post or conference talk pitch. Be the guy or gal who actually <\/span><i><span style=\"font-weight: 400\">does<\/span><\/i><span style=\"font-weight: 400\"> provide extensive, thoughtful feedback on that portfolio shared to Designer News or Reddit. <\/span><br \/>\n<span style=\"font-weight: 400\">And this doesn’t stop at providing feedback on others’ work. You can even take on creative work for nonprofits or community efforts. Or it could mean building out that simple app you’ve always wanted but never saw making any money — but doing it as an open source or community project. Just think of it as <\/span><a href=\"https:\/\/qz.com\/817958\/no-free-work-is-the-wrong-advice-for-creative-people-career-advice-from-graphic-design-legend-paula-scher\/?ref=webdesignernews.com\"><span style=\"font-weight: 400\">working for influence, instead of money<\/span><\/a><span style=\"font-weight: 400\">.<\/span><br \/>\n<span style=\"font-weight: 400\">Not only will those you help appreciate it, you’ll start to build a reputation for being genuinely helpful within your community. Plus, you’ll literally have the chance to embed your own ideas and viewpoints within others’ work — and if that’s not influence at work, I don’t know what is.<\/span><\/p>\n<h3><b>Consider a little investment<\/b><\/h3>\n<p><span style=\"font-weight: 400\">Brace yourself: this might sound a little crazy. <\/span><br \/>\n<span style=\"font-weight: 400\">But as someone who’s worked in content marketing for several years now, I can definitely attest to the efficacy of this method, at least when it comes to sharing content. <\/span><br \/>\n<span style=\"font-weight: 400\">The big problem is that it <\/span><i><span style=\"font-weight: 400\">might<\/span><\/i><span style=\"font-weight: 400\"> feel a little bit … icky. Because if you’re like many people (including me), advertising’s brand is about as high-quality as Fox News’. It just feels like pandering. <\/span><br \/>\n<span style=\"font-weight: 400\">But here’s the thing: if your content is high-quality, you’re not pandering. You’re just buying visibility. And in a world so crowded with content publishers are desperate for you to just <\/span><i><span style=\"font-weight: 400\">see<\/span><\/i><span style=\"font-weight: 400\">, let alone share, that’s pretty valuable. <\/span><br \/>\n<span style=\"font-weight: 400\">So consider setting aside a little money to promote your very best, most valuable work. Such as that premium ebook or email course you built out (see “Double down on your core topics”). It could pay off in spades. <\/span><br \/>\n<span style=\"font-weight: 400\">But investing in your brand doesn’t just have to be focused on content promotion. You might also consider hiring that amazing developer you know to revamp your website, or even create a custom logo just for you. Or engage a copywriter you know to rewrite your site copy with your input. <\/span><br \/>\n<span style=\"font-weight: 400\">Everything worth doing is worth spending a little money on, at one point or another. And if your personal brand is a key element of how you make money, it’s worth all the more. As they say, you gotta spend money to make money! <\/span><\/p>\n<h2><b>Ok, so what if I don’t love where my personal brand’s at?<\/b><\/h2>\n<p><span style=\"font-weight: 400\">If you aren’t <\/span><i><span style=\"font-weight: 400\">loving<\/span><\/i><span style=\"font-weight: 400\"> what you’re hearing about your personal brand, it’s time for your own personal pivot. <\/span><br \/>\n<span style=\"font-weight: 400\">Exciting, right!?<\/span><br \/>\n<span style=\"font-weight: 400\">All snark aside, rebranding yourself actually can be a fun and rewarding exercise. And the first step is the same as what I outlined above in the “Take a look at your personal website and social properties” section. <\/span><br \/>\n<span style=\"font-weight: 400\">Audit your personal website and social properties, but this time, take a careful look at what might be contributing to the off-brand brand you’re detecting amongst your audience. It might be a few misleading words in your description. Or maybe that series of tweets that, in retrospect, <\/span><i><span style=\"font-weight: 400\">could<\/span><\/i><span style=\"font-weight: 400\"> be read as an endorsement of Vladimir Putin. Or it could be those somewhat dated portfolio pieces from that time you worked at a car insurance company.<\/span><br \/>\n<span style=\"font-weight: 400\">Okay, so that last example is actually from my personal experience. And it provides a nice example to ground this discussion. Over the last several years, I’ve had several inquiries from progressive insurance companies and other fintech-type brands. And I’ve had quite a few letters of interest from people looking for creative marketing\/advertising copywriters. <\/span><br \/>\n<span style=\"font-weight: 400\">These days, I don’t think of myself as either of things. So those people are barking up the wrong tree, but it’s totally my fault! Because I still list my creative copywriting work for a financial\/tech brand on my personal website. <\/span><br \/>\n<span style=\"font-weight: 400\">Because the reality is: you <\/span><i><span style=\"font-weight: 400\">do<\/span><\/i><span style=\"font-weight: 400\"> have power over your personal brand. Ultimately, your brand is shaped by others’ perceptions of you, but you can modify those perceptions via what you present to others. <\/span><br \/>\n<span style=\"font-weight: 400\">You have power over your personal brand to the extent that you control how you present yourself, and the content you share with the world. By carefully controlling what you present to the world — even if it means removing good work from your portfolio — you can take a strong step toward rebranding yourself. And that means higher-quality leads towards your next big gig. <\/span><br \/>\n&nbsp;<br \/>\n<em>Be sure to read more from <a href=\"https:\/\/webflow.com\/blog\" target=\"_blank\" rel=\"noopener noreferrer\">John and Webflow on their blog<\/a> where you&#8217;ll find great info on freelance, design, and many other great topics.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>News flash: You don’t control your brand. Your audience (or lack thereof) does. Or, as author Marty Neumeier puts it in his Brand Gap: “[Your brand]<\/p>\n","protected":false},"author":68,"featured_media":7871,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[2,17],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Taking Your Personal Brand to the Next Level<\/title>\n<meta name=\"description\" content=\"The brand is not a logo. It’s an identity. Let’s see what you need to focus on if your personal brand looks good, but you want to go a step further\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/workspace.fiverr.com\/blog\/taking-your-personal-brand-to-next-level\/\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"Taking Your Personal Brand to the Next Level\" \/>\n<meta name=\"twitter:description\" content=\"The brand is not a logo. It’s an identity. Let’s see what you need to focus on if your personal brand looks good, but you want to go a step further\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"John Moore Williams\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Taking Your Personal Brand to the Next Level","description":"The brand is not a logo. It’s an identity. Let’s see what you need to focus on if your personal brand looks good, but you want to go a step further","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/workspace.fiverr.com\/blog\/taking-your-personal-brand-to-next-level\/","twitter_card":"summary_large_image","twitter_title":"Taking Your Personal Brand to the Next Level","twitter_description":"The brand is not a logo. It’s an identity. Let’s see what you need to focus on if your personal brand looks good, but you want to go a step further","twitter_misc":{"Written by":"John Moore Williams","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/workspace.fiverr.com\/#organization","name":"Fiverr","url":"https:\/\/workspace.fiverr.com\/","sameAs":[],"logo":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#logo","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","width":512,"height":512,"caption":"Fiverr"},"image":{"@id":"https:\/\/workspace.fiverr.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/workspace.fiverr.com\/#website","url":"https:\/\/workspace.fiverr.com\/","name":"Fiverr Workspace","description":"","publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/workspace.fiverr.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/blog\/taking-your-personal-brand-to-next-level\/#primaryimage","inLanguage":"en-US","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/workspace.fiverr.com\/blog\/taking-your-personal-brand-to-next-level\/#webpage","url":"https:\/\/workspace.fiverr.com\/blog\/taking-your-personal-brand-to-next-level\/","name":"Taking Your Personal Brand to the Next Level","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/taking-your-personal-brand-to-next-level\/#primaryimage"},"datePublished":"2016-11-14T08:40:58+00:00","dateModified":"2021-11-03T13:23:50+00:00","description":"The brand is not a logo. It’s an identity. Let’s see what you need to focus on if your personal brand looks good, but you want to go a step further","breadcrumb":{"@id":"https:\/\/workspace.fiverr.com\/blog\/taking-your-personal-brand-to-next-level\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/workspace.fiverr.com\/blog\/taking-your-personal-brand-to-next-level\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/workspace.fiverr.com\/blog\/taking-your-personal-brand-to-next-level\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Fiverr Workspace","item":"https:\/\/workspace.fiverr.com\/"},{"@type":"ListItem","position":2,"name":"Taking Your Personal Brand to the Next Level"}]},{"@type":["Article","BlogPosting"],"@id":"https:\/\/workspace.fiverr.com\/blog\/taking-your-personal-brand-to-next-level\/#article","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/blog\/taking-your-personal-brand-to-next-level\/#webpage"},"author":{"@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/ee222005b51e3aacd88737a1678e3917"},"headline":"Taking Your Personal Brand to the Next Level","datePublished":"2016-11-14T08:40:58+00:00","dateModified":"2021-11-03T13:23:50+00:00","mainEntityOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/taking-your-personal-brand-to-next-level\/#webpage"},"wordCount":2152,"publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"image":{"@id":"https:\/\/workspace.fiverr.com\/blog\/taking-your-personal-brand-to-next-level\/#primaryimage"},"thumbnailUrl":"","articleSection":["Freelance knowledge","HUSTLE"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/ee222005b51e3aacd88737a1678e3917","name":"John Moore Williams","image":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/ee0fc545a081e217151ae32395709380?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/ee0fc545a081e217151ae32395709380?s=96&d=mm&r=g","caption":"John Moore Williams"},"description":"John Moore Williams heads up all things content at Webflow, the code-free web design platform. After a decade writing and strategizing at places like InVision, Esurance, and LinkedIn, he's still fighting to make content on the web better and more human. He considers it a very good fight indeed. Follow him @johnamwill.","sameAs":["https:\/\/webflow.com"]}]}},"_links":{"self":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/1427"}],"collection":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/users\/68"}],"replies":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/comments?post=1427"}],"version-history":[{"count":0,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/1427\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media?parent=1427"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/categories?post=1427"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/tags?post=1427"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}