{"id":1914,"date":"2020-11-25T22:15:39","date_gmt":"2019-06-30T08:00:43","guid":{"rendered":"https:\/\/blog.and.co\/?p=1914"},"modified":"2022-01-04T09:08:53","modified_gmt":"2022-01-04T09:08:53","slug":"19-freelance-writing-job-and-community-goldmines","status":"publish","type":"post","link":"https:\/\/workspace.fiverr.com\/blog\/19-freelance-writing-job-and-community-goldmines\/","title":{"rendered":"19 Freelance Writing Job and Community Goldmines"},"content":{"rendered":"\n<p><span style=\"font-weight: 400;\">The concept of <a href=\"https:\/\/workspace.fiverr.com\/blog\/start-freelance-writing\/\">being a freelance writer is simple<\/a>—write articles, send them in, and get paid for your work. <\/span><br><span style=\"font-weight: 400;\">But slogging through hundreds of websites<\/span>&nbsp;<span style=\"font-weight: 400;\">to find jobs that will pay well can be a full-time job in itself. Plus, when you&#8217;re out on your own, who do you go to when you have a question about how to manage your freelance clients or how to <a href=\"https:\/\/workspace.fiverr.com\/invoicing\/guide\/setting-up-invoicing-system\">set up an invoicing system?<\/a><\/span><\/p>\n\n\n\n<p><span style=\"font-weight: 400;\">Thankfully, there are organizations and communities whose missions are geared toward helping freelancers. Places where you can find experts in the freelance world who help freelancers like you <\/span><span style=\"font-weight: 400;\">find more writing jobs and <a href=\"https:\/\/workspace.fiverr.com\/blog\/freelancers-heres-how-to-be-a-better-business-owner\/\">manage your business better<\/a>.<\/span><br><span style=\"font-weight: 400;\">Below is a compilation of freelance writing job goldmines, including the best websites and communities to find freelance writing gigs, as well as the best tactics to ensure more pitches will be accepted.<\/span><br><em><span style=\"font-weight: 400;\">Check out our job and commuity tips for <a href=\"https:\/\/workspace.fiverr.com\/blog\/20-freelance-design-goldmines-for-finding-jobs-and-community\/\" target=\"_blank\" rel=\"noopener noreferrer\">design<\/a> and <a href=\"https:\/\/workspace.fiverr.com\/blog\/20-freelance-marketing-goldmines-for-freelance-jobs\/\" target=\"_blank\" rel=\"noopener noreferrer\">marketing<\/a> too.<\/span><\/em><\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><a href=\"https:\/\/workspace.fiverr.com\/blog\/a-complete-guide-to-becoming-a-freelancer\/\"><img src=\"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/10\/becoming-a-freelancer-4.png\" alt=\"become freelancer\" class=\"wp-image-5679\"\/><\/a><\/figure><\/div>\n\n\n\n<h2><span style=\"font-weight: 400;\">Where to Start<\/span><\/h2>\n\n\n\n<h3><a href=\"https:\/\/www.linkedin.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"><b>LinkedIn<\/b><\/a><\/h3>\n\n\n\n<p><span style=\"font-weight: 400;\">Chances are, if you&#8217;re a freelance professional, you have a LinkedIn profile listing past experience, writing features, and current employment. It&#8217;s a must-have network that helps connect professionals with other individual professionals or companies. However, many freelance writers do not set up their profiles for finding jobs.&nbsp;<\/span><br><span style=\"font-weight: 400;\">There are a few tricks to optimizing Linkedin as a freelance writer looking for work.<br><\/span>&nbsp;<\/p>\n\n\n\n<h4><strong>1. Include <\/strong><span style=\"font-weight: 400;\"><strong>the right keywords and skills on your profile<\/strong><\/span><\/h4>\n\n\n\n<p><span style=\"font-weight: 400;\">Every freelance writer’s profile on Linkedin should include keywords that showcase their different talents. It is not enough to list yourself as a freelance writer, for example, you also must also include ‘blogger,’ if that applies, or other keywords like ‘journalist,’ ‘health writer,’ ‘food blogger,’ and more. The more specific these keywords get, the more chance companies looking for a freelancer with your expertise will find you.<\/span><\/p>\n\n\n\n<h4><\/h4>\n\n\n\n<h4><strong>2. Utilize the blogging feature<\/strong><\/h4>\n\n\n\n<p><span style=\"font-weight: 400;\">Blogging on LinkedIn is a good way to showcase your talents and solidify your standing as a thought leader in your preferred field. Companies will have easy access to a portfolio of your work through this, so keep the posts informative and professional. You can even repost articles that you publish elsewhere with a link to the original publication. <\/span><br><span style=\"font-weight: 400;\">This will work best if you build up a network of people who are interested in your niche, so they&#8217;ll be interested in what you&#8217;re writing about and more likely to hire you when they need a writer in that field. <\/span><\/p>\n\n\n\n<h4><span style=\"font-weight: 400;\"><strong>3. Navigate job boards in the right way<\/strong><\/span><\/h4>\n\n\n\n<p><span style=\"font-weight: 400;\">Try paying more attention to the companies than the specific jobs. Since most freelance writers are not looking for full-time jobs, look for companies that interest you and, instead of applying to a specific job, ask if they are looking to work with any freelancers. This is a good way to pick up extra gigs from unexpected sources. <\/span><\/p>\n\n\n\n<h3><a href=\"https:\/\/www.fiverr.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"><b>Fiverr<\/b><\/a><\/h3>\n\n\n\n<p><span style=\"font-weight: 400;\">Fiverr is a well-known freelancing platform where freelance writers can set up a profile advertising their talents. Its sole purpose is to connect freelancers with suitable jobs, and many of the gigs lead to repeat clients. There is a percentage attached that Fiverr takes to make its profit, so keep that in mind when setting your rate.&nbsp;<\/span><br><span style=\"font-weight: 400;\">Fiverr is a no-brainer for freelance writers because it is easy to use, clients are charged automatically without you needing to worry about whether or not they&#8217;ll pay, and you can build up a profile full of positive feedback from clients. <\/span><\/p>\n\n\n\n<h3><a href=\"https:\/\/www.flexjobs.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"><b>Flexjobs<\/b><\/a><\/h3>\n\n\n\n<p><span style=\"font-weight: 400;\">Flexjobs&#8217; targeted job search algorithm is helpful in finding jobs suited to every kind of writer. While this website provides only a paid service, it may be worth it for the expanse of quality freelance jobs listed and the quick connection to jobs. The monthly payment on this website also gives users access to all of the resources they need to find a good next gig.<\/span><\/p>\n\n\n\n<p><span style=\"font-weight: 400;\">Flexjobs has categories and subcategories that connect to every possible aspect of the freelance writing industry. So, when a job is suggested to a user, that job is actually suited toward their knowledge base. A good tactic for finding jobs on this website is to take as many of the skills tests as possible. This will make it easier for potential employers to find you. Additionally, be sure to create a resume directly on the website so potential employers do not have to go searching for it.<\/span><\/p>\n\n\n\n<h3><a href=\"https:\/\/angel.co\/?utm_source=redirect&amp;utm_campaign=angellist_com\" target=\"_blank\" rel=\"noopener noreferrer\"><b>AngelList<\/b><\/a><\/h3>\n\n\n\n<p><span style=\"font-weight: 400;\">Startups are often looking for freelance writers to create quality content to enhance their website. From blogging to growth marketing and many more opportunities, writers and startups tend to overlap quite well.<\/span><\/p>\n\n\n\n<p><span style=\"font-weight: 400;\">This is why AngelList is such a helpful tool. It is a job board that lists only job positions open in startup companies, and it is a great place to find companies that may be looking for freelance writers. What&#8217;s also great is that most jobs list key details about itself and the job they are hiring. Want to make sure you&#8217;re working for a credible startup AND want to know the pay range for this job? AngelList is great for that.<\/span><\/p>\n\n\n\n<p>The trick to this website, like Linkedin, is to put freelance writing keywords in your profile and to connect with as many companies as you can. Applying to different positions on this website is as simple as clicking ‘I’m Interested,’ and writing a brief paragraph about why.<\/p>\n\n\n\n<p><span style=\"font-weight: 400;\">Being able to reach out to the CEOs of startups on this website is an invaluable advantage. When you come across a company that interests you, go to their website and take a look at their blog, if one exists. Brainstorm content ideas that would be best suited to the company. After you have done your research, message the company to pitch your ideas. Putting yourself out there is the best way to connect with jobs on AngelList, so pitch as many companies as possible.<\/span><\/p>\n\n\n\n<h2><span style=\"font-weight: 400;\">Have You Looked Here for Freelance Work?<\/span><\/h2>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/10\/AND_CO_19FreelanceWritingJobGoldmines_Artwork.jpg\" alt=\"freelance, freelancer, freelance writing, freelance goldmines, freelance jobs, find freelance jobs, freelance communities\" class=\"wp-image-2121\"\/><\/figure><\/div>\n\n\n\n<h3>&nbsp;<\/h3>\n\n\n\n<h3><a href=\"https:\/\/workingnotworking.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"><b>Working Not Working<\/b><\/a><\/h3>\n\n\n\n<p><span style=\"font-weight: 400;\">Working Not Working is a selective place for a range of creatives where top jobs are found for advertisers, copywriters, animators, or <\/span><a href=\"https:\/\/workingnotworking.com\/signup\/creative\"><span style=\"font-weight: 400;\">any other profession that appears on this list<\/span><\/a><span style=\"font-weight: 400;\">. The catch is that you need to be one of the best in your industry to join WNW.<\/span><\/p>\n\n\n\n<p><span style=\"font-weight: 400;\">There’s two ways to do so: get nominated or apply and get accepted (you can find more info at the link above). Once granted access, you have a free membership to find work with clients like BBDO, Airbnb, Apple and many more. Best of all, these companies are the ones actually paying to be part of the community, so you know that they&#8217;ll want your bang for their buck. This should reduce some of the headache in finding less than ideal companies to partner with, which you might find on other obvious job destinations.<\/span><\/p>\n\n\n\n<p><span style=\"font-weight: 400;\"> Also, it usually means you’re getting offered the rate you deserve. Can’t beat that, right?<\/span><\/p>\n\n\n\n<h3><a href=\"https:\/\/www.clearvoice.com\/freelance-jobs\/\" target=\"_blank\" rel=\"noopener noreferrer\"><b>ClearVoice<\/b><\/a><\/h3>\n\n\n\n<p><span style=\"font-weight: 400;\">ClearVoice allows freelance writers to create an online portfolio in order to connect with clients. This is a great platform for those looking to build themselves up in the freelance writing community and can lead to some steady, high-paying gigs. The portfolios are attractive and easy to follow, so editors can look over work samples and contact writers as they see fit.&nbsp;<\/span><\/p>\n\n\n\n<p><span style=\"font-weight: 400;\">Even if it takes a while for clients on ClearVoice to reach out, joining this website is worth it for the portfolio alone. All of your work becomes organized and can be shared all over the internet. Set up your ClearVoice portfolio, and do not be afraid to post it to other websites, such as your LinkedIn page and personal website, as a place employers can go to look at your work.<\/span><\/p>\n\n\n\n<h3><a href=\"https:\/\/muckrack.com\/\" target=\"_blank\" rel=\"noopener noreferrer\"><b>Muck Rack<\/b><\/a><\/h3>\n\n\n\n<p><span style=\"font-weight: 400;\">Muck Rack is a free portfolio-building website that is built on sharing content. Like many mentioned here, keywords are key in these profiles. Those searching for freelance writers will be sent email notifications when a writer pops up with a keyword that they searched. However, the biggest part of this website is social sharing. Everyone on Muck Rack has the ability to share a writer’s work on a social page. Analyzing the amount of shared each month can help a freelance writer get their work spread around more often.<\/span><\/p>\n\n\n\n<p><span style=\"font-weight: 400;\">This website serves as a conversation between freelance writers and companies, and the Muck Rack team is there to facilitate successful freelance working relationships. Shareable content is a must when creating a portfolio on this website. Journalists will also get significant benefits from Muck Rack as it is a source for trending news. It also is great for finding publications, journalists, and industries you want to cover. Heads up, though: membership can get pricey.<\/span><\/p>\n\n\n\n<h3><a href=\"https:\/\/www.cloudpeeps.com\/about\" target=\"_blank\" rel=\"noopener noreferrer\"><b>CloudPeeps <\/b><\/a><\/h3>\n\n\n\n<p><span style=\"font-weight: 400;\">CloudPeeps is a different kind of talent marketplace that encourages collaboration between companies and freelancers to create meaningful professional connections. The great thing about this platform is that it lists a freelancer’s availability, as well as content expertise. Companies come to this resource looking for a specific type of freelancer to add to their team, and CloudPeeps concierge helps them find said team member.<\/span><\/p>\n\n\n\n<p><span style=\"font-weight: 400;\">The <\/span><a href=\"https:\/\/www.cloudpeeps.com\/success_stories\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">success stories<\/span><\/a><span style=\"font-weight: 400;\"> on their website say it all—this is a place where long-term relationships are built. Communication is key when becoming a part of CloudPeeps, because, once you connect with a company, you officially are thought of as a part of their team.<\/span><\/p>\n\n\n\n<p><span style=\"font-weight: 400;\">Want to know what you&#8217;ll be earning as a member of this team? CloudPeeps sorts that out for you with its helpful <a href=\"https:\/\/www.cloudpeeps.com\/pricing\" target=\"_blank\" rel=\"noopener noreferrer\">pricing chart<\/a>&nbsp;that delineates everything for both sides before any project gets underway.&nbsp;<\/span><\/p>\n\n\n\n<h2><span style=\"font-weight: 400;\">Networking and Professional Associations<\/span><\/h2>\n\n\n\n<h3><a href=\"https:\/\/www.spj.org\/freelance.asp\" target=\"_blank\" rel=\"noopener noreferrer\"><b>Society of Professional Journalists<\/b><\/a><\/h3>\n\n\n\n<p><span style=\"font-weight: 400;\">As a freelance writer, it is not only important to be present on specific job boards, but it is also helpful to be part of networking organizations. The SPJ is an online community of professional journalists, where you can find helpful connections and tips and tricks to get better jobs. <\/span><span style=\"font-weight: 400;\">There is a job board and discussion boards that help with finding jobs and figuring out freelance writing conundrums as well.<\/span><\/p>\n\n\n\n<p><span style=\"font-weight: 400;\"> If you&#8217;re looking more for a community that happens to have some jobs, start here. Combine this and\/or the other journo orgs below with your Muck Rack account and you&#8217;ll be in journalistic networking business.&nbsp;<\/span><\/p>\n\n\n\n<h3><a href=\"https:\/\/asja.org\/\" target=\"_blank\" rel=\"noopener noreferrer\"><b>American Society of Journalists and Authors<\/b><\/a><\/h3>\n\n\n\n<p><span style=\"font-weight: 400;\">Like the Society of Professional Journalists, this is an interactive community that holds awards, question and answer sessions, and writing events. This society is more of an offline experience for writing professionals, which is necessary to really connect with potential clients. It is always easier to sell your work in person. Plus, this society provides its members with a wealth of resources that help with anything from finding jobs to grieving to financial assistance.<\/span><\/p>\n\n\n\n<h3><a href=\"https:\/\/www.societyofauthors.org\/\" target=\"_blank\" rel=\"noopener noreferrer\"><b>The Society of Authors <\/b><\/a><\/h3>\n\n\n\n<p><span style=\"font-weight: 400;\">The Society of Authors is all about working as a collective to help every member. The group makes its views clear while profiling helpful events, prizes, and grants for you to take up. One section you should check out is the advice area where authors get to glean to knowledge they need in the field.<\/span><\/p>\n\n\n\n<p><span style=\"font-weight: 400;\">Collaborating with others is the biggest goal in this society, and members do so through joining the society groups, giving advice, and lobbying for the fair treatment of writers. Each group has different discussion boards that relate to different areas of expertise and potential issues.<\/span><\/p>\n\n\n\n<h3><a href=\"https:\/\/www.the-efa.org\/\" target=\"_blank\" rel=\"noopener noreferrer\"><b>Editorial Freelancers Association<\/b><\/a><\/h3>\n\n\n\n<p><span style=\"font-weight: 400;\">The Editorial Freelancers Association is dedicated to helping its members find specific work opportunities. It sends out a customized list of jobs to every EFA member and encourages connection and participation. As one of the oldest writing associations, the EFA encourages volunteer work from its members to keep its work as a nonprofit growing.<\/span><br>Like CloudPeeps, the <a href=\"https:\/\/www.the-efa.org\/res\/rates.php\" target=\"_blank\" rel=\"noopener noreferrer\">EFA&#8217;s rate breakout<\/a>&nbsp;is an incredibly helpful tool that helps you see where the market stands when it comes to setting your own&nbsp;prices.<\/p>\n\n\n\n<h3><a href=\"https:\/\/www.authorsguild.org\/\" target=\"_blank\" rel=\"noopener noreferrer\"><b>Authors Guild<\/b><\/a><\/h3>\n\n\n\n<p><span style=\"font-weight: 400;\">Since 1912, Authors Guild has been at the forefront of protecting writers. Today, just like then, emerging writers have a home as members of Authors Guild, which hones in on the legal aspects of writing. They work for fair compensation for their members, as well as to provide legal services for any member who may need it.<\/span><\/p>\n\n\n\n<p><span style=\"font-weight: 400;\">While these are two standout services, be sure to check out all that the <a href=\"https:\/\/www.authorsguild.org\/member-services\/\" target=\"_blank\" rel=\"noopener noreferrer\">Guild provides its members<\/a>&nbsp;to see exactly what you can tap into. Additionally, members can network with the company and other members through their wide variety of events.<\/span><\/p>\n\n\n\n<h2><span style=\"font-weight: 400;\">Social Media and the Internet<\/span><\/h2>\n\n\n\n<h3><strong><a href=\"https:\/\/reddit.com\/r\/writingjobboard\" target=\"_blank\" rel=\"noopener noreferrer\">Reddit: \/r\/writingjobboard<\/a><\/strong><\/h3>\n\n\n\n<p class=\"has-text-align-left\"><span style=\"font-weight: 400;\">Online communities are great ways to get connected to writing gigs, as well as to ask questions about the industry as a whole. Reddit is a perfect resource for both. For example, their writing job board lists a wide variety of companies hiring freelance writers in different fields.<\/span><\/p>\n\n\n\n<p class=\"has-text-align-left\"><span style=\"font-weight: 400;\">Interested writers can ask questions in threads and provide feedback. While the posts don&#8217;t pour in here, there are quite a few quality jobs that make the board. Scan through to find some gems.&nbsp;<\/span><\/p>\n\n\n\n<h3><a href=\"https:\/\/www.reddit.com\/r\/freelancewriting\/\" target=\"_blank\" rel=\"noopener noreferrer\"><b>Reddit: \/r\/freelancewriting<\/b><\/a><\/h3>\n\n\n\n<p><span style=\"font-weight: 400;\">The general freelance writing subreddit can also be helpful. This is less about being introduced to potential work opportunities and more about learning more about the freelance writing industry.<\/span><br><span style=\"font-weight: 400;\"> Here, redditors provide their view of freelance writing, including which websites are the best and worst for finding employment opportunities.<\/span><\/p>\n\n\n\n<h3><a href=\"https:\/\/www.reddit.com\/r\/freelancewriting\/\" target=\"_blank\" rel=\"noopener noreferrer\"><b>Facebook: Binders Full of Full-Time Freelance Writers<\/b><\/a><\/h3>\n\n\n\n<p><span style=\"font-weight: 400;\">Facebook groups can provide some amazing opportunities to freelance writers. For example, Binders Full of Full-Time Freelance Writers is a huge community that helps all women and gender non-conforming writers succeed in the freelance world.<\/span><\/p>\n\n\n\n<p><span style=\"font-weight: 400;\">This group does everything from helping members write better pitches, to posting opportunities, to critiquing individual pieces.&nbsp;<\/span><\/p>\n\n\n\n<h3><a href=\"https:\/\/www.facebook.com\/groups\/646352725528580\/\" target=\"_blank\" rel=\"noopener noreferrer\"><b>Facebook: Freelance Writing Jobs<\/b><\/a><\/h3>\n\n\n\n<p><span style=\"font-weight: 400;\">This Facebook group is dedicated specifically to calling attention to jobs for freelance writers. It is an interactive type of job board, where conversations about job postings are encouraged. This provides writers with the unique opportunity to get answers straight from the person who posted the job.<\/span><\/p>\n\n\n\n<h3><a href=\"https:\/\/www.facebook.com\/groups\/646352725528580\/\" target=\"_blank\" rel=\"noopener noreferrer\"><b>Twitter: #writechat<\/b><\/a><\/h3>\n\n\n\n<p><span style=\"font-weight: 400;\">The twitter hashtag #writechat allows writers to post up opportunities and start conversations about the writing industry. Many use this hashtag to post up writing contests and deadlines, while others use it to ask questions or call attention to their work. It is a broad enough category to include several aspects of freelance writing, so browse around a lot before diving in.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Looking for freelance writing gigs? Here are some great online groups and communities where you can find work and learn from other writers.<\/p>\n","protected":false},"author":87,"featured_media":10272,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[2,17],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>19 Freelance Writing Job and Community Goldmines<\/title>\n<meta name=\"description\" content=\"Looking for freelance writing gigs? Here are some great online groups and communities where you can find work and learn from other writers.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/workspace.fiverr.com\/blog\/19-freelance-writing-job-and-community-goldmines\/\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"19 Freelance Writing Job and Community Goldmines\" \/>\n<meta name=\"twitter:description\" content=\"Looking for freelance writing gigs? Here are some great online groups and communities where you can find work and learn from other writers.\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/Xj-7JFIA-1.jpeg\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Marjorie Hopkins\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"19 Freelance Writing Job and Community Goldmines","description":"Looking for freelance writing gigs? Here are some great online groups and communities where you can find work and learn from other writers.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/workspace.fiverr.com\/blog\/19-freelance-writing-job-and-community-goldmines\/","twitter_card":"summary_large_image","twitter_title":"19 Freelance Writing Job and Community Goldmines","twitter_description":"Looking for freelance writing gigs? Here are some great online groups and communities where you can find work and learn from other writers.","twitter_image":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/Xj-7JFIA-1.jpeg","twitter_misc":{"Written by":"Marjorie Hopkins","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/workspace.fiverr.com\/#organization","name":"Fiverr","url":"https:\/\/workspace.fiverr.com\/","sameAs":[],"logo":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#logo","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","width":512,"height":512,"caption":"Fiverr"},"image":{"@id":"https:\/\/workspace.fiverr.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/workspace.fiverr.com\/#website","url":"https:\/\/workspace.fiverr.com\/","name":"Fiverr Workspace","description":"","publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/workspace.fiverr.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/blog\/19-freelance-writing-job-and-community-goldmines\/#primaryimage","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/Xj-7JFIA-1.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/Xj-7JFIA-1.jpeg","width":1200,"height":576},{"@type":"WebPage","@id":"https:\/\/workspace.fiverr.com\/blog\/19-freelance-writing-job-and-community-goldmines\/#webpage","url":"https:\/\/workspace.fiverr.com\/blog\/19-freelance-writing-job-and-community-goldmines\/","name":"19 Freelance Writing Job and Community Goldmines","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/19-freelance-writing-job-and-community-goldmines\/#primaryimage"},"datePublished":"2019-06-30T08:00:43+00:00","dateModified":"2022-01-04T09:08:53+00:00","description":"Looking for freelance writing gigs? Here are some great online groups and communities where you can find work and learn from other writers.","breadcrumb":{"@id":"https:\/\/workspace.fiverr.com\/blog\/19-freelance-writing-job-and-community-goldmines\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/workspace.fiverr.com\/blog\/19-freelance-writing-job-and-community-goldmines\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/workspace.fiverr.com\/blog\/19-freelance-writing-job-and-community-goldmines\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Fiverr Workspace","item":"https:\/\/workspace.fiverr.com\/"},{"@type":"ListItem","position":2,"name":"19 Freelance Writing Job and Community Goldmines"}]},{"@type":["Article","BlogPosting"],"@id":"https:\/\/workspace.fiverr.com\/blog\/19-freelance-writing-job-and-community-goldmines\/#article","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/blog\/19-freelance-writing-job-and-community-goldmines\/#webpage"},"author":{"@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/efa48f81fa33baaa5c5a8a54b8c5ce9e"},"headline":"19 Freelance Writing Job and Community Goldmines","datePublished":"2019-06-30T08:00:43+00:00","dateModified":"2022-01-04T09:08:53+00:00","mainEntityOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/19-freelance-writing-job-and-community-goldmines\/#webpage"},"wordCount":2403,"publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"image":{"@id":"https:\/\/workspace.fiverr.com\/blog\/19-freelance-writing-job-and-community-goldmines\/#primaryimage"},"thumbnailUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/Xj-7JFIA-1.jpeg","articleSection":["Freelance knowledge","HUSTLE"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/efa48f81fa33baaa5c5a8a54b8c5ce9e","name":"Marjorie Hopkins","image":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/606b67d6dd27f11f6938c41fc4da2525?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/606b67d6dd27f11f6938c41fc4da2525?s=96&d=mm&r=g","caption":"Marjorie Hopkins"}}]}},"_links":{"self":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/1914"}],"collection":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/users\/87"}],"replies":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/comments?post=1914"}],"version-history":[{"count":0,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/1914\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media\/10272"}],"wp:attachment":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media?parent=1914"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/categories?post=1914"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/tags?post=1914"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}