{"id":1934,"date":"2020-11-25T22:15:39","date_gmt":"2016-12-27T08:11:22","guid":{"rendered":"https:\/\/blog.and.co\/?p=1934"},"modified":"2022-03-24T11:51:24","modified_gmt":"2022-03-24T11:51:24","slug":"20-freelance-marketing-goldmines-for-freelance-jobs","status":"publish","type":"post","link":"https:\/\/workspace.fiverr.com\/blog\/20-freelance-marketing-goldmines-for-freelance-jobs\/","title":{"rendered":"20+ Goldmines for Finding Freelance Marketing Jobs"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Freelancing and marketing go hand in hand. A successful freelancer can find gigs anywhere because all businesses need marketing. You have every niche available to you! But getting those first few gigs can be tough, so we’ve put together this resource guide that you can use as a freelance marketer to get your foot in the door and start earning money.<\/span><br \/>\n<span style=\"font-weight: 400;\">If you’re completely new to freelance marketing, this isn’t the article for you. But we do have the one you should be reading. Tutsplus.com has <\/span><a href=\"https:\/\/business.tutsplus.com\/articles\/the-ultimate-guide-to-becoming-a-successful-freelance-marketer--fsw-26470\"><span style=\"font-weight: 400;\">an amazing guide<\/span><\/a><span style=\"font-weight: 400;\"> on how to get your freelance marketing business structured and what you need to know before you dip your toes into the resources below. Once you have your basics in place, we’d like to invite you to visit <\/span><span style=\"font-weight: 400;\">Fiverr Workspace’s freelance job board<\/span><span style=\"font-weight: 400;\"> to start finding your first gigs, as well as looking through the subcategories below.<\/span><\/p>\n<h2 style=\"text-align: left;\">The Obvious Places<\/h2>\n<p style=\"text-align: center;\">\n<p><span style=\"font-weight: 400;\">There are places online where any freelancer can get a job, so let’s get those out of the way first. To get the most out of a general site, you have to narrow your focus so you get just the right clients. Here’s where to start.<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/linkedin.com\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">Marketing is seen as a true “business” job, unlike say writing or design. Thus, a professional approach is needed. Even if you don’t use LinkedIn to hunt for jobs, you should use it as a profile to put your best professional foot forward. Unlike the other job boards below, LinkedIn isn’t the place to pitch directly. But it is a place to get to know the movers and shakers in your field. <\/span><br \/>\n<span style=\"font-weight: 400;\">Use group searches to find which communities are the most active for your niche and start studying your audience. Here are some quality groups that you should check out:<\/span><br \/>\n<a href=\"https:\/\/www.linkedin.com\/groups?gid=62352\"><span style=\"font-weight: 400;\">Digital Marketing<\/span><\/a><br \/>\n<a href=\"https:\/\/www.linkedin.com\/groups\/Inbound-Marketers-Marketing-Professionals-21005\"><span style=\"font-weight: 400;\">Inbound Marketers &#8211; For Marketing Professionals<\/span><\/a><span style=\"font-weight: 400;\"> (Founded by the founder of Hubspot!)<\/span><br \/>\n<a href=\"https:\/\/www.linkedin.com\/groups\/eMarketing-Association-Network-41352\"><span style=\"font-weight: 400;\">eMarketing Association Network<\/span><\/a><span style=\"font-weight: 400;\"> (See our entry below on the eMarketing Association)<\/span><br \/>\n<span style=\"font-weight: 400;\">You can find other excellent marketing groups on LinkedIn <\/span><a href=\"https:\/\/blog.hubspot.com\/marketing\/linkedin-group-marketers-list\"><span style=\"font-weight: 400;\">through this article from Hubspot<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/flexjobs.com\" target=\"_blank\" rel=\"noopener noreferrer\">FlexJobs<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">FlexJobs is a job board that focuses on freelancing, telecommuting, flextime, and part-time positions. Thus, a site like FlexJobs can help you find positions that pay well enough while still giving you flexibility. By using their schedule sorting features, you can select jobs with just the amount of travel you want with your business.<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/angellist.com\" target=\"_blank\" rel=\"noopener noreferrer\">AngelList<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">If marketing for a startup sounds like a challenge you want to focus on, then AngelList is your site. Period. With one application you can put your resume out in front of thousands of startups. Many startups rely on telecommuting and remote office applications to save costs, so the chances of being able to work from home are high. However, pay might be low or come to you in the form of equity. It’s up to you to decide how you want to jump those sorts of hurdles.<\/span><br \/>\n<span style=\"font-weight: 400;\">One thing to be very careful of. There are many positions that say they are for marketers or offer marketing experience, but they are really entry-level sales jobs. The smaller the company, the more likely the two will be lumped together. If you want to stick strictly with marketing, do your research before you accept an offer and don’t be afraid to walk away.<\/span><\/p>\n<h2 style=\"text-align: left;\">Have You Looked Here?<\/h2>\n<p style=\"text-align: center;\">\n<p><span style=\"font-weight: 400;\">Broad sites are good for finding jobs, but it can be hard to find the best ones on there. It’s also hard to find other people working in your niche for networking purposes. These sites are where to really start finding the opportunities and the knowledge you need to become a master freelance marketer. Best of all, viewing and applying on these boards are free (though you may need to register.)<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/growthhackers.com\/welcome\" target=\"_blank\" rel=\"noopener noreferrer\">GrowthHackers<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">You might know GrowthHackers for their project management software, but they are equally well known for their marketing community. If you have any familiar with Reddit, you’ll fit right in here. The community posts articles and videos for discussions, holds “ask me anything” (AMA) conversations, and has a job board to boot. They even have case studies! How do you get involved? Like any forum, it’s best to lurk for a little bit to get a feel for the community, then start talking and posting.<\/span><br \/>\n<span style=\"font-weight: 400;\">They also have a jobs board, just click the link on the left column in the link above. It’s nothing particularly fancy, just a list of positions. The links jump to the application websites of the companies. As of this writing, there are only about 35 listed, so it’s an easy thing to flip through while you’re participating in the discussions.<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/moz.com\/blog\">Moz<\/a> and <a href=\"https:\/\/contentmarketinginstitute.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Content Marketing Institute<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">Moz doesn’t have a job board anymore, but the quality and depth of their articles more than make up for it. If online marketing, especially SEO, is your focus, this is a must-read blog. Consider it to be an online marketing journal. Start your journey by looking at <\/span><a href=\"https:\/\/moz.com\/blog\/the-best-of-2015\"><span style=\"font-weight: 400;\">the best posts of 2015<\/span><\/a><span style=\"font-weight: 400;\">, and then keep your eyes peeled for the 2016 edition early next year. And if you want to get more involved, start commenting regularly on the posts. They have a very active blog comment community.<\/span><br \/>\n<span style=\"font-weight: 400;\">Content Marketing Institute is much like Moz, but with a much deeper focus on content marketing. If your marketing prowess leans toward writing copy or you need to know <\/span><a href=\"https:\/\/contentmarketinginstitute.com\/2016\/12\/freelance-content-writers-results\/\"><span style=\"font-weight: 400;\">what to look for in subcontracting with a writer for content<\/span><\/a><span style=\"font-weight: 400;\">, this is the blog for you. They also don’t have a job board, but they do advertise jobs in their weekly newsletter. Those advertisers have to pay a pretty penny ($595 for a week!) to get in there, so you can trust they’re worth your time to pitch.<\/span><\/p>\n<h3 style=\"text-align: center;\">Digital Marketing Community<\/h3>\n<p><span style=\"font-weight: 400;\">The dream of some freelancers is to leverage geoarbitrage, living in a place with a low cost of living while still earning high wages. Many of the job boards out there are very US and UK-centric. Digital Marketing Community is an example of a board that is suitable for someone outside of the US-UK bubble, notably for people who want to work in the Middle East. They do have job listings for those closer to home and they have a lot of valuable articles and reports about how online marketing shifts when you leave the standard markets. <\/span><br \/>\n<span style=\"font-weight: 400;\">To apply for jobs you have to sign up for the site, but it is free to join and you can browse the listings prior to signup. It’s pretty easy to navigate and the postings are standardized. The link in the heading will take you right to the job board.<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/www.marketingprofs.com\/ea\/\" target=\"_blank\" rel=\"noopener noreferrer\">MarketingProfs<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">Are you familiar with the question-and-answer site Quora? MarketingProfs is like that and a whole lot more. They have a point system where experts can gain reputation by answering people’s questions about online marketing. If you need to ask a question or need to establish some credibility, this is definitely a site to look at. Don’t stop at the Q&amp;A section either. There are quite a lot of juicy marketing nuggets buried in their thousands of articles. They do have a tiny job board <\/span><a href=\"https:\/\/www.marketingprofs.com\/jobbank\/\"><span style=\"font-weight: 400;\">at this link<\/span><\/a><span style=\"font-weight: 400;\">, but as of this writing there were only two jobs and both were full time. <\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/inbound.org\/\" target=\"_blank\" rel=\"noopener noreferrer\">Inbound<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">Still don’t have enough information or networking resources? Or don’t know which places to go? Inbound.org finds and delivers the best marketing articles into your inbox in a digest form. But that’s just one claim to fame. The 170,000+ people on its forums are its other big advantage. Like MarketingProfs, Inbound has a huge question and answers section where you can crowdsource opinions on all sorts of topics. It also has a sizeable job board, though they focus on all marketing jobs, not just freelance ones. You have to sign up for the site to see the current listings. and they intimate that the number of jobs they have is lower than a standard job board. However, the quality is much higher and they have excellent filters.<\/span><br \/>\n<span style=\"font-weight: 400;\">Since these groups are where you’ll find your best connections, put your best foot forward and have your portfolio ready. Here are some others to check out that we just couldn’t leave out, though they’re information-only. No job boards here:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><a href=\"https:\/\/www.producthunt.com\/\"><span style=\"font-weight: 400;\">https:\/\/www.producthunt.com\/<\/span><\/a><span style=\"font-weight: 400;\"> (Great to find companies to pitch to that are making new products. No job board.)<\/span><\/li>\n<li style=\"font-weight: 400;\"><a href=\"https:\/\/saas.community\/\"><span style=\"font-weight: 400;\">https:\/\/saas.community\/<\/span><\/a><span style=\"font-weight: 400;\"> (For those wanting news about marketing SaaS applications. No job board.)<\/span><\/li>\n<li style=\"font-weight: 400;\"><a href=\"https:\/\/www.copyblogger.com\/\"><span style=\"font-weight: 400;\">https:\/\/www.copyblogger.com\/<\/span><\/a><span style=\"font-weight: 400;\"> (THE blog for anyone writing copy for a blog)<\/span><\/li>\n<li style=\"font-weight: 400;\"><a href=\"https:\/\/blog.bufferapp.com\/\"><span style=\"font-weight: 400;\">https:\/\/blog.bufferapp.com\/<\/span><\/a><span style=\"font-weight: 400;\"> (Social media marketing junkie? Get your fix here)<\/span><\/li>\n<\/ul>\n<h2 style=\"text-align: left;\">Professional Groups That Are Goldmines<\/h2>\n<p style=\"text-align: center;\">\n<p><span style=\"font-weight: 400;\">Joining a professional group can help you get those most powerful of connections, a positive reference to a new client. While these groups don’t have a job board, or at least openly advertised ones that we’ve found, joining a professional group can boost your resume and provide valuable connections that could lead to lucrative jobs.<\/span><br \/>\n<span style=\"font-weight: 400;\">Like with any professional group, participation is key to getting the most out of membership. Too many people join professional groups just to add a feather to their resume. But to really leverage the connections, you have to go to the events and participate in the discussions. Here are some professional groups that may be of use to the freelance marketer:<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/ama.org\" target=\"_blank\" rel=\"noopener noreferrer\">American Marketing Association<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">The AMA partners with academics to find the best ways to market to the public. Their mission is to become an essential community for marketers. If you take a look at some of the reports available to members, you can see why it’s such a trusted organization with over 30,000 members. career resources really stand out &#8212; offering assistance to marketers, academics and students. In fact, give their entire Career section a look. You&#8217;ll come away with great info and job leads.<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/ana.net\" target=\"_blank\" rel=\"noopener noreferrer\">Association of National Advertisers<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">The ANA has been around for over 100 years with a focus on client-side marketing. If you are the type of freelance marketer that would rather consult with one or two companies that have a national reach, this would be an excellent organization to join. Take a look at their free content library and see if it resonates with your business.<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/www.emarketingassociation.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">The eMarketing Association<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">Most freelance marketers are likely to be working on an online strategy for their clients. Thus, The eMarketing Association is a smart choice for a professional group. They promote ways to integrate online and offline marketing. To do this, they offer several marketing certification courses to bolster your skills and prove to clients that you know what you’re doing.<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/www.prsa.org\/\" target=\"_blank\" rel=\"noopener noreferrer\">Public Relations Society of America<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">If you write press releases, you’re in public relations. If you’re already writing press releases and want to go deeper into public relations, a membership in PRSA is the way to go. Members get access to a library of webinars where they can learn more about the best practices of this profession. Its Jobcenter boasts over 2,000 jobs &#8220;within easy reach&#8221; as well as access to career experts. Military veterans should also check out the Moving Veterans Forward Initiative that, &#8220;[helps] transitioning military public affairs professionals to find communication jobs in the civilian workplace.&#8221;<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/aaaa.org\" target=\"_blank\" rel=\"noopener noreferrer\">American Association of Advertising Agencies<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">The AAAA, or commonly the 4A’s, is a professional organization for advertising agencies. If you already have a small agency going for at least two years, you might be eligible to get into this prestigious organization. Only a few companies are able to get in!<\/span><br \/>\n<span style=\"font-weight: 400;\">These are just a few of the professional organizations available. For a further list of organizations in a wide variety of marketing niches, check out this list from <\/span><span style=\"font-weight: 400;\">Knowthis.com<\/span><span style=\"font-weight: 400;\">. Remember, participation is key! Speak with members as if they are professional peers, keep your business cards handy, and don’t be pushy for referrals.<\/span><\/p>\n<h2 style=\"text-align: left;\">Social Media for Freelance Marketers<\/h2>\n<p><span style=\"font-weight: 400;\">Freelance marketers can afford to be a bit more laid-back than their professional counterparts working for large organizations. Finding a place to blow off steam and swap tips in a casual environment may be more your style than going to professional organizations. Social media makes it easy to do this, but finding a good group that doesn’t devolve into a rampant self-promotion fest is trickier than you might think. That’s why we’ve curated a list of excellent marketing groups on social media for you.<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/www.reddit.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Reddit<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">Reddit can be a time sink or your best friend for getting actionable advice on a problem. <\/span><a href=\"https:\/\/www.reddit.com\/r\/marketing\/\"><span style=\"font-weight: 400;\">\/r\/marketing<\/span><\/a><span style=\"font-weight: 400;\"> is the place to start. On their sidebar is a large list of other subreddits that are of use to freelance and traditional marketers. Also look for subreddit wikis and faqs to get excellent crowdsourced knowledge about each forum. There are also job boards on Reddit, but they tend to be broad and city-oriented. Start with a search for your closest city and the word jobs, or ask on a marketing subreddit related to your niche for good job boards on Reddit. Some other general job subreddits you may want to look at include:<\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><a href=\"https:\/\/www.reddit.com\/r\/digitalnomad\/\"><span style=\"font-weight: 400;\">\/r\/digitalnomad<\/span><\/a><\/li>\n<li style=\"font-weight: 400;\"><a href=\"https:\/\/www.reddit.com\/r\/jobs\/\"><span style=\"font-weight: 400;\">\/r\/jobs<\/span><\/a><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\"><a href=\"https:\/\/www.reddit.com\/r\/careerguidance\">\/r\/careerguidance<\/a><\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Again, since marketing is such a wide niche you should explore all of these carefully to see if they are useful for leads and knowledge. If you’re new to Reddit, lurk for a bit and <\/span><a href=\"https:\/\/www.reddit.com\/wiki\/reddiquette\"><span style=\"font-weight: 400;\">learn the Reddiquette<\/span><\/a><span style=\"font-weight: 400;\">!<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/slack-redir.net\" target=\"_blank\" rel=\"noopener noreferrer\">Slack<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">We’ve talked about several general freelancing slack groups in our previous posts like <\/span><a href=\"https:\/\/freelance.chat\"><span style=\"font-weight: 400;\">#Freelance<\/span><\/a><span style=\"font-weight: 400;\"> and <\/span><a href=\"https:\/\/workfrom\"><span style=\"font-weight: 400;\">Workfrom<\/span><\/a><span style=\"font-weight: 400;\">, but there are many good ones specifically for marketing as well. If you work making creatives, <\/span><a href=\"https:\/\/www.launch-chat.com\/\"><span style=\"font-weight: 400;\">#Launch<\/span><\/a><span style=\"font-weight: 400;\"> is the one for you. If you’re a general marketer, try <\/span><a href=\"https:\/\/creativetribes.co\/slack\/\"><span style=\"font-weight: 400;\">#CreativeTribes<\/span><\/a><span style=\"font-weight: 400;\">. Online marketers should take a look at <\/span><a href=\"https:\/\/onlinegeniuses.com\/\"><span style=\"font-weight: 400;\">Online Geniuses<\/span><\/a><span style=\"font-weight: 400;\">. Like most quality Slack groups, there will be an application process and possibly a monthly fee to participate.<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/facebook.com\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">Facebook has the perennial problem of the best groups being secret. But there are some closed groups that look like they have a broad user base and good information. Here are three groups to check out:<\/span><br \/>\n<a href=\"https:\/\/www.facebook.com\/groups\/Digital.Marketing.Trends\/\"><span style=\"font-weight: 400;\">Digital Marketing Trends<\/span><\/a><br \/>\n<a href=\"https:\/\/www.facebook.com\/groups\/171303432941423\/\"><span style=\"font-weight: 400;\">PR, Marketing, and Media Czars<\/span><\/a><br \/>\n<a href=\"https:\/\/www.facebook.com\/groups\/500493680082315\/\"><span style=\"font-weight: 400;\">Screw the 9-5<\/span><\/a><br \/>\n<span style=\"font-weight: 400;\">If there is a marketing blog that you follow, especially one that is blogger-oriented, there may be an attached Facebook group as well. Check those out to see if they’re getting good traffic.<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/twitter.com\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">Hashtags are always hit-and-miss, but if you’re following hashtag conversations it’s good to have a broad variety. Locking yourself into just a small handful means you’ll only hear from a few people. We can’t do better than providing this <\/span><a href=\"https:\/\/www.marketergizmo.com\/twitter-hashtags-for-marketing-the-ultimate-list-to-drown-out-the-noise\/\"><span style=\"font-weight: 400;\">ultimate list of marketing hashtags<\/span><\/a><span style=\"font-weight: 400;\"> from MarketerGizmo. You’ll have quality hashtags to follow for days from there!<\/span><br \/>\n<span style=\"font-weight: 400;\">This list of resources should help get any freelance marketer some great resources for extending their network, expanding their client base, and enhancing their careers. Did we miss a resource you love? Let us know in the comments. And be sure to check out our design and writing goldmines as well!<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Freelancing and marketing go hand in hand. A successful freelancer can find gigs anywhere because all businesses need marketing. You have every niche available to you!<\/p>\n","protected":false},"author":38,"featured_media":7929,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[2,17,19],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>20+ Goldmines for Finding Freelance Marketing Jobs<\/title>\n<meta name=\"description\" content=\"Here we’ve put together this resource guide that you can use as a freelance marketer to get your foot in the door and start earning money.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/workspace.fiverr.com\/blog\/20-freelance-marketing-goldmines-for-freelance-jobs\/\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"20+ Goldmines for Finding Freelance Marketing Jobs\" \/>\n<meta name=\"twitter:description\" content=\"Here we’ve put together this resource guide that you can use as a freelance marketer to get your foot in the door and start earning money.\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Emily Hunter\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"20+ Goldmines for Finding Freelance Marketing Jobs","description":"Here we’ve put together this resource guide that you can use as a freelance marketer to get your foot in the door and start earning money.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/workspace.fiverr.com\/blog\/20-freelance-marketing-goldmines-for-freelance-jobs\/","twitter_card":"summary_large_image","twitter_title":"20+ Goldmines for Finding Freelance Marketing Jobs","twitter_description":"Here we’ve put together this resource guide that you can use as a freelance marketer to get your foot in the door and start earning money.","twitter_misc":{"Written by":"Emily Hunter","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/workspace.fiverr.com\/#organization","name":"Fiverr","url":"https:\/\/workspace.fiverr.com\/","sameAs":[],"logo":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#logo","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","width":512,"height":512,"caption":"Fiverr"},"image":{"@id":"https:\/\/workspace.fiverr.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/workspace.fiverr.com\/#website","url":"https:\/\/workspace.fiverr.com\/","name":"Fiverr Workspace","description":"","publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/workspace.fiverr.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/blog\/20-freelance-marketing-goldmines-for-freelance-jobs\/#primaryimage","inLanguage":"en-US","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/workspace.fiverr.com\/blog\/20-freelance-marketing-goldmines-for-freelance-jobs\/#webpage","url":"https:\/\/workspace.fiverr.com\/blog\/20-freelance-marketing-goldmines-for-freelance-jobs\/","name":"20+ Goldmines for Finding Freelance Marketing Jobs","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/20-freelance-marketing-goldmines-for-freelance-jobs\/#primaryimage"},"datePublished":"2016-12-27T08:11:22+00:00","dateModified":"2022-03-24T11:51:24+00:00","description":"Here we’ve put together this resource guide that you can use as a freelance marketer to get your foot in the door and start earning money.","breadcrumb":{"@id":"https:\/\/workspace.fiverr.com\/blog\/20-freelance-marketing-goldmines-for-freelance-jobs\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/workspace.fiverr.com\/blog\/20-freelance-marketing-goldmines-for-freelance-jobs\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/workspace.fiverr.com\/blog\/20-freelance-marketing-goldmines-for-freelance-jobs\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Fiverr Workspace","item":"https:\/\/workspace.fiverr.com\/"},{"@type":"ListItem","position":2,"name":"20+ Goldmines for Finding Freelance Marketing Jobs"}]},{"@type":["Article","BlogPosting"],"@id":"https:\/\/workspace.fiverr.com\/blog\/20-freelance-marketing-goldmines-for-freelance-jobs\/#article","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/blog\/20-freelance-marketing-goldmines-for-freelance-jobs\/#webpage"},"author":{"@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/37b8b34839d3740db0232b7803b1ac1b"},"headline":"20+ Goldmines for Finding Freelance Marketing Jobs","datePublished":"2016-12-27T08:11:22+00:00","dateModified":"2022-03-24T11:51:24+00:00","mainEntityOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/20-freelance-marketing-goldmines-for-freelance-jobs\/#webpage"},"wordCount":2522,"publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"image":{"@id":"https:\/\/workspace.fiverr.com\/blog\/20-freelance-marketing-goldmines-for-freelance-jobs\/#primaryimage"},"thumbnailUrl":"","articleSection":["Freelance knowledge","HUSTLE","GROWING YOUR BUSINESS"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/37b8b34839d3740db0232b7803b1ac1b","name":"Emily Hunter","image":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/47efa578ae6f82f115080dbd31965707?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/47efa578ae6f82f115080dbd31965707?s=96&d=mm&r=g","caption":"Emily Hunter"},"description":"Emily Hunter runs Hunting For Words, a small Atlanta writing firm. Her company's work has been seen all over the world, even in a TED talk! When she's not writer-wrangling, she's cheering for her favorite DCI corps, plotting out new business ideas, and dipping her fingers in ink. If you like Emily's work or want to yammer about business, send her an email at emily@huntingforwords.com.","sameAs":["https:\/\/huntingforwords.com"]}]}},"_links":{"self":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/1934"}],"collection":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/users\/38"}],"replies":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/comments?post=1934"}],"version-history":[{"count":0,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/1934\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media?parent=1934"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/categories?post=1934"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/tags?post=1934"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}