{"id":1946,"date":"2020-11-25T22:15:40","date_gmt":"2016-12-28T08:38:52","guid":{"rendered":"https:\/\/blog.and.co\/?p=1946"},"modified":"2022-03-28T09:22:31","modified_gmt":"2022-03-28T09:22:31","slug":"20-freelance-design-goldmines-for-finding-jobs-and-community","status":"publish","type":"post","link":"https:\/\/workspace.fiverr.com\/blog\/20-freelance-design-goldmines-for-finding-jobs-and-community\/","title":{"rendered":"20+ Freelance Design Goldmines for Finding Jobs and Community"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Design is one of those marvelous fields that only got better with the advent of the Internet. After decades sketching out marvelous renderings for everything from posters to brochures to newspaper advertisements, the field broadened by an unmeasurable amount with the ability to design graphics for websites, online advertisements, blogs, mobile apps, and more.  While the number of jobs is a massive one, so too is the competition, particularly among the latest generation to reach the workforce, which has grown up with the Internet as a tool and learned to use it rapidly and competitively.<\/span><br \/>\n<span style=\"font-weight: 400;\">A recent article by <\/span><a href=\"https:\/\/www.business2community.com\/brandviews\/upwork\/hire-graphic-designer-01712516#QZZcuJTz0yqgyYem.97\"><span style=\"font-weight: 400;\">Business2Community<\/span><\/a><span style=\"font-weight: 400;\"> suggests that clients, in addition to seeking obvious traits like professionalism and talent in hiring for freelance design jobs, are on the lookout for professionalism, great customer reviews, and a killer portfolio when they go seeking freelance designers.<\/span><br \/>\n<span style=\"font-weight: 400;\">Here’s a look at the obvious websites and hidden gems of the web when it comes to finding freelance design jobs. Don’t forget to check out <\/span><span style=\"font-weight: 400;\">Fiverr Workspace’s list of the top places to find freelance jobs<\/span><span style=\"font-weight: 400;\"> for a broad spectrum of freelance design job sites.<\/span><\/p>\n<h2>The Obvious Places to Start<\/h2>\n<h3 style=\"text-align: center;\"><\/h3>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/www.freelancer.com\/\">Freelancer<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">Talk about obvious, right? Freelancer got the best domain name years before the competition woke up and has run with it. Like Upwork, it has a glut of low-paying freelance design jobs  that can be a real turn-off when you’re seeking proper work for your skill level. Fortunately, Freelancer has improved its interface over time, and you can easily search for just your specialty &#8211; graphic design jobs , UX\/UI, website design &#8211; and phase out a huge segment of unwanted listings.<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/www.flexjobs.com\/\">Flexjobs<\/a><\/h3>\n<p><span style=\"font-weight: 400;\"> Flexjobs has the most-vetted freelance design jobs listings around among the big jobs, but that comes with a catch. It’s one of the more rare sites that charges a fee for job seekers. The question obviously becomes is a monthly or yearly policy worth saving time looking for jobs yourself.  It’s $15\/month or $50\/year, but of course the catch is just because you have access to these great freelance design jobs listings, doesn’t mean you’ll get hired as much as you like. Take this site heavily salted with reality.<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/www.linkedin.com\/\">LinkedIn<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">The best part about LinkedIn is that most of the spam is filtered away before you even sign up, meaning the people looking to hire for freelance design jobs are all legitimate.  The job search interface is pretty potent, you can dive deep and search by key terms, job function, date posted, and set up as many job alerts as you want. To go a bit more local, check out the new <\/span><a href=\"https:\/\/www.linkedin.com\/profinder\"><span style=\"font-weight: 400;\">ProFinder<\/span><\/a><span style=\"font-weight: 400;\"> resource, which allows you to connect with professional seeking your specialities in the same geographic region.<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/www.peopleperhour.com\/\">PeoplePerHour<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">A job marketplace on the upswing, PeoplePerHour lets you post your rate for freelance design jobs as well as searching for freelance design jobs. As of this writing, there were just more than 2,000 freelance design jobs listed on the site, with nearly two-thirds of those in the “intermediate” salary range. It might not be what you’re looking for long term, but it’s a great way to pay the bills and keep up a steady stream of work in the meantime.<\/span><\/p>\n<h2>Have You Looked Here?<\/h2>\n<p style=\"text-align: center;\">\n<p><span style=\"font-weight: 400;\">Perhaps the best thing about being a designer is that your talent is easy to share with potential clients. You can put your best work forward for the world to see, and clients with freelance design jobs on their plates will instantly know whether your talent is what they’re looking for or not.<\/span><br \/>\n<span style=\"font-weight: 400;\">So how best to share your best work with the rest of the world in an interactive, secure environment?<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/workingnotworking.com\/signup\/creative\">Working Not Working<\/a><\/h3>\n<p>You know they’re having fun at Working Not Working based on the first line of their signup page: “We set the bar high. Like Snoop Dogg high.” And it’s true, the site uses a vetting process to only hire the top 10% of creatives who apply. But that’s the sort of thing that lets the company pitch its people to Apple, Google, and the New York Times. A healthy online presence is an absolute must.<\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/www.twine.fm\/\">Twine<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">Twine<\/span><span style=\"font-weight: 400;\"> is a bustling community of creatives that recently surpassed 180,000 registered users. Not only does it give design freelancers a gorgeous space for the portfolios but it also has a healthy job board, plus the unique addition of a place to seek collaboration with other creatives on larger jobs. If you’re looking for a community dedicated to a wide variety of creative freelancers, including many professions that tend to lack coverage on other sites, check out Twine for sure. <\/span><\/p>\n<h3 style=\"text-align: center;\"><\/h3>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/dribbble.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Dribbble<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">If you don’t know about <\/span><span style=\"font-weight: 400;\">Dribble<\/span><span style=\"font-weight: 400;\">, you probably haven’t been doing freelance design jobs for very long. It’s one of the best communities around for freelancers, and it’s specific to designers and illustrators. The community is a helpful one and its unique niche is the ability to post screenshots of your work in progress and receive comments on it from other users. The community includes real-life meetups and online podcasts to help promote the industry as a whole. There’s also a consistently updated job board. The more involved you get, the more doors will open for you.<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/www.coroflot.com\/\">Coroflot<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">No one seems to know what the origin for the website named <\/span><span style=\"font-weight: 400;\">Coroflot<\/span><span style=\"font-weight: 400;\"> came from, but it’s entering its third decade of connecting talented creatives to the companies seeking their talents. There’s no fee, but instead a rigorous application process that separates the haves from the have nots. Its job board is free for everyone, but only those who become members are entitled to the vibrant user profiles that allow customers to find the ideal candidates for their freelance design jobs. Like other sites, users are encouraged to upload their best products, and the site goes above and beyond by incorporating a blog full of useful information on the profession and an impressive database of design professional salary ranges based on type of job, city, state, and country.<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/viewbook.com\/\">Viewbook<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">Portfolios and websites need to look good. It’s an obvious fact but still often gets overlooked. That’s why you’ve got to give credit to the powers that be over at <\/span><span style=\"font-weight: 400;\">Viewbook<\/span><span style=\"font-weight: 400;\">, they’ve hit on a great niche in realizing how many design clients are on the go &#8211; traveling by plane, car, train, you name it &#8211; but still needing to see the latest offerings. Viewbook erases the clutter from your portfolio\/website so that it’s clean, polished, and loads in the blink of an eye. Viewbook gives potential customers everything they might need seamlessly &#8211; the ultimate in responsive design. It does cost &#8211; $16\/month &#8211; but that’s only after a free trial. An impressive bonus feature is the ability to sell your work directly off the site &#8211; if clients like what they see, you can do the transaction straight away without the need for a third-party exchange. However, if Viewbook’s offerings don’t grab you, Wix and Squarespace also offer similar templates if you’re so inclined.<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/www.pinterest.com\/\">Pinterest<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">If you’re like me, you probably believe <\/span><span style=\"font-weight: 400;\">Pinterest<\/span><span style=\"font-weight: 400;\"> is used mainly for DIY projects and fun crafts to keep the kids busy during summer vacation. However because of its gorgeous format and visual pop, it also makes an exceptionally viable showcase for all of your best work. In addition, simple searches for terms like ‘freelance design jobs’ will send tons of results your way including smart ideas on where to look for work, how to set up contracts, do’s and dont’s of dealing with clients, and more. Make sure to include as much of your contact information &#8211; website, blog, social media handles, IM names, etc. &#8211; as you can to make it incredibly easy for potential clients to contact you when they see something they like.<\/span>Networking and Professional Associations<\/p>\n<p style=\"text-align: center;\">\n<p><span style=\"font-weight: 400;\">While communities and job boards are great, it’s important to realize that when you become a professional designer, there are also expansive professional networks dedicated solely to your profession. This can be a resource for standards and expectations as well as a great place to network with other professionals and potential clients. Most of these websites also have listings of freelance design jobs for their members. Some of the top organizations for designers include:<\/span><br \/>\n<span style=\"font-weight: 400;\">Other tips can also include reminding a freelancer to have business cards and sometimes ease up on the marketing and focus more on getting to know a potential client. Some examples include:<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/adcglobal.org\/jobs\/\" target=\"_blank\" rel=\"noopener noreferrer\">Art Director&#8217;s Club<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">The <\/span><span style=\"font-weight: 400;\">Art Directors Club<\/span><span style=\"font-weight: 400;\"> is bearing down on 100 years as an organization, getting its start in 1920. Its membership is not required to scour the job board for positions, which are a blend of on-site and off-site; full-time and freelance. What&#8217;s also great about ADC is its connection to the rest of the industry. It is not only a source for freelancers but also jobs seeking the best freelancers. In doing so, both freelancer and employer are able to target the most qualified and talented in their search. <\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/www.aiga.org\/\">AIGA (The Professional Association for Design)<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">The AIGA is enormous; with 70 chapters and more than 25,000 members across the United States. The organization puts on conventions and hosts contests, offers webinars and professional development, and has a job board along with the offer of your own member portfolio. Memberships begin at $50\/year and ride an escalator up into the thousands, but at that base level you get access to the job board, the ability to take part in online tutorials and workshops, and a personalized member profile.<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/www.ico-d.org\/\">Icograda (International Council of Graphic Design Associates)<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">Known as ico-D for short, this institute has existed for more than 50 years and was founded in London. ico-D has three levels of membership: professional (that’s you), educational, and promotional. Its job board is open to everyone, and the listings are truly a global affair. Its resources page is loaded with great information about things freelance designers can struggle with, like protecting your IP, while its members get a free portfolio page and the opportunity to enter contests and attend seminars at discounted rates.<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/www.rgd.ca\/\">RGD (Association of Registered Graphic Designers)<\/a><\/h3>\n<p><span style=\"font-weight: 400;\"> While RGD is exclusive to Canadians, it packs a punch with an impressive free supply of resources, including a large video library covering different topics on the business of design jobs, as well as white papers and case studies on a host of other topics affecting the industry such as its environmental paper policy, views on ethics, and more. There’s a slight fee to join, but members get an RGD certification which carries specific weight with Canadian businesses. There’s not a traditional job board, but members can make their own searchable pages and there are some helpful links for new designers.<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/www.graphicartistsguild.org\/\">Graphic Artists Guild<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">Yes, the name does make it sound a bit like a Dungeons &amp; Dragons outfit, and quite frankly that might be on purpose given the way most people get their start in artistry. The guild is heavily dedicated to the business side and memberships gets you lots of benefits, including a weighty book called “Graphic Artists Guild Handbook: Pricing &amp; Ethical Guidelines”. Other benefits of a paid membership include Member Portfolios, Professional Discounts on art products, rental cars, magazine subscriptions, and other websites, and a legal referral network. The membership isn’t cheap &#8211; $75 for students, jumping up to $170 for associates and $200 for professionals.<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/www.snd.org\/\">Society for News Design (SND)<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">SND focuses on design for print, web, and mobile publications and products, and its jobs trend toward the full-time side, but there are plenty of opportunities for freelance design jobs as well. Annual membership is $110 if you live in the US, but just $60 if you’re still in school somewhere. Better yet, the membership can be broken up into payments of $9.99 or $4.99 per month. Workshops, competitions, and conferences are at the heart of the offerings here. It’s not as robust an organization as some of the heavy hitters, but if your niche is news design, there’s absolutely nothing better.<\/span><\/p>\n<h2>Social Media <b>and the Internet <\/b><\/h2>\n<p><span style=\"font-weight: 400;\">If you’re able or willing to make your living as a freelancer, odds are you’ve got your fair share of social skills; after all, you’re not just selling your talents, you’re selling yourself as a valuable commodity and a solution to a problem for someone else. In order to get better as a freelance designer, you need to work, experiment, learn, and connect. Those last two can be best harnessed through interaction with your peers in the freelance design community. There are plenty of opportunities to network, chat, discuss, and more at the following sites:<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/slack.com\/\">Slack<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">You might think of Slack as a mere collaboration tool, but more and more creatives are using it to communicate among themselves without an actual project to work on. For the uninitiated, Slack channels allow users to join in discussions, instant message each other, swap files, and more. One of the best is <\/span><a href=\"https:\/\/www.deardesigners.co\/\"><span style=\"font-weight: 400;\">Dear Designers<\/span><\/a><span style=\"font-weight: 400;\">, which has a home for any skill level and any experience level. Asking the questions you’re embarrassed to ask elsewhere and getting real-life success and failure stories makes this a fantastic resource. Another channel worth a look is the <\/span><span style=\"font-weight: 400;\">Midwest Design Chat<\/span><span style=\"font-weight: 400;\">, which, you guessed it, is full of designers from the US Midwest; although anyone is welcome to join. Maintained by AIGA’s Nebraska charter, it is a great place to look for tools of the trade and free advice.<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/www.graphicdesignforum.com\/\">Graphic Design Forum (GDF)<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">With more than 20,000 members, it’s safe to say this one has some staying power. You won’t find a more robust job forum anywhere &#8211; at last glance the Classifieds section here had more than 1,700 topics and some 4,500 posts! The best chance to thrive here is to make an ID and start posting; there are dozens of boards to choose from. If you want to know how good your work is, dive into The <\/span><span style=\"font-weight: 400;\">Crit Pit<\/span><span style=\"font-weight: 400;\"> and upload it for the community to judge, but be forewarned, it gets a little rough in there!<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/www.renderosity.com\/\">Renderosity<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">Renderosity<\/span><span style=\"font-weight: 400;\"> is sort of like the WalMart of the design world, they literally have something for all your needs, from galleries and deals to a bevy of free stuff and a marketplace. The <\/span><a href=\"https:\/\/www.renderosity.com\/mod\/forumpro\/index.php\"><span style=\"font-weight: 400;\">forums<\/span><\/a><span style=\"font-weight: 400;\"> are dedicated and generous, and even when we checked in at 12:30 a.m., there were more than 2,700 members online. Hang out in the Newcomer Corner until you get a feel for the place, then start firing away your questions and comments on the experience of looking for freelance design jobs &#8211; there’s a whole section on it along with a showcase for your best work.<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/www.reddit.com\/\">Reddit<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">Depending on where you look, Reddit can either present the very best or some of the worst of our collective humanity. Fortunately, there are large tracts of it dedicated to people helping people earn a living, and that’s where we find some fantastic Subreddits dedicated solely to design. The grandest of these is <\/span><a href=\"https:\/\/www.reddit.com\/r\/Design\/\"><span style=\"font-weight: 400;\">\/r\/design<\/span><\/a><span style=\"font-weight: 400;\"> which boasts a staggering 120,000+ users and really covers the gamut of topics from very specific style questions to broad topics like physical vs. digital. It can be a bit of a ponderous thing to consider when you first start out &#8211; there’s simply so much material here, but the search functions can let you dive deeper into things you’re interested in and begin reading, learning, and posting from there. If you are more curious about the process and the mental aspect of design, you’ll want to ponder deep thoughts over at <\/span><a href=\"https:\/\/www.reddit.com\/r\/designthought\"><span style=\"font-weight: 400;\">\/r\/DesignThought<\/span><\/a><span style=\"font-weight: 400;\">. More than 15,000 users are there waiting to discuss the creative process and the industry itself, which has changed so radically in the past 20 years. Really some critical thinkers here; if you ever took a philosophy course in school, this is the spot for you.<\/span><\/p>\n<h3 style=\"text-align: center;\"><a href=\"https:\/\/www.facebook.com\/\">Facebook<\/a><\/h3>\n<p><span style=\"font-weight: 400;\">Although a majority of the public believes <\/span><span style=\"font-weight: 400;\">Facebook<\/span><span style=\"font-weight: 400;\"> is only for sharing pictures of last night’s dinner or hilarious memes about our current and future Presidents, the social media giant’s groups are a really powerful resources for a host of industries. The most popular one has the remarkably straightforward name of <\/span><a href=\"https:\/\/www.facebook.com\/groups\/214774848697200\"><span style=\"font-weight: 400;\">Graphic Designers All Over the World<\/span><\/a><span style=\"font-weight: 400;\"> and is just that &#8211; an international smorgasbord of creatives more than 30,000 strong who dialogue about the nature of their work, tips and tricks, and what projects they are currently working on. You might find any freelance design jobs here, but you’ll meet a pantheon of people whose work processes and skillsets will guarantee you learn something useful every time you visit. Another great resource is <\/span><a href=\"https:\/\/www.facebook.com\/groups\/6215481930\"><span style=\"font-weight: 400;\">Graphic Design<\/span><\/a><span style=\"font-weight: 400;\">, a public group with 22,000 members and some of the best links to design resources anywhere on the Internet. You’ll never lack for fonts or templates again once you’ve spent a few hours exploring this group.<\/span><br \/>\nAnd now that you have your design goldmines covered, be sure to find freelance jobs in marketing and writing goldmines as well!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Design is one of those marvelous fields that only got better with the advent of the Internet. After decades sketching out marvelous renderings for everything from<\/p>\n","protected":false},"author":100,"featured_media":7928,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[2,17,19],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>20+ Freelance Design Goldmines for Finding Jobs and Community<\/title>\n<meta name=\"description\" content=\"Here’s a look at the hidden gems of the web when it comes to finding freelance design jobs. Check out AND.CO’s list of the top places to find freelance jobs.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/workspace.fiverr.com\/blog\/20-freelance-design-goldmines-for-finding-jobs-and-community\/\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"20+ Freelance Design Goldmines for Finding Jobs and Community\" \/>\n<meta name=\"twitter:description\" content=\"Here’s a look at the hidden gems of the web when it comes to finding freelance design jobs. Check out AND.CO’s list of the top places to find freelance jobs.\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"NICK GEORGANDIS\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"13 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"20+ Freelance Design Goldmines for Finding Jobs and Community","description":"Here’s a look at the hidden gems of the web when it comes to finding freelance design jobs. Check out AND.CO’s list of the top places to find freelance jobs.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/workspace.fiverr.com\/blog\/20-freelance-design-goldmines-for-finding-jobs-and-community\/","twitter_card":"summary_large_image","twitter_title":"20+ Freelance Design Goldmines for Finding Jobs and Community","twitter_description":"Here’s a look at the hidden gems of the web when it comes to finding freelance design jobs. Check out AND.CO’s list of the top places to find freelance jobs.","twitter_misc":{"Written by":"NICK GEORGANDIS","Est. reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/workspace.fiverr.com\/#organization","name":"Fiverr","url":"https:\/\/workspace.fiverr.com\/","sameAs":[],"logo":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#logo","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","width":512,"height":512,"caption":"Fiverr"},"image":{"@id":"https:\/\/workspace.fiverr.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/workspace.fiverr.com\/#website","url":"https:\/\/workspace.fiverr.com\/","name":"Fiverr Workspace","description":"","publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/workspace.fiverr.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/blog\/20-freelance-design-goldmines-for-finding-jobs-and-community\/#primaryimage","inLanguage":"en-US","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/workspace.fiverr.com\/blog\/20-freelance-design-goldmines-for-finding-jobs-and-community\/#webpage","url":"https:\/\/workspace.fiverr.com\/blog\/20-freelance-design-goldmines-for-finding-jobs-and-community\/","name":"20+ Freelance Design Goldmines for Finding Jobs and Community","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/20-freelance-design-goldmines-for-finding-jobs-and-community\/#primaryimage"},"datePublished":"2016-12-28T08:38:52+00:00","dateModified":"2022-03-28T09:22:31+00:00","description":"Here’s a look at the hidden gems of the web when it comes to finding freelance design jobs. Check out AND.CO’s list of the top places to find freelance jobs.","breadcrumb":{"@id":"https:\/\/workspace.fiverr.com\/blog\/20-freelance-design-goldmines-for-finding-jobs-and-community\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/workspace.fiverr.com\/blog\/20-freelance-design-goldmines-for-finding-jobs-and-community\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/workspace.fiverr.com\/blog\/20-freelance-design-goldmines-for-finding-jobs-and-community\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Fiverr Workspace","item":"https:\/\/workspace.fiverr.com\/"},{"@type":"ListItem","position":2,"name":"20+ Freelance Design Goldmines for Finding Jobs and Community"}]},{"@type":["Article","BlogPosting"],"@id":"https:\/\/workspace.fiverr.com\/blog\/20-freelance-design-goldmines-for-finding-jobs-and-community\/#article","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/blog\/20-freelance-design-goldmines-for-finding-jobs-and-community\/#webpage"},"author":{"@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/5eac76a67650c48cb9dbcd8acb55f5b4"},"headline":"20+ Freelance Design Goldmines for Finding Jobs and Community","datePublished":"2016-12-28T08:38:52+00:00","dateModified":"2022-03-28T09:22:31+00:00","mainEntityOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/20-freelance-design-goldmines-for-finding-jobs-and-community\/#webpage"},"wordCount":2861,"publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"image":{"@id":"https:\/\/workspace.fiverr.com\/blog\/20-freelance-design-goldmines-for-finding-jobs-and-community\/#primaryimage"},"thumbnailUrl":"","articleSection":["Freelance knowledge","HUSTLE","GROWING YOUR BUSINESS"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/5eac76a67650c48cb9dbcd8acb55f5b4","name":"NICK GEORGANDIS","image":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/3526023cb86318605e7fae8d0184eba9?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/3526023cb86318605e7fae8d0184eba9?s=96&d=mm&r=g","caption":"NICK GEORGANDIS"},"description":"Nick Georgandis is a contributor for Hustle &amp; Co, the leading publication devoted to educating and empowering the future workforce. Beyond offering up insights here, Nick is the owner of Twin Miracles Editorial, where he is responsible for freelance writing and editing projects for clients around the world. Nick’s writing has also appeared in Nuclear Energy Insider, Discovery Senior Living Magazine, Golf Blogger UK, and HERO Sports. In Nick's free time, he enjoys anxiously counting down the days until the next \"Star Wars\" movie."}]}},"_links":{"self":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/1946"}],"collection":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/users\/100"}],"replies":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/comments?post=1946"}],"version-history":[{"count":0,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/1946\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media?parent=1946"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/categories?post=1946"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/tags?post=1946"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}