{"id":2119,"date":"2020-11-25T22:15:41","date_gmt":"2019-03-05T08:51:12","guid":{"rendered":"https:\/\/blog.and.co\/?p=2119"},"modified":"2022-05-31T05:30:23","modified_gmt":"2022-05-31T05:30:23","slug":"what-is-a-1099-form-youre-gonna-learn-today","status":"publish","type":"post","link":"https:\/\/workspace.fiverr.com\/blog\/what-is-a-1099-form-youre-gonna-learn-today\/","title":{"rendered":"1099 Form Tips Freelancers Need to Know"},"content":{"rendered":"\n<p><span style=\"font-weight: 400;\">Taxes. Yes, we can hear your collective groan from here.<\/span><br><span style=\"font-weight: 400;\">Let’s face it—very few freelancers look forward to tax time. With so much number crunching, documentation, and a seemingly endless avalanche of paperwork involved, it’s definitely enough to inspire headaches for all of us. <\/span><br><span style=\"font-weight: 400;\">It’s always smart to connect with a professional who can help navigate you through those murky tax waters. However, it’s also a great benefit if you do some homework and gather some knowledge for yourself (plus, it’ll save you the embarrassment of seeming totally out-of-the-loop when you <em>do<\/em> finally sit down with your CPA!).<\/span><br><span style=\"font-weight: 400;\">To get started, let’s touch on something basic: the <a href=\"https:\/\/www.irs.gov\/pub\/irs-pdf\/f1099msc.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">1099 form<\/a>. If you&#8217;re freelancing for the first time this year, you might be surprised to receive a mysterious form in the mail labeled 1099-MISC, or some variant thereof.  It’s important that you understand their purpose, as well as how to deal with them correctly. <\/span><\/p>\n\n\n\n<h2>What is a 1099 form?<\/h2>\n\n\n\n<p>A 1099 form is a document referred to by the IRS as an &#8216;information return&#8217;. There are several different 1099 forms that are used to report the various types of income you may receive throughout the year other than the salary an employer pays you.&nbsp;<span style=\"font-weight: 400;\">This income can be interest earned from a bank account, compensation given to you by the government, or—you guessed it—money you earned through your freelance and consulting work.<\/span><br>The person or entity that pays you is responsible for filling out the appropriate 1099 tax form and sending it to you.<\/p>\n\n\n\n<h3>What are 1099 forms for freelancers or the self-employed?<\/h3>\n\n\n\n<p><span style=\"font-weight: 400;\">Chances are, you’re familiar with this form already. But, if you’ve ever wondered what exactly a 1099 form is—without being sorely confused by all of that legal mumbo jumbo—let’s break it down simply:<\/span><br><span style=\"font-weight: 400;\">When you work a traditional job, you receive a W-2 from your employer. This form details your wage and salary information, as well as the amount you paid in state, federal, and other taxes throughout the year—which were withheld directly from your paycheck. The IRS requires that this information be reported by employers.<\/span><br><span style=\"font-weight: 400;\">But, when you’re a freelancer, you obviously don’t have just one employer to report on your income and your taxes paid. This is where the 1099 form comes into play.<\/span><\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><span style=\"font-weight: 400;\">“Form 1099s are one tool that the IRS uses to estimate total revenue paid to businesses,” explains Rebecca Norris, CPA in a post on the JPMS Cox Accountants and Consultants blog, “They can help the IRS to ensure that business owners do not underreport their earnings for income tax purposes. Filing a 1099 also provides supporting documentation for expenses deducted on the filer’s tax returns.”<\/span><\/p><\/blockquote>\n\n\n\n<p><span style=\"font-weight: 400;\">As a freelancer, the 1099 forms you&#8217;ll receive are sent from your clients to you and to the IRS to provide proof that you got paid to do a job outside of &#8220;normal employment.&#8221; <\/span><br><span style=\"font-weight: 400;\">The 1099&nbsp;form provides an official record of how much you earned that year from a source of income that’s <em>not<\/em> involved with regular employment.<\/span><br><span style=\"font-weight: 400;\">The IRS uses these forms to help verify that you&#8217;re paying and reporting the right amount of income on your tax returns. You should retain copies of all your 1099 forms&nbsp;along with your tax returns.<\/span><br><span style=\"font-weight: 400;\"><a href=\"https:\/\/workspace.fiverr.com\/blog\/in-the-battle-of-1099-vs-w2-where-do-freelancers-fall\/\">1099 forms may look like a W2<\/a>, but they have their own tricks. For starters, you’ll likely have more than one since most freelancers don’t have a single client (otherwise you&#8217;d likely get a W2!). Also, not every client will send one, nor are they required to do so.  We’re going to hit the high points in this article and cover some things freelancers need to be aware of.<\/span><br><span style=\"font-weight: 400;\">Your clients should send you all of their 1099s for the year by the end of January. However, if they do not you&#8217;re still responsible for reporting your income to the IRS.&nbsp;<\/span><\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/10\/AND_CO_1099FormTips_1.jpg\" alt=\"What is a 1099 Form? You're Gonna Learn Today! 1099 form, freelance 1099, freelance 1099 form, 1099 form freelance, what is 1099, what is 1099 form, do I need 1099, 1099 info, 1099 details, what to know about 1099\" class=\"wp-image-2194\"\/><\/figure><\/div>\n\n\n\n<p class=\"has-text-align-center\"><\/p>\n\n\n\n<h2>What is the minimum you need to earn to get a 1099&nbsp;form?<\/h2>\n\n\n\n<p><span style=\"font-weight: 400;\">Any client who has paid you over $600 throughout the year owes you a 1099 form so that you can adequately report the income and pay taxes on it.<\/span><br><span style=\"font-weight: 400;\">For many gig workers, a single client may not sell you that much business in a year, but while they won&#8217;t be required to submit a 1099 if your work was under that $600 threshold, you’re still responsible for reporting all income on your taxes, even if you only earned $5 off them via&nbsp;Fiverr<\/span><span style=\"font-weight: 400;\"> (we know—life’s not fair).<\/span><\/p>\n\n\n\n<h2>What are your filing requirements?<\/h2>\n\n\n\n<p><span style=\"font-weight: 400;\">Also, you need to be really aware of your filing requirements. The “payment” for having the freedoms that freelancers have is that you have to pay two different sets of taxes: income taxes and self-employment taxes.<\/span><br><span style=\"font-weight: 400;\">Many new freelancers don’t make a lot of money their first year. Perhaps they are freelancing on the side, or someone else is supporting them while they get on their feet. The filing limit for a single person under age 65 for income taxes is $10,300 for this tax year. This can fool freelancers into thinking they don’t have to pay taxes.<\/span><br><span style=\"font-weight: 400;\">However, this does not account for <a href=\"https:\/\/workspace.fiverr.com\/self-employment-tax-calculator\/\" target=\"_blank\" rel=\"noreferrer noopener\">self-employment taxes<\/a>. If you make just $400 on your own outside of employment, you still have to pay self-employment taxes. Even if your business expenses made your net profit to go under $400, you still grossed more than $400 and you will need to file proof of your losses with the IRS.<\/span>f<br><span style=\"font-weight: 400;\">1099 forms will help prove to the IRS what your income was when you file for both types of taxes. They’re both paid through the 1040 form (which you’ll need to use if you get 1099s). Your accountant can give you more information on that. And if you don’t have an accountant yet, get one! They can be invaluable for your first year so you can understand all of your new deductions.<\/span><\/p>\n\n\n\n<h2>What you need to know about 1099 forms<\/h2>\n\n\n\n<p><span style=\"font-weight: 400;\">Alright, so now that you know that these forms actually serve an important purpose (and aren’t just yet another cruel way for the IRS to make your life that much harder), what else do you need to know about them?<\/span><br><span style=\"font-weight: 400;\">Let’s touch on some things that you should make sure to keep in mind when dealing with your 1099 forms.<\/span><\/p>\n\n\n\n<h3><b>1. You need them to properly file<\/b><\/h3>\n\n\n\n<p><span style=\"font-weight: 400;\">We’ll start with the most obvious point first: You need these forms when filing your taxes.&nbsp;<\/span><br><span style=\"font-weight: 400;\">1099 forms are treated just like W2s. You’ll include copies of them with your federal and state tax filings and keep a copy for yourself. The income on each 1099 is added up along with all other unreported income you earned that tax year.<\/span><br><span style=\"font-weight: 400;\">Businesses are required to mail out these forms by January 31 for the previous calendar year, meaning you should have all of yours in hand by early February at the latest. Unfortunately, many businesses do still mail them late—despite the penalties they face for doing so.<\/span><\/p>\n\n\n\n<h3><strong>2. What to do if you don&#8217;t receive a 1099 form<\/strong><\/h3>\n\n\n\n<p><span style=\"font-weight: 400;\">So, what happens if your client fails to send you a 1099 form at all?<\/span><br><span style=\"font-weight: 400;\">If you should have received a 1099 and didn’t, you&#8217;re not going to get in trouble with the IRS. It is the client’s responsibility to mail one to you.&nbsp;<\/span><br><span style=\"font-weight: 400;\">You might be tempted to reach out and request one. However, many experts warn against that tactic.<\/span><\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><span style=\"font-weight: 400;\">“If you don&#8217;t receive a Form 1099 you expect, don&#8217;t ask for it,” warns Robert Wood in <\/span><a href=\"https:\/\/www.forbes.com\/sites\/robertwood\/2015\/03\/31\/ten-things-you-should-know-about-irs-form-1099\/#622cb17feae6\"><span style=\"font-weight: 400;\">his article for <em>Forbes<\/em><\/span><\/a><span style=\"font-weight: 400;\">, “If you call or write the payer and raise the issue, you may end up with two of them, one issued in the ordinary course (even if it never got to you), and one issued because you called.”<\/span><\/p><\/blockquote>\n\n\n\n<p><span style=\"font-weight: 400;\">This can add a whole additional layer of confusion to things. So, instead, you should just plan to still report the income—whether you have a 1099 to reference or not.<\/span><br><span style=\"font-weight: 400;\">Keep a record of the income you earned from a client in case they don’t send a 1099 or they paid you too little to require one.&nbsp;<\/span><br><span style=\"font-weight: 400;\">Under no circumstances should you file 1099 forms on your client’s behalf. This creates a dangerous audit situation should your client’s 1099 forms be in process. <\/span><br><span style=\"font-weight: 400;\">As long as your reported income is equal or greater to the amount reported on all 1099 forms in your name that year, you should avoid unwanted IRS attention. But if you report more than you earned and you file, it will look like you’re cheating the government. <\/span><br><span style=\"font-weight: 400;\">The only time you might file a 1099 is if you hired a subcontractor yourself and paid them over $600 and not through a payment processor (e.g. cash, check, ACH).&nbsp;<\/span><\/p>\n\n\n\n<h3><b>3. You should report all income to avoid headaches (even without a 1099)<\/b><\/h3>\n\n\n\n<p><span style=\"font-weight: 400;\">That brings us right into our next point. You absolutely should report all of your income. Yes, even if it’s under $600 and even if you didn’t receive a 1099 form from that client.<\/span><br><span style=\"font-weight: 400;\">Why? Well, because that money is still taxable income that the IRS needs to know about. <\/span><br><span style=\"font-weight: 400;\">Remember, the clients who did pay you more than $600 throughout the year can find themselves in hot water if it’s discovered that they failed to provide you with a 1099—and you don’t want to end up in that boiling boat with them. <\/span><br><span style=\"font-weight: 400;\">So, when in doubt, report every last penny you earn. Yes, it can hurt to have even more taxes taken out of your hard-earned paychecks. But, in the end, that honest approach will save you many more headaches than it causes.<\/span><\/p>\n\n\n\n<h3><b>4. You should request to fix any 1099 errors<\/b><\/h3>\n\n\n\n<p><span style=\"font-weight: 400;\">You begin receiving your 1099 forms in the mail, and—instead of opening them right away—you toss them all into a pile on the corner of your desk to be dealt with later. While we can admire your somewhat organized method of keeping these all together, it’s better if you take a couple of minutes to check over each document as you receive it to ensure that they’re error-free. <\/span><br><span style=\"font-weight: 400;\">Believe it or not, your clients aren’t perfect—they’re bound to make mistakes here and there too. And, you’d rather discover now that your last name is spelled wrong or your address is incorrect (when you still have time to fix it!) than the night before you’re due to submit everything.<\/span><br><span style=\"font-weight: 400;\">And, yes, you absolutely should request that your client fix any errors on your 1099 form. If the client hasn’t already submitted the form to the IRS, they should be able to make the change, destroy the incorrect form, and then send in the correct one.<\/span><br><span style=\"font-weight: 400;\">However, if the client has already submitted the incorrect form, they’ll need to go through the steps to correct it with the IRS—which typically involves the simple step of preparing a new form and checking the box marked “CORRECTED”.<\/span><\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/10\/1099Forms2.png\" alt=\"1099 errors\" class=\"wp-image-2113\"\/><\/figure><\/div>\n\n\n\n<p class=\"has-text-align-center\"><\/p>\n\n\n\n<h3><b>5. Your Social Security Number holds the key<\/b><\/h3>\n\n\n\n<p><span style=\"font-weight: 400;\">While the above is undoubtedly important and you should make it your goal to ensure that each piece of information on your 1099 form is correct, here’s the most crucial thing to remember: It’s all tied to your social security number, making that the most critical piece of information on these forms (so, yes, quadruple-check that on every single form you receive!).<\/span><br><span style=\"font-weight: 400;\">“Your name and address are important, but Forms 1099 are really controlled by your Social Security number,” explains Robert Wood in a separate piece <\/span><a href=\"https:\/\/www.forbes.com\/sites\/robertwood\/2016\/01\/20\/irs-forms-1099-are-coming-the-most-important-tax-form-of-all\/#7308799e5310\"><span style=\"font-weight: 400;\">he authored for <em>Forbes<\/em><\/span><\/a><span style=\"font-weight: 400;\">, “Even if an issuer has your <\/span><i><span style=\"font-weight: 400;\">old<\/span><\/i> <i><span style=\"font-weight: 400;\">address<\/span><\/i><span style=\"font-weight: 400;\">, the information will be reported to the IRS (and your state tax authority) based on your Social Security number.”<\/span><br><span style=\"font-weight: 400;\">So, the bottom line? Make sure those digits are correct. They’re important!<\/span><\/p>\n\n\n\n<h3><b>6. You need the correct type of form<\/b><\/h3>\n\n\n\n<p><span style=\"font-weight: 400;\">Did you know that there is a huge variety when it comes to 1099 forms? That’s right—there’s a whole assortment to choose from.<\/span><br><span style=\"font-weight: 400;\">But, don’t start breathing into a paper bag quite yet thinking that now you have to sift through even more impossible-to-read requirements in an attempt to figure out which exact form you’re supposed to receive. We’ll make this easy on you: Freelancers should receive Form 1099-MISC from clients, which is the one used to report miscellaneous income.<\/span><br><span style=\"font-weight: 400;\">There is also another form of 1099 that you might get called a 1099-K. If you <a href=\"https:\/\/workspace.fiverr.com\/payments\">get paid through a credit card or a payment processor<\/a> (e.g. Paypal, Stripe), you won’t get a 1099-MISC from your client. Instead, the payment processor will mail out a 1099-K to show all of the payments you received through that payment processor,&nbsp;<\/span><a href=\"https:\/\/www.irs.gov\/businesses\/understanding-your-1099-k\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">if your payments meet certain requirements<\/span><\/a><span style=\"font-weight: 400;\">. If you use an online job board such as Fiverr, you’ll also get a 1099 form from them rather than from the clients you worked with on that particular platform.<\/span><br><a href=\"https:\/\/www.efile.com\/what-is-form-1099-misc-income-tax-return-requirements\/#types-requirements-due-dates\"><span style=\"font-weight: 400;\">Other 1099 forms<\/span><\/a><span style=\"font-weight: 400;\"> include 1099-C, which is used to report the cancellation of debt, and even 1099-S, which details payments from real estate transactions—among many, many other types of 1099 forms. But, as a freelancer, you only need to be concerned with 1099-MISC or 1099-K.<\/span><br><span style=\"font-weight: 400;\">If a client somehow gets confused and sends you a different type of 1099? You’ll want to ask to have that corrected.<\/span><br><em>If you have an Fiverr Workspace from Fiverr account (and you’re based in the U.S.), you have access to our special discount on tax services from Visor.&nbsp;Visor&nbsp;will assign you your own tax professional to do your taxes for&nbsp;you as well as be on hand for financial advice throughout the year.<\/em><\/p>\n\n\n\n<h2>1099 mistakes a freelancer needs&nbsp;to avoid<\/h2>\n\n\n\n<p><span style=\"font-weight: 400;\">To sum up the things you need to watch out for when handling 1099s, here are the high points plus a few additional things to know.<\/span><\/p>\n\n\n\n<ul><li><span style=\"font-weight: 400;\">Send copies of all 1099s when you file your taxes and keep a record for yourself.<\/span><\/li><li>If you have income that isn’t covered, keep some sort of record in case you should ever get audited and report it. You must pay tax on all your income, regardless of if there’s a formal record or not. This includes cash!<\/li><li>Don’t forget to pay self-employment tax. If you made over $400, you have to pay it.<\/li><li>If you <a href=\"https:\/\/workspace.fiverr.com\/blog\/calculating-and-paying-your-quarterly-taxes\/\">paid ahead on taxes<\/a> (like you should!) you still need to file a return to show the IRS how much you owed.<\/li><li>If you owe and you need to file an extension, you still have to pay what you can on the due date even if you’re filing later.<\/li><li>You should always confirm the amount on the 1099 with your own records before filing it. You can’t trust that the client got the amount right. You should be able to back up your 1099 filings with other data.<\/li><li>If you have an <a href=\"https:\/\/workspace.fiverr.com\/blog\/tax-changes-freelancers-llc-s-corp\/\">LLC, S-corp, or C-corp<\/a>, you’ll need to speak with an accountant. You’ll likely need to make a traditional W2 in these cases for your personal taxes, but your corporation will need to turn in the 1099s. Speak with a tax professional for more information.<\/li><\/ul>\n\n\n\n<p><span style=\"font-weight: 400;\">While we may dread getting 1099s because it means tax time is near, they are the proof that the government needs to show you’re self-employed. If you follow the simple guidelines here and read <a href=\"https:\/\/www.irs.gov\/forms-pubs\/about-form-1099-misc\">the IRS publications<\/a>, you should have no trouble using the information on your 1099s when you’re filing your taxes.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Find out everything you need to know about what 1099 forms are, how to get one, and what you should do next.<\/p>\n","protected":false},"author":128,"featured_media":9780,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[4,2],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>What is a 1099 Form? 1099 Form Tips Freelancers Need to Know<\/title>\n<meta name=\"description\" content=\"Find out everything you need to know about what 1099 forms are, how to get one, and what you should do next. Read more here.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/workspace.fiverr.com\/blog\/what-is-a-1099-form-youre-gonna-learn-today\/\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"What is a 1099 Form? 1099 Form Tips Freelancers Need to Know\" \/>\n<meta name=\"twitter:description\" content=\"Find out everything you need to know about what 1099 forms are, how to get one, and what you should do next. Read more here.\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/Header-Image_announcement_in_app.jpg\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Sophie McAulay\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"12 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"What is a 1099 Form? 1099 Form Tips Freelancers Need to Know","description":"Find out everything you need to know about what 1099 forms are, how to get one, and what you should do next. Read more here.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/workspace.fiverr.com\/blog\/what-is-a-1099-form-youre-gonna-learn-today\/","twitter_card":"summary_large_image","twitter_title":"What is a 1099 Form? 1099 Form Tips Freelancers Need to Know","twitter_description":"Find out everything you need to know about what 1099 forms are, how to get one, and what you should do next. Read more here.","twitter_image":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/Header-Image_announcement_in_app.jpg","twitter_misc":{"Written by":"Sophie McAulay","Est. reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/workspace.fiverr.com\/#organization","name":"Fiverr","url":"https:\/\/workspace.fiverr.com\/","sameAs":[],"logo":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#logo","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","width":512,"height":512,"caption":"Fiverr"},"image":{"@id":"https:\/\/workspace.fiverr.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/workspace.fiverr.com\/#website","url":"https:\/\/workspace.fiverr.com\/","name":"Fiverr Workspace","description":"","publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/workspace.fiverr.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/blog\/what-is-a-1099-form-youre-gonna-learn-today\/#primaryimage","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/Header-Image_announcement_in_app.jpg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/Header-Image_announcement_in_app.jpg","width":1200,"height":576},{"@type":"WebPage","@id":"https:\/\/workspace.fiverr.com\/blog\/what-is-a-1099-form-youre-gonna-learn-today\/#webpage","url":"https:\/\/workspace.fiverr.com\/blog\/what-is-a-1099-form-youre-gonna-learn-today\/","name":"What is a 1099 Form? 1099 Form Tips Freelancers Need to Know","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/what-is-a-1099-form-youre-gonna-learn-today\/#primaryimage"},"datePublished":"2019-03-05T08:51:12+00:00","dateModified":"2022-05-31T05:30:23+00:00","description":"Find out everything you need to know about what 1099 forms are, how to get one, and what you should do next. Read more here.","breadcrumb":{"@id":"https:\/\/workspace.fiverr.com\/blog\/what-is-a-1099-form-youre-gonna-learn-today\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/workspace.fiverr.com\/blog\/what-is-a-1099-form-youre-gonna-learn-today\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/workspace.fiverr.com\/blog\/what-is-a-1099-form-youre-gonna-learn-today\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Fiverr Workspace","item":"https:\/\/workspace.fiverr.com\/"},{"@type":"ListItem","position":2,"name":"1099 Form Tips Freelancers Need to Know"}]},{"@type":["Article","BlogPosting"],"@id":"https:\/\/workspace.fiverr.com\/blog\/what-is-a-1099-form-youre-gonna-learn-today\/#article","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/blog\/what-is-a-1099-form-youre-gonna-learn-today\/#webpage"},"author":{"@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/f910d016763469c42ac34f0e7ca487c0"},"headline":"1099 Form Tips Freelancers Need to Know","datePublished":"2019-03-05T08:51:12+00:00","dateModified":"2022-05-31T05:30:23+00:00","mainEntityOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/what-is-a-1099-form-youre-gonna-learn-today\/#webpage"},"wordCount":2582,"publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"image":{"@id":"https:\/\/workspace.fiverr.com\/blog\/what-is-a-1099-form-youre-gonna-learn-today\/#primaryimage"},"thumbnailUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/Header-Image_announcement_in_app.jpg","articleSection":["Tax Hacks","Freelance knowledge"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/f910d016763469c42ac34f0e7ca487c0","name":"Sophie McAulay","image":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/6e935854a28b42f5850e592d1bb05389?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/6e935854a28b42f5850e592d1bb05389?s=96&d=mm&r=g","caption":"Sophie McAulay"},"description":"Sophie is a growth marketing strategist and freelance writer. She writes about freelancing, remote work and professional purpose for several online publications, including Fiverr Workspace from Fiverr. Connect with her on LinkedIn or Twitter."}]}},"_links":{"self":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/2119"}],"collection":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/users\/128"}],"replies":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/comments?post=2119"}],"version-history":[{"count":0,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/2119\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media\/9780"}],"wp:attachment":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media?parent=2119"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/categories?post=2119"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/tags?post=2119"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}