{"id":3076,"date":"2020-11-25T22:15:48","date_gmt":"2020-11-25T22:15:48","guid":{"rendered":"https:\/\/blog.and.co\/?p=3076"},"modified":"2022-02-14T14:03:29","modified_gmt":"2022-02-14T14:03:29","slug":"success-tips-from-side-hustlers","status":"publish","type":"post","link":"https:\/\/workspace.fiverr.com\/blog\/success-tips-from-side-hustlers\/","title":{"rendered":"7 Movers &amp; Shakers Who Turned Their Side Hustle into a Career"},"content":{"rendered":"<p>It takes a lot to side hustle your way into a career pivot, and those who pull it off tend to share many of the same qualities. They’re scrappy, savvy, passionate and determined—and always willing to share their secrets to success. We got the scoop on the switch from seven individuals who moved the alternative into the forefront and survived and are thriving enough to tell the tale.<\/p>\n<h3>The International Edition Hustle<\/h3>\n<p><a href=\"https:\/\/www.mackenziekassab.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">MacKenzie Kassab<\/a> went from beauty publicist to full-time freelance magazine writer and editor and content creator, but, she points out, it was by no means a “jump” from one field to another. Within the PR department of a beauty brand, MacKenzie gained a reputation for her strong writing skills, and was tapped with increasing frequency to draft press releases and written collateral until someone actually recommended her for a freelance gig writing press releases—her first paid assignment.<\/p>\n<p>Fast forward a few years, and MacKenzie, by then a freelance publicist, found herself in Beirut, having a hard time scoring PR jobs without speaking Arabic. She took a job at an English-language magazine, and eventually scored some freelance PR work. “My side hustle became my main hustle, and my main hustle became something I had to keep doing if I wanted heat in my apartment,” she explains.<\/p>\n<p><b>Side hustle hack<\/b>: “Start small and save big,” says Kassab. “You don’t have to dive headfirst into your dream career. Test the waters by taking on the occasional after-hours project, or promising future discounts to friends who volunteer for your services. Starting small will build your confidence and experience, and saving big will establish a life raft for those unexpected—and inevitable—setbacks. It’ll free you to focus on what matters: doing what you love to do.”<\/p>\n<h3>Hi Little One, Hi Hustle<\/h3>\n<p>Nell Lindquist traded in her regular 9-to-5 (plus some) as director of product for Celebrations.com, where she managed all digital development for the site and touched everything web-based for the brand, and went full steam ahead with her side hustle after about a year of juggling both.<\/p>\n<p>Now, she and her sister, Maggie Allen, run <a href=\"https:\/\/www.hilittleone.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Hi Little One<\/a>, a personalized children’s clothing company, full-time. How does one go from all things digital to designing baby clothes? Once her friends started having babies, Nell took her graphic design background and went shopping for cute-but-not-cheesy gifts and couldn’t find anything that fit the bill. With the resourcefulness of a side-hustler, she started making her own onesies. People loved them, babies looked adorable and cool, and, with a Kickstarter campaign and a lot more hustle, a business was born (her sister Maggie was just getting ready to reenter the workforce after a few years at home with her kids, and her background in merchandise management made the siblings a match made in heaven.)<\/p>\n<p><b>Side-hustle hack<\/b>: Nell holds onto invaluable advice shared by her cousin, who has built a successful baby food company, who told her to &#8220;quit wavering and get to work&#8221; after Nell spent lots of time on due diligence and research. “It&#8217;s absolutely important to fully evaluate and vet ideas,” she says, “but there is only so much research you can do. At some point, you need to trust your gut and just get to work!”<\/p>\n<h3>The Cowgirl Hustle<\/h3>\n<p>There’s a bad joke about lining up TV shows and lining up shoes hidden somewhere in Jeni Aron’s journey from working as a research assistant and program scheduler at Showtime to striking out on her own with the side hustle that would eventually become <a href=\"https:\/\/www.cluttercowgirl.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Clutter Cowgirl<\/a>.<\/p>\n<p>She didn’t become the Clutter Cowgirl overnight, but turned the occasional helping hand in “tidying up” for a friend into a revenue-driving service, and worked both simultaneously for more than a decade (“Nuts!” she agrees), before going in 100 percent as a professional organizer. She attributes the rise of such a title to the growing popularity of HGTV shows, and capitalized on her natural knack for knowing where things go, including when that mean &#8220;straight to the trash.&#8221;<\/p>\n<p><b>Side hustle hacks:<\/b><\/p>\n<ul>\n<li>Says Aron: &#8220;Charge for your time and do not give away your work for free. It creates a dynamic between you and the client and value in both time and service. Even if you&#8217;re starting out and only want to charge $20\/hour, that legitimizes your work. The client will take you seriously and the boundaries will be set.&#8221;<\/li>\n<li>She adds: &#8220;You can&#8217;t help everyone. Not every potential client is right for you. My work is very intimate, I&#8217;m in people&#8217;s homes listening to their stories as we work, this is a relationship and one I value very much. Listen to your gut and don&#8217;t force a sale if the client is hemming and hawing over price or over how you can help them. Keep it moving, the right clients will come to you if you have clearly expressed what you can offer.&#8221;<\/li>\n<\/ul>\n<h3>The Professional Side Hustler<\/h3>\n<p>When it comes to the side hustle, most folks plug along balancing their “day job” while looking forward to the moment they can take the plunge into the other, and never look back. Not <a href=\"https:\/\/www.kristinalibby.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Kristina Libby<\/a>. She’s what you might call a professional side-hustler, having run consumer PR at Microsoft while also teaching courses as a professor at the University of Florida, writing an e-book on social media, and developing an influencer marketing technology called <a href=\"https:\/\/www.getsocu.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">SoCu<\/a>. Hers is not a world with just one side hustle for a finite period of time, it’s an ongoing endeavor that she has turned into her regular routine.<\/p>\n<p>Says Kristina: “Side hustles bring creativity, innovation and differentiation into our careers while giving an outlet for experimentation and learning. A side hustle makes you both more interesting, and more personal.” She also sings the praises of a side hustle from job security in changing industries to preparation for entrepreneurship—and a way to “leapfrog” your career and double your pay.<\/p>\n<p><b>Side hustle hack<\/b>: “Read everything. Evolve constantly. The true limit to achievement is in our own imagination and understanding of how the system around us works. There are books, or podcasts or TED Talks on how to navigate and succeed in every system—but you<em> do<\/em> have to read them and not be afraid of your own intellect.”<\/p>\n<h3>A Series of Side Hustles<\/h3>\n<p>Side hustling has become a way of life for <a href=\"https:\/\/oliviaomega.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Olivia Omega<\/a>, who eventually ditched agency life, where she worked as a marketing analyst and account executive, for a variety of independent endeavors building on her skills.<br \/>\nAt one point, she made baby clothing for pregnant friends that turned into a national clothing line.<\/p>\n<p>She worked as a branding consultant and picked up graphic design and web development gigs while still on staff. It only took about six months before she realized the side hustle was the ticket to taking her career forward, and off she went. Whatever uncertainty lie ahead was tempered by Olivia’s innate need to express her creativity doing something she loved. Both times she started to branch out into the passion realm, she wasn’t thinking about money at the outset—until she realized she had to support her family doing what started as a hobby.<\/p>\n<p><b>Side hustle hack<\/b>: “Set a deadline and put in your notice. Obviously be smart about it: have some savings and have a plan. But we will always hold onto our steady paying jobs if we allow ourselves to, because it&#8217;s scary to let go. I find that until we are forced to rely totally on our side hustle for income it will remain a side hustle. When people who are working on their dreams on the side tell me that they&#8217;ve been laid off or their current contract has ended (this is what happened to me). I say &#8216;Thank God!&#8217; Now you have no choice but to go for it, make your dreams a reality and grow a successful business!'&#8221;<\/p>\n<h3>Sweetness on the Side<\/h3>\n<p>You might say that Rebecca Cassity’s foray into her side hustle was a pretty sweet way to help her mother-in-law. She was working in marketing, management and sales for a publishing company when her mother-in-law, who owned a candy store, lamented that she couldn’t find a truly excellent caramel. Rebecca thought surely she could track one down in her city, but alas, she came up short.<\/p>\n<p>Having always enjoyed making food, especially sweets, Rebecca casually tried her hand at making her own. After a few attempts with her husband’s help, she’d made something delicious, and her in-laws agreed. The amateur caramels sold out instantly, with customers begging for more. What started as a sort of “why not?” moment Rebecca knew she’d have fun with became <a href=\"https:\/\/www.facebook.com\/serendipityconfections\/\" target=\"_blank\" rel=\"noopener noreferrer\">Serendipity Confections<\/a>, a four-year side hustle turned award-winning food brand based in Wyoming.<\/p>\n<p><b>Side hustle hack<\/b>: &#8220;There&#8217;s always more than one path to get where you want to go. Don&#8217;t be afraid to explore all of the options,&#8221; advises Rebecca.<\/p>\n<h3>The Constant Hustle<\/h3>\n<p>Careers may come and go, but for Shain Kish, the side hustle is forever. Since college, when he was studying photography with dreams of becoming a master printer before everything went digital, he has held one thing dear: makeup.<\/p>\n<p>First, he got his financials under him while working at a nightclub. Then, he maxed out a new Macy’s card on MAC makeup and charged classmates $25 a shoot to do makeup for their photos. He explains that as president of his art club in high school, he knew how to paint, and understood how light worked on the face, so makeup came naturally.<br \/>\n“After college, I never even bought a camera,” he says. Instead, he got Kevyn Aucoin’s book, &#8220;Making Faces,&#8221; and that was his only form of training. Throughout work as a server, a bartender, and, ultimately, a corporate beauty educator for a major brand, Shain has continued to freelance.<\/p>\n<p><strong>Side hustle hack:<\/strong> “I planned so hard and so well for everything else to happen, and, well, it didn’t. But the one thing I never focused on stayed consistent, and the constant ‘falling back on’ ended up being what propelled me forward.”<\/p>\n<h3>Let&#8217;s recap those nuggets of wisdom<\/h3>\n<ul>\n<li>Start small, opting for a test-and-learn approach to scaling your side-hustle business.<\/li>\n<li>Sometimes, done is better than perfect. Do your homework, but also know when to hit the gas.<\/li>\n<li>DO NOT GIVE AWAY FREE WORK, even if it&#8217;s for a side-hustle! (Keep in mind, there can be opportunities to derive non-monetary value through barter arrangements.)<\/li>\n<li>Learn to say &#8220;No.&#8221; It&#8217;s compelling to have clients lined up, but your future success will depend on solid execution. Not every opportunity is a fit.<\/li>\n<li>Never stop learning. Part of the fun of pursuing a side-hustle is the learning curve you will experience, and the new people and ways of thinking you will undoubtedly encounter.<\/li>\n<li>Looking to dive into your side-hustle full time? Draw a line in the sand for when you plan to take the leap, otherwise you might be waiting for the &#8220;right time&#8221; forever.<\/li>\n<li>Take the road less traveled. Establishing your own career path means looking for unconventional ways in and doing things your way. Don&#8217;t be afraid to march to the beat of your own drum.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>We asked successful side-hustlers to share their best hack for turning part-time passion projects into major sources of income. Here&#8217;s what they had to say.<\/p>\n","protected":false},"author":75,"featured_media":3089,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[6,17],"tags":[31,39,46,47],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>7 Movers &amp; Shakers Who Turned Their Side Hustle into a Career<\/title>\n<meta name=\"description\" content=\"We got the scoop on the switch from seven individuals who moved the alternative into the forefront and survived and are thriving enough to tell the tale.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/workspace.fiverr.com\/blog\/success-tips-from-side-hustlers\/\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"7 Movers &amp; Shakers Who Turned Their Side Hustle into a Career\" \/>\n<meta name=\"twitter:description\" content=\"We got the scoop on the switch from seven individuals who moved the alternative into the forefront and survived and are thriving enough to tell the tale.\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"KELLY O'REILLY\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"7 Movers & Shakers Who Turned Their Side Hustle into a Career","description":"We got the scoop on the switch from seven individuals who moved the alternative into the forefront and survived and are thriving enough to tell the tale.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/workspace.fiverr.com\/blog\/success-tips-from-side-hustlers\/","twitter_card":"summary_large_image","twitter_title":"7 Movers & Shakers Who Turned Their Side Hustle into a Career","twitter_description":"We got the scoop on the switch from seven individuals who moved the alternative into the forefront and survived and are thriving enough to tell the tale.","twitter_misc":{"Written by":"KELLY O'REILLY","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/workspace.fiverr.com\/#organization","name":"Fiverr","url":"https:\/\/workspace.fiverr.com\/","sameAs":[],"logo":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#logo","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","width":512,"height":512,"caption":"Fiverr"},"image":{"@id":"https:\/\/workspace.fiverr.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/workspace.fiverr.com\/#website","url":"https:\/\/workspace.fiverr.com\/","name":"Fiverr Workspace","description":"","publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/workspace.fiverr.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/blog\/success-tips-from-side-hustlers\/#primaryimage","inLanguage":"en-US","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/workspace.fiverr.com\/blog\/success-tips-from-side-hustlers\/#webpage","url":"https:\/\/workspace.fiverr.com\/blog\/success-tips-from-side-hustlers\/","name":"7 Movers & Shakers Who Turned Their Side Hustle into a Career","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/success-tips-from-side-hustlers\/#primaryimage"},"datePublished":"2020-11-25T22:15:48+00:00","dateModified":"2022-02-14T14:03:29+00:00","description":"We got the scoop on the switch from seven individuals who moved the alternative into the forefront and survived and are thriving enough to tell the tale.","breadcrumb":{"@id":"https:\/\/workspace.fiverr.com\/blog\/success-tips-from-side-hustlers\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/workspace.fiverr.com\/blog\/success-tips-from-side-hustlers\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/workspace.fiverr.com\/blog\/success-tips-from-side-hustlers\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Fiverr Workspace","item":"https:\/\/workspace.fiverr.com\/"},{"@type":"ListItem","position":2,"name":"7 Movers &amp; Shakers Who Turned Their Side Hustle into a Career"}]},{"@type":["Article","BlogPosting"],"@id":"https:\/\/workspace.fiverr.com\/blog\/success-tips-from-side-hustlers\/#article","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/blog\/success-tips-from-side-hustlers\/#webpage"},"author":{"@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/eaa97da49a10ed6a6e5ec378d253cbc5"},"headline":"7 Movers &amp; Shakers Who Turned Their Side Hustle into a Career","datePublished":"2020-11-25T22:15:48+00:00","dateModified":"2022-02-14T14:03:29+00:00","mainEntityOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/success-tips-from-side-hustlers\/#webpage"},"wordCount":1897,"publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"image":{"@id":"https:\/\/workspace.fiverr.com\/blog\/success-tips-from-side-hustlers\/#primaryimage"},"thumbnailUrl":"","keywords":["personal branding","entrepreneurs","freelance tips","side-hustle"],"articleSection":["Inspiration","HUSTLE"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/eaa97da49a10ed6a6e5ec378d253cbc5","name":"KELLY O'REILLY","image":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/10e16fbc94a8ff366d992f5c59073626?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/10e16fbc94a8ff366d992f5c59073626?s=96&d=mm&r=g","caption":"KELLY O'REILLY"},"description":"Kelly O’Reilly spends her days absorbing and telling people's stories as a writer, copywriter, editor and consultant, as well as the co-founder of the Coterie, Denver's first co-working community for women. Her editorial writing has also appeared in Elle, Cool Hunting, New York Magazine, Architectural Digest and Gear Patrol, among others. In her free time, she skis, knits, reads, runs, and kicks it in the mountains with her little mutt, Chuck."}]}},"_links":{"self":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/3076"}],"collection":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/users\/75"}],"replies":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/comments?post=3076"}],"version-history":[{"count":0,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/3076\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media?parent=3076"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/categories?post=3076"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/tags?post=3076"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}