{"id":5260,"date":"2020-11-25T22:16:20","date_gmt":"2018-06-11T01:29:28","guid":{"rendered":"https:\/\/www.and.co\/blog\/?p=5260"},"modified":"2021-11-03T13:23:24","modified_gmt":"2021-11-03T13:23:24","slug":"7-habits-of-highly-effective-freelancers","status":"publish","type":"post","link":"https:\/\/workspace.fiverr.com\/blog\/7-habits-of-highly-effective-freelancers\/","title":{"rendered":"7 Habits of Highly Effective Freelancers"},"content":{"rendered":"<p>The Stephen Covey book The 7 Habits of Highly Effective People may be nearly 30 years old, but it continues to be one of the best-selling self-help books in history for the timeless lessons it teaches that continue to be relevant to the business and personal obstacles we seek to navigate today. While the first three center on improvement of oneself, the second three focus on collaboration and teamwork. Finally, concerning the last two habits, Covey emphasizes that self-mastery is a never-ending process. The journey is constantly evolving as we refine our character with each experience we encounter, personally and in our career paths.<br \/>\nLet’s take a look at how Covey’s seven traits map onto the world of freelancing:<\/p>\n<h2>1. Be proactive<\/h2>\n<p>As a freelancer, you have full control over business including how you position your skills and talent in the market as well as whether you have a healthy pipeline of relationships and prospective business deals. Stated differently, Covey would say that successful freelancers carefully design their careers, by being decisive, courageous, passionate, and most importantly, proactive. Rather than emphasizing the things they can’t do or don’t have control over, they actively find ways to get things done to move the needle.<br \/>\nTake business prospecting for example. A reactive individual may choose to focus on the fact that they’d like to have more clients, but blame a lack of time for not being able to find them. In contrast, a proactive person would take responsibility for the situation, channeling their time and energy into adopting a hunter persona when it comes to new business. In short, they take control and choose their behavior, whether that be setting aside time each day to scour the <a href=\"https:\/\/www.fiverr.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Fiverr marketplace<\/a> for gigs, mastering their cold email game, or attending network events.<br \/>\nThe same approach can be applied to prove your value to expanding existing clients. For instance, pitching a new idea that might be out of scope. You can focus on what you don’t have control over, that is, what if the client doesn’t go for the idea, or you can choose to be courageous and demonstrate that you can take initiative by offering up new ideas and pursuing chances to grow and develop in your area of expertise.<br \/>\nFinally, and this is especially important for new freelancers, in order to be successful in the gig economy you have to stay on top of your finances. This is 100% a necessary skill that directly impacts your livelihood and the future of your business, but daunting as that may seem there are plenty of apps to help streamline the process so you don’t have to trade billable hours to be a bookkeeper. Fiverr Workspace’s app features an <a href=\"https:\/\/workspace.fiverr.com\/invoicing\" target=\"_blank\" rel=\"noopener noreferrer\">invoicing tool<\/a>, <a href=\"https:\/\/workspace.fiverr.com\/expense-tracking\" target=\"_blank\" rel=\"noopener noreferrer\">expense tracking<\/a>, and a <a href=\"https:\/\/workspace.fiverr.com\/reports\" target=\"_blank\" rel=\"noopener noreferrer\">business report interface<\/a>. You can also check out services like WealthSimple, a Fiverr Elevate partner, for quick courses on retirement, health insurance, and more. Or test out <a href=\"https:\/\/workspace.fiverr.com\/invoice-templates\">Fiverr Workspace&#8217;s free invoice templates<\/a> for each industry.<\/p>\n<h2>2. Start with the end in mind<\/h2>\n<p>Starting with the end in mind is all about seeing yourself as a business and setting short and long-term goals that comprise a plan for getting there. To do so, begin by making your business vision tangible by writing it down. Then, approach each day and project keeping in mind the direction and destiny you’ve outlined. In doing so, you’ll habitualize the act of flexing those proactive muscles we discussed earlier and be able to witness the growth of your business before your eyes.<br \/>\nThe key ingredient is accountability. Be responsible and take ownership of what you’re setting out to achieve and set aside time, perhaps each month, to assess the progress you’ve made and what changes you should make. Remember: this is a constant learning process, so do your best to navigate the obstacles with poise, and reward yourself for the victories. No process is impervious to life’s curveballs, but the idea here is by keeping tabs on our milestones, our leadership skills will naturally let us know if we’re going in the wrong direction, or in the words of who used a ladder as a metaphor, “If the ladder is not leaning against the right wall, every step we take just gets us to the wrong place faster.”<\/p>\n<h2>3. Put first things first<\/h2>\n<p>Freelancers are inherently tasked with juggling multiple projects and clients. With the volume and quality of the freelance jobs you’re able to secure directly tied to the success you’ll have as an independent worker, you must take prioritization seriously (dare I say too seriously).<br \/>\nTo help ensure you’re optimizing for efficiency, spend some time finding a personal management software that fits with your workflow and habits. Are you more of a visual learner? Check out <a href=\"https:\/\/trello.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Trello<\/a>, a task and project management tool that uses a drag-and-drop interface so you can assign and manage tasks across boards and lists.<br \/>\nIf you’re looking to improve how you take and organize notes, try out <a href=\"https:\/\/evernote.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Evernote<\/a>. The mobile app is compatible with a variety of formats such as text, photo, audio, and PDF and all of your content can be synced across devices, including computers, phones, and tablets so you can have easy and seamless access on-the-go.<br \/>\nFor a one-stop shop, look no further than <a href=\"https:\/\/asana.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Asana<\/a>. The web and mobile app features calendars, tasks, projects, dashboards, and conversation capability for collaborating. From project templates, setting and managing due dates, piecing out larger deliverables into interim milestones, you can do it all here.<br \/>\nFinally, Fiverr Workspace offers a multi-device <a href=\"https:\/\/workspace.fiverr.com\/time-tracking\" target=\"_blank\" rel=\"noopener noreferrer\">time tracking tool<\/a> to help you manage and document your hours on overall projects or specific activities depending on your workload.<\/p>\n<h2>4. Think win-win<\/h2>\n<p>From a freelancer perspective, seeing things not as win-lose but as win-win translates to having an accurate and genuine understanding your client&#8217;s business needs and delivering against those in the highest quality possible. It likely goes without saying, but when you do that, you win and your clients win too.<br \/>\nCovey says that those who approach their business relationships with this attitude possess three fundamental character traits: integrity, maturity, and an abundance mentality. Overall, these mean that you’re one to stick with their gut, you are comfortable expressing yourself but empathetic towards the needs and interests of others, and lastly, you view opportunities through the lens of cooperation not competition&#8211;that is&#8211;there’s mutual benefit to be reaped by both parties.<\/p>\n<h2>5. Seek first to understand, and then to be understood<\/h2>\n<p>In vein with approaching your relationships with a “win-win” mentality, you need to listen to what your clients need instead of thinking first from your perspective. Stated differently, it isn’t about what you want to sell, but it’s about what your clients need that you can deliver.<br \/>\nThe issue with the alternative mindset, seeking first to be understood, as Covey illustrates, is that you risk missing the real meaning behind what the other person is trying to get across. Why? Because you’re entering the conversation with an automatic “you” filter, weighing everything they say against your own agenda, perspectives, values, etc. In short, you are communicating solely for the intent to reply versus to understand what the other person has to say. As a result, you may miss certain parts of the conversation, or jump to premature conclusions that don’t accurately reflect the other person’s message.<br \/>\nIt may be Interpersonal Communication 101, but applying this simple lesson will help shape a more favorable perception of your work ethic and communication skills in the eyes of your client, resulting in a stronger relationship.<\/p>\n<h2>6. Synergize<\/h2>\n<p>To synergize is to combine strengths of others. As a freelancer, this means building a network of people with complementary skills. if you do PR, for instance, build a collaborative team of designers, engineers, writers, etc. that you can call on as needed. That said, the core theme with respect to synergy is open-mindedness; to differences, to another’s influence and insights, alternative approaches, whatever it may be, look for the value-add in utilizing its power to harness creativity and new solutions.<br \/>\nThe key takeaway is that you can build a network and rely on a community even being a business of one. Tying back to other traits covered before, it’s about actively forging these relationships and seeing the partnership as a win-win, and understanding their differences before you seek to have your point of view reinforced by the other person.<\/p>\n<h2>7. Sharpen the saw<\/h2>\n<p>Desire, knowledge, skill. The freelance world is all about having a learning mindset and a constant drive to hone your skills over time. You are in charge of your own career and development. This means you can either stay stagnant, or you can learn into growth and learning opportunities to help you increase your capacity to produce for your clients. By being curious and hungry for more expertise, you’ll also be better equipped to handle the challenges that come with your work.<br \/>\nHow can you regularly put this into practice? Take courses, take on a task or project that intimidates you for the sake of rolling up yourself and getting some accomplished and stepping out of your comfort zone, take on a client you know will push you. In short, yes, it may be very challenging, but the result is tangible development and a maintenance of passion and stamina. As Covey articulates, by consistently “sharpening the saw,” you’re investing in “the greatest asset you have&#8211;you.”<\/p>\n<h2>Bonus #8: Automate everything<\/h2>\n<p>The phrase time is money is especially applicable to freelancers and solopreneurs. The good news is there are numerous tools and technologies out there to help you breeze through the desk work so you can expand the hours devoted to your client work.<br \/>\n<a href=\"https:\/\/workspace.fiverr.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">Fiverr Workspace<\/a> offers an all-encompassing app helping you with contracts and proposals, invoices and payments, expenses, and business reports complete with visual statistics. You can also use the time-tracking tool for automatically saving your activities to create editable timesheets and then instantly generate an invoice for your client. Use these on any device for flexible tracking and management of your sheets. It’s everything you need to run your business and more!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Stephen Covey book The 7 Habits of Highly Effective People may be nearly 30 years old, but it continues to be one of the best-selling<\/p>\n","protected":false},"author":40,"featured_media":8463,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[2,17],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>7 Habits of Highly Effective Freelancers<\/title>\n<meta name=\"description\" content=\"The Stephen Covey book continues to be one of the best-selling books in history for the timeless lessons it teaches that continue to be relevant. Take a look.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/workspace.fiverr.com\/blog\/7-habits-of-highly-effective-freelancers\/\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"7 Habits of Highly Effective Freelancers\" \/>\n<meta name=\"twitter:description\" content=\"The Stephen Covey book continues to be one of the best-selling books in history for the timeless lessons it teaches that continue to be relevant. Take a look.\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Erica Perry\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"7 Habits of Highly Effective Freelancers","description":"The Stephen Covey book continues to be one of the best-selling books in history for the timeless lessons it teaches that continue to be relevant. Take a look.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/workspace.fiverr.com\/blog\/7-habits-of-highly-effective-freelancers\/","twitter_card":"summary_large_image","twitter_title":"7 Habits of Highly Effective Freelancers","twitter_description":"The Stephen Covey book continues to be one of the best-selling books in history for the timeless lessons it teaches that continue to be relevant. Take a look.","twitter_misc":{"Written by":"Erica Perry","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/workspace.fiverr.com\/#organization","name":"Fiverr","url":"https:\/\/workspace.fiverr.com\/","sameAs":[],"logo":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#logo","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","width":512,"height":512,"caption":"Fiverr"},"image":{"@id":"https:\/\/workspace.fiverr.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/workspace.fiverr.com\/#website","url":"https:\/\/workspace.fiverr.com\/","name":"Fiverr Workspace","description":"","publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/workspace.fiverr.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/blog\/7-habits-of-highly-effective-freelancers\/#primaryimage","inLanguage":"en-US","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/workspace.fiverr.com\/blog\/7-habits-of-highly-effective-freelancers\/#webpage","url":"https:\/\/workspace.fiverr.com\/blog\/7-habits-of-highly-effective-freelancers\/","name":"7 Habits of Highly Effective Freelancers","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/7-habits-of-highly-effective-freelancers\/#primaryimage"},"datePublished":"2018-06-11T01:29:28+00:00","dateModified":"2021-11-03T13:23:24+00:00","description":"The Stephen Covey book continues to be one of the best-selling books in history for the timeless lessons it teaches that continue to be relevant. Take a look.","breadcrumb":{"@id":"https:\/\/workspace.fiverr.com\/blog\/7-habits-of-highly-effective-freelancers\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/workspace.fiverr.com\/blog\/7-habits-of-highly-effective-freelancers\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/workspace.fiverr.com\/blog\/7-habits-of-highly-effective-freelancers\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Fiverr Workspace","item":"https:\/\/workspace.fiverr.com\/"},{"@type":"ListItem","position":2,"name":"7 Habits of Highly Effective Freelancers"}]},{"@type":["Article","BlogPosting"],"@id":"https:\/\/workspace.fiverr.com\/blog\/7-habits-of-highly-effective-freelancers\/#article","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/blog\/7-habits-of-highly-effective-freelancers\/#webpage"},"author":{"@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/c0dc714b39de2bee4019947da9f3272b"},"headline":"7 Habits of Highly Effective Freelancers","datePublished":"2018-06-11T01:29:28+00:00","dateModified":"2021-11-03T13:23:24+00:00","mainEntityOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/7-habits-of-highly-effective-freelancers\/#webpage"},"wordCount":1708,"publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"image":{"@id":"https:\/\/workspace.fiverr.com\/blog\/7-habits-of-highly-effective-freelancers\/#primaryimage"},"thumbnailUrl":"","articleSection":["Freelance knowledge","HUSTLE"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/c0dc714b39de2bee4019947da9f3272b","name":"Erica Perry","image":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/5c2d25a22e5e96178d1529bad9ae5967?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/5c2d25a22e5e96178d1529bad9ae5967?s=96&d=mm&r=g","caption":"Erica Perry"},"description":"Erica Perry is a freelance marketing and content consultant living in Boston."}]}},"_links":{"self":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/5260"}],"collection":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/users\/40"}],"replies":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/comments?post=5260"}],"version-history":[{"count":0,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/5260\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media?parent=5260"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/categories?post=5260"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/tags?post=5260"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}