{"id":5268,"date":"2020-11-25T22:16:20","date_gmt":"2018-06-27T11:37:37","guid":{"rendered":"https:\/\/www.and.co\/blog\/?p=5268"},"modified":"2022-03-24T12:33:23","modified_gmt":"2022-03-24T12:33:23","slug":"5-reasons-why-your-freelance-business-isnt-growing","status":"publish","type":"post","link":"https:\/\/workspace.fiverr.com\/blog\/5-reasons-why-your-freelance-business-isnt-growing\/","title":{"rendered":"5 Reasons Why Your Freelance Business Isn’t Growing"},"content":{"rendered":"<p>In the freelancing world, success is largely determined by the volume and quality of gigs that you&#8217;re able to secure for yourself. In this hustle, it&#8217;s up to you to routinely check the pulse of how healthy your business is, and assess what factors may be preventing you from advancing. The first place you need to look? Your own day-to-day actions and behaviors.<br \/>\nHere are five reasons your business may not be growing, each followed by tips for getting back on track:<\/p>\n<h3>1. You’re not a hunter.<\/h3>\n<p><span style=\"font-weight: 400;\">A key ingredient to being a successful freelancer involves adopting the mindset of an entrepreneur and viewing yourself as a business of one. From a new business standpoint, this boils down to taking on the persona of a hunter. That is, instead of waiting for opportunity to knock on your door, you need to integrate the act of searching for, and closing, new business deals a regular part of your day-to-day tasks. Why? Because now that you’ve gone solo this responsibility of business development resides solely with you, and neglect of this imperative business function can and will dramatically impact the stability of your career and overall livelihood. <\/span><br \/>\n<span style=\"font-weight: 400;\">Now, the concept of finding freelance jobs can seem daunting, especially if you’re new to world of freelancing. The good news, however, is that securing a healthy and robust pipeline of prospective clients can be as easy as having the right mindset and knowing which resources are at your disposal.  <\/span><br \/>\n<span style=\"font-weight: 400;\">To start, consider setting up an alert on the <\/span><a href=\"https:\/\/remoteok.com\/\"><span style=\"font-weight: 400;\">Remote OK<\/span><\/a><span style=\"font-weight: 400;\"> job boards. This resource is particularly useful for contract or remote roles, though you should also spend time browsing the full-time gigs. Startups on the whole have a tendency to be more flexible when it comes to hiring freelancers and contractors, and it just may be you are the perfect person to bring on board in a part-time capacity, generating cost-savings for them as they scale and allowing you to do work you’re genuinely passionate about. Who knows<\/span><span style=\"font-weight: 400;\">—<\/span><span style=\"font-weight: 400;\">they may enjoy working with you so much that they decide to ask you to stick around as a steady retainer. As the saying goes, nothing ventured, nothing gained. <\/span><br \/>\n<span style=\"font-weight: 400;\">On the same topic of scouring job boards, you can also check out other remote-only boards like <\/span><a href=\"https:\/\/jobspresso.co\/\"><span style=\"font-weight: 400;\">Jobspresso<\/span><\/a><span style=\"font-weight: 400;\">, <\/span><a href=\"https:\/\/weworkremotely.com\/\"><span style=\"font-weight: 400;\">We Work Remotely<\/span><\/a><span style=\"font-weight: 400;\">, and <\/span><a href=\"https:\/\/remoteok.io\/\"><span style=\"font-weight: 400;\">Remote Ok<\/span><\/a><span style=\"font-weight: 400;\">. These will especially be up your alley if you’re the type of person who thrives on traveling and requires the flexibility of taking on projects from wherever you want as opposed to being tied to one location. Lastly, check out <\/span><a href=\"https:\/\/www.fiverr.com\/\"><span style=\"font-weight: 400;\">Fiverr<\/span><\/a><span style=\"font-weight: 400;\"> or sign up for a Fiverr Pro account for access to our marketplace bursting with freelance roles.<\/span><\/p>\n<h3>2. Your positioning is weak.<\/h3>\n<p><span style=\"font-weight: 400;\">As a freelancer, being able to articulate what you’re selling clearly and strategically will always be indispensable<\/span><span style=\"font-weight: 400;\">—<\/span><span style=\"font-weight: 400;\">whether you’re a veteran or new to the space.<\/span><br \/>\n<span style=\"font-weight: 400;\">This is largely because as a business of one, you can’t be everything to everyone so you have to pick where you want to play and position your skills and services as a customer benefit. For example, instead of reaching out to a client and saying, “I sell SEO copywriting services,” it is much more effective to say, “I help clients expand their organic search footprint so they can grow their businesses.” The reason? Put simply, the client isn’t interested in your title or sales plan, they’re interested in how you’ll help them achieve their business objectives. <\/span><br \/>\n<span style=\"font-weight: 400;\">Specificity is key here. This not only lends clarity as to what you’ll deliver to them but helps you avoid giving off the impression that you don’t have a strike zone, in other words, a focused capability. In other words, you’ll be perceived as knowledgeable, transparent, professional, and trustworthy, all of which speak levels to your work ethic and what makes your expertise unmatched and irreplaceable. In short, it’s about striking a balance between understanding there are two sides to every business deal, and communicating the qualitative value you bring to the table versus simply stating what you sell.<\/span><br \/>\n<span style=\"font-weight: 400;\">A few initial questions you can consider as you think about positioning yourself include: what do I want my client to say when we’ve completed a project? What would make a client choose me over someone else? How can I convince this potential client that my capabilities are particularly suitable in meeting their goals? <\/span><\/p>\n<h3>3. You’re not proactive.<\/h3>\n<p><span style=\"font-weight: 400;\">Along the same vein with being a hunter, you need to take a proactive mindset to expanding your business and getting paid. <\/span><br \/>\n<span style=\"font-weight: 400;\">Let’s start with invoicing. In order to get paid, you need to be timely about sending your invoices to your clients. Look no further than Fiverr Workspace’s <\/span><a href=\"https:\/\/workspace.fiverr.com\/invoicing\"><span style=\"font-weight: 400;\">invoicing tool <\/span><\/a><span style=\"font-weight: 400;\">to seamlessly create and track all of your invoices. These can be auto-generated based on contracts and projects, or set up on a recurring schedule if you’re workflow is more geared toward weekly and monthly projects. Or, use these <a href=\"https:\/\/workspace.fiverr.com\/invoice-templates\">free invoice templates<\/a> to get started. <\/span><br \/>\n<span style=\"font-weight: 400;\">It’s important to note that your job isn’t done once you hit ‘send.’ Being proactive when it comes to getting paid includes facilitating the follow-up process, especially if your client misses their deadline. Luckily, this doesn’t have to be awkward or a point of contention thanks to Fiverr Workspace’s feature, which will alert you when a client has viewed your invoice and remind them that it’s time to pay you if they’re dragging their feet. <\/span><br \/>\n<span style=\"font-weight: 400;\">Have an idea that&#8217;s out of scope? Pitch it to your client. Again<\/span><span style=\"font-weight: 400;\">—<\/span><span style=\"font-weight: 400;\">be a hunter; take risks. Nobody is going to regularly tap you on the shoulder and ask you to share your ideas or if you’re up for taking on more work. You need to constantly be showing value and bringing new ideas to the table and pursuing chances to grow and develop in your area of expertise. As a few actionable tips when preparing your pitch: be confident in these conversations, structure your thoughts thoroughly in advance so its tailored to the client, make it relevant, and support it with case studies, research, or any prior work you’ve done. Of course, the key is balance so be mindful to avoid cluttering the message with too many details. <\/span><\/p>\n<h3>4. You’re sweating the small stuff.<\/h3>\n<p><span style=\"font-weight: 400;\">While the perks of freelancing allow you to work where and when you choose, you lose the luxury of a bi-weekly or weekly paycheck. While you may not be able to calculate a precise, consistent income flow every month, there are still plenty of ways you can easily trace the financial ins and out of your business so you can effectively budget including saving for retirement, managing your taxes, and calculating your expenses. <\/span><br \/>\n<span style=\"font-weight: 400;\">As a general rule of thumb, the better, more diligent you are when it comes to managing your finances, the more time and effort you can spend serving clients and doing the work you love.<\/span><br \/>\n<span style=\"font-weight: 400;\">To help you achieve this, there are a number of apps and other technologies that can help you automate these processes.<\/span><br \/>\n<span style=\"font-weight: 400;\">We’ve already touched on Fiverr Workspace’s invoice feature, so now let’s chat about expenses. Fiverr Workspace’s app comes fully equipped with <\/span><span style=\"font-weight: 400;\">an <\/span><a href=\"https:\/\/workspace.fiverr.com\/expense-tracking\"><span style=\"font-weight: 400;\">expense reporting <\/span><\/a><span style=\"font-weight: 400;\">section helping you <\/span><span style=\"font-weight: 400;\">keeping track of all of your expenses, file them, and get the reports you need when tax season rolls around. In short, you’re free put those work-related costs out of sight out of mind and instead, devote your attention to your client work.<\/span><br \/>\n<span style=\"font-weight: 400;\">Further, during any quarter or fiscal year, you can tap Fiverr Workspace’s <\/span><a href=\"https:\/\/workspace.fiverr.com\/reports\"><span style=\"font-weight: 400;\">business reporting tool<\/span><\/a><span style=\"font-weight: 400;\"> to get a high-level overview of the financial health of your business as well as instant access to key visual statistics, expense and income overviews, and more. In short, you can use the app to manage all of your accounting tasks end-to-end in a streamlined flow that keeps your business operating smoothly, saving you headaches and stress. <\/span><br \/>\n<span style=\"font-weight: 400;\">Switching gears to project management, there are several great ways to make sure you’re prioritizing your deliverables so you don’t have to worry about missing a deadline.<\/span><br \/>\n<span style=\"font-weight: 400;\">For visual learners, check out <\/span><a href=\"https:\/\/trello.com\/\"><span style=\"font-weight: 400;\">Trello<\/span><\/a><span style=\"font-weight: 400;\">, a task and project management tool that incorporates boards and lists as a way for users to map their tasks. To move something around, simply drag and drop the item so you can keep the workflow moving seamlessly.<\/span><br \/>\n<a href=\"https:\/\/asana.com\/\"><span style=\"font-weight: 400;\">Asana<\/span><\/a><span style=\"font-weight: 400;\"> is all about organization first. The <\/span><span style=\"font-weight: 400;\">web and mobile application offers a variety of means for setting up projects including Lists, Boards, Calendars, and Timelines. Dashboards, and conversation allow you to break up smaller projects into large, stay on top of due dates and keep yourself and team members aligned all projects and tasks.<\/span><br \/>\n<span style=\"font-weight: 400;\">Looking to improve your note taking skills, or be able to access your notes easily across devices? <\/span><a href=\"https:\/\/evernote.com\/\"><span style=\"font-weight: 400;\">Evernote<\/span><\/a><span style=\"font-weight: 400;\"> is compatible with multiple formats including text, photo, audio, video, and PDF, and accessible through computers, phones, and tablets, amongst other devices. <\/span><br \/>\n<span style=\"font-weight: 400;\">Finally, Fiverr Workspace’s <\/span><a href=\"https:\/\/workspace.fiverr.com\/time-tracking\"><span style=\"font-weight: 400;\">time tracking tool<\/span><\/a><span style=\"font-weight: 400;\"> is easy to use but powerful. At a glance, you can use it to auto-generate your invoices, track time by project, and parse activities out by whatever fits your workload. In addition, you can track your time on your mobile device, then continue on your desktop or vice-versa. <\/span><\/p>\n<h3>5. You’re not thinking big enough.<\/h3>\n<p><span style=\"font-weight: 400;\">Keep in mind that while you may be a freelance resource to your client, you’re also a business. As such, it’s critical to plan and have certain formalities in place so you can operate and grow like one. <\/span><br \/>\n<span style=\"font-weight: 400;\">A good place to start is to set up a simple and sleek <\/span><a href=\"https:\/\/www.squarespace.com\/\"><span style=\"font-weight: 400;\">Squarespace<\/span><\/a><span style=\"font-weight: 400;\"> page and company email. This instantly gives you credibility and professionalism so you can feel like an expert whether you’re a new freelancer or a long-time independent simply looking to grow your audience and business. Portfolios, websites, online stores, the all-in-one platform has it all. <\/span><br \/>\n<span style=\"font-weight: 400;\">In vein with establishing yourself as a professional early, you may also consider setting up an LLC. While this may sound overwhelming, the <\/span><span style=\"font-weight: 400;\">Fiverr Elevate course on LLCs<\/span><span style=\"font-weight: 400;\">, created in partnership with Stellar Formation can give you the best practices you need around topics such as how an LLC can help protect your intellectual property (IP) and establish roles and ownership within your business (p.s.. i<\/span><span style=\"font-weight: 400;\">f you&#8217;re a Fiverr member, <\/span><span style=\"font-weight: 400;\">y<\/span><span style=\"font-weight: 400;\">ou can also get an awesome discount on Stellar).<\/span><br \/>\n<span style=\"font-weight: 400;\">Before you do any of these things, however, you should start with a carefully thought out business plan. As the captain of your ship, this is an important step for both long and short-term goals. Whether you want to earn 20 percent this year or grow your business by a certain number of clients, a framework that incorporates deadlines and milestones to which you hold yourself accountable will be instrumental. At the same time, bare in mind that not everything will always go perfectly to plan. Allow yourself to be open-minded and flexible throughout this journey, and above all, enjoy yourself!<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>In the freelancing world, success is largely determined by the volume and quality of gigs that you&#8217;re able to secure for yourself. In this hustle, it&#8217;s<\/p>\n","protected":false},"author":40,"featured_media":8089,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[2,19],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>5 Reasons Why Your Freelance Business Isn’t Growing<\/title>\n<meta name=\"description\" content=\"How healthy your business is? What factors preventing you from advancing? Here are 5 reasons why your business isn&#039;t growing with tips for getting back on track\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/workspace.fiverr.com\/blog\/5-reasons-why-your-freelance-business-isnt-growing\/\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"5 Reasons Why Your Freelance Business Isn’t Growing\" \/>\n<meta name=\"twitter:description\" content=\"How healthy your business is? What factors preventing you from advancing? Here are 5 reasons why your business isn&#039;t growing with tips for getting back on track\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Erica Perry\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"5 Reasons Why Your Freelance Business Isn’t Growing","description":"How healthy your business is? What factors preventing you from advancing? Here are 5 reasons why your business isn't growing with tips for getting back on track","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/workspace.fiverr.com\/blog\/5-reasons-why-your-freelance-business-isnt-growing\/","twitter_card":"summary_large_image","twitter_title":"5 Reasons Why Your Freelance Business Isn’t Growing","twitter_description":"How healthy your business is? What factors preventing you from advancing? Here are 5 reasons why your business isn't growing with tips for getting back on track","twitter_misc":{"Written by":"Erica Perry","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/workspace.fiverr.com\/#organization","name":"Fiverr","url":"https:\/\/workspace.fiverr.com\/","sameAs":[],"logo":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#logo","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","width":512,"height":512,"caption":"Fiverr"},"image":{"@id":"https:\/\/workspace.fiverr.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/workspace.fiverr.com\/#website","url":"https:\/\/workspace.fiverr.com\/","name":"Fiverr Workspace","description":"","publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/workspace.fiverr.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/blog\/5-reasons-why-your-freelance-business-isnt-growing\/#primaryimage","inLanguage":"en-US","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/workspace.fiverr.com\/blog\/5-reasons-why-your-freelance-business-isnt-growing\/#webpage","url":"https:\/\/workspace.fiverr.com\/blog\/5-reasons-why-your-freelance-business-isnt-growing\/","name":"5 Reasons Why Your Freelance Business Isn’t Growing","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/5-reasons-why-your-freelance-business-isnt-growing\/#primaryimage"},"datePublished":"2018-06-27T11:37:37+00:00","dateModified":"2022-03-24T12:33:23+00:00","description":"How healthy your business is? What factors preventing you from advancing? Here are 5 reasons why your business isn't growing with tips for getting back on track","breadcrumb":{"@id":"https:\/\/workspace.fiverr.com\/blog\/5-reasons-why-your-freelance-business-isnt-growing\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/workspace.fiverr.com\/blog\/5-reasons-why-your-freelance-business-isnt-growing\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/workspace.fiverr.com\/blog\/5-reasons-why-your-freelance-business-isnt-growing\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Fiverr Workspace","item":"https:\/\/workspace.fiverr.com\/"},{"@type":"ListItem","position":2,"name":"5 Reasons Why Your Freelance Business Isn’t Growing"}]},{"@type":["Article","BlogPosting"],"@id":"https:\/\/workspace.fiverr.com\/blog\/5-reasons-why-your-freelance-business-isnt-growing\/#article","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/blog\/5-reasons-why-your-freelance-business-isnt-growing\/#webpage"},"author":{"@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/c0dc714b39de2bee4019947da9f3272b"},"headline":"5 Reasons Why Your Freelance Business Isn’t Growing","datePublished":"2018-06-27T11:37:37+00:00","dateModified":"2022-03-24T12:33:23+00:00","mainEntityOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/5-reasons-why-your-freelance-business-isnt-growing\/#webpage"},"wordCount":1856,"publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"image":{"@id":"https:\/\/workspace.fiverr.com\/blog\/5-reasons-why-your-freelance-business-isnt-growing\/#primaryimage"},"thumbnailUrl":"","articleSection":["Freelance knowledge","GROWING YOUR BUSINESS"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/c0dc714b39de2bee4019947da9f3272b","name":"Erica Perry","image":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/5c2d25a22e5e96178d1529bad9ae5967?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/5c2d25a22e5e96178d1529bad9ae5967?s=96&d=mm&r=g","caption":"Erica Perry"},"description":"Erica Perry is a freelance marketing and content consultant living in Boston."}]}},"_links":{"self":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/5268"}],"collection":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/users\/40"}],"replies":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/comments?post=5268"}],"version-history":[{"count":0,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/5268\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media?parent=5268"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/categories?post=5268"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/tags?post=5268"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}