{"id":6217,"date":"2020-11-25T22:16:30","date_gmt":"2020-11-25T22:16:30","guid":{"rendered":"https:\/\/www.and.co\/blog\/?p=6217"},"modified":"2021-11-28T09:51:15","modified_gmt":"2021-11-28T09:51:15","slug":"why-some-freelancers-bring-in-big-money-while-others-struggle-to-find-work","status":"publish","type":"post","link":"https:\/\/workspace.fiverr.com\/blog\/why-some-freelancers-bring-in-big-money-while-others-struggle-to-find-work\/","title":{"rendered":"Why Some Freelancers Bring in Big Money While Others Struggle to Find Work"},"content":{"rendered":"<p>At first, freelancing can seem so alluring, so sexy. You watch other freelancers start doing client work on the side. Then they quit their day job to do it full-time.<\/p>\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/10\/How-freelancers-make-big-bucks-AND-CO-from-Fiverr-.png\" alt=\"How freelancers make big bucks -Fiverr Workspace from Fiverr\" class=\"wp-image-6218\" \/><figcaption>Photo by&nbsp;<a href=\"https:\/\/unsplash.com\/photos\/dRCjgmc4B8I?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Katie Harp &#8211; Pinterest Manager<\/a>&nbsp;on&nbsp;<a href=\"https:\/\/unsplash.com\/search\/photos\/money?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\">Unsplash﻿<\/a>﻿<\/figcaption><\/figure>\n<p>Before you know it, these freelancers are sharing income reports online that far surpass what you’re making at your day job or could ever hope to make from your own freelancing efforts. <br \/><\/p>\n\n\n\n<p>It can be really discouraging.<br><\/p>\n\n\n\n<p>It might leave you asking: How is it that some freelancers are able to quit their jobs, work minimal hours, focus on clients and projects they truly enjoy, and find that perfect balance between work and everything else in life?<br><\/p>\n\n\n\n<p>Meanwhile, you’re stuck in your dead-end job, pulling all-nighters, trying to build up enough freelancing revenue to finally quit your job, but you’ve been at it for years (<em>hey, I’ve been there<\/em>) and you don’t see the light at the end of the tunnel.<br><\/p>\n\n\n\n<p>It doesn’t seem fair.<br><\/p>\n\n\n\n<p>The truth is, though, there are a few things that highly successful freelancers are doing that you’re probably <em>not<\/em> doing. <\/p>\n\n\n<span class='bctt-click-to-tweet'><span class='bctt-ctt-text'><a href='https:\/\/twitter.com\/intent\/tweet?url=https%3A%2F%2Fworkspace.fiverr.com%2Fblog%2Fwhy-some-freelancers-bring-in-big-money-while-others-struggle-to-find-work%2F&#038;text=Chances%20are%20you%E2%80%99ve%20never%20even%20heard%20of%20some%20of%20the%20things%20these%20big-money%20%23freelancers%20do%20to%20grow%20their%20business.&#038;related' target='_blank'rel=\"noopener noreferrer\">Chances are you’ve never even heard of some of the things these big-money #freelancers do to grow their business. <\/a><\/span><a href='https:\/\/twitter.com\/intent\/tweet?url=https%3A%2F%2Fworkspace.fiverr.com%2Fblog%2Fwhy-some-freelancers-bring-in-big-money-while-others-struggle-to-find-work%2F&#038;text=Chances%20are%20you%E2%80%99ve%20never%20even%20heard%20of%20some%20of%20the%20things%20these%20big-money%20%23freelancers%20do%20to%20grow%20their%20business.&#038;related' target='_blank' class='bctt-ctt-btn'rel=\"noopener noreferrer\">Click To Tweet<\/a><\/span>\n<p><!-- wp:bctt\/clicktotweet=Chances are you’ve never even heard of some of the things these big-money #freelancers do to grow their business.\/--><\/p>\n\n\n<p><strong>Chances are you’ve never even heard of some of the things these big-money freelancers do to grow their business.<\/strong><br><\/p>\n\n\n\n<p>Today, I’m pulling back the curtain. I’d like to share with you my best advice for freelancers who want to grow their freelancing into a full-time job that easily supports them. <br><\/p>\n\n\n\n<p>My advice comes from the time I’ve spent working full-time for myself successfully but, more importantly, from the countless hours I’ve spent working with thousands of freelancers every day through my blog and online community.<br><\/p>\n\n\n\n<p>To be clear, these are <em>not<\/em> get-rich-quick ideas. They aren’t going to transform your life or your freelance business overnight.<br><\/p>\n\n\n\n<p>These tactics take hard work. Intense work. Long days. Some nights. Not every freelancer is cut out for this path, which is why so many freelancers struggle to find work while a select few are cashing really big client checks.<br><\/p>\n\n\n\n<p>However, if you’re willing to put in the work, these ideas <em>can<\/em> work for you. And they can deliver in big ways.<br><\/p>\n\n\n\n<p>So if you’re up for it, read on and you’ll find my best advice for freelancers who are ready to finally break out of the feast-famine cycle and build a sustainable, reliable business.<br><\/p>\n\n\n\n<h3>Advice #1: Stop waiting for jobs to come to you.<\/h3>\n\n\n\n<p>I’ve been actively participating in the freelancing community online for about a decade. And I’m still shocked that the majority of freelancers claim “word of mouth” is the #1 way they find new clients.<br><\/p>\n\n\n\n<p>I’m not calling them liars.<br><br>It might be true.<br><br>But what kind of advice is that for someone who’s ready to give freelancing a try? Or who’s dying to <a href=\"https:\/\/workspace.fiverr.com\/blog\/make-digital-nomad-leap\/\">make the leap<\/a> from full-time job to freelancing? Or the freelancer who’s struggling to make ends meet every month?<br><\/p>\n\n\n\n<p>It’s terrible advice, that’s what.<br><\/p>\n\n\n\n<p>It’s so passive. <br><\/p>\n\n\n\n<p>For many freelancers, they’re not working with nearly enough clients currently to get any meaningful number of word-of-mouth referrals from them. <br><\/p>\n\n\n\n<p>So while word-of-mouth marketing may prove extremely successful once you’ve already been freelancing for years—satisfying clients and refining your referral process—it’s just not logical if you’re already struggling to find work.<\/p>\n\n\n\n<p>What should you do instead?<br><\/p>\n\n\n\n<p>It depends a lot on what kinds of clients you’re looking for.<br><\/p>\n\n\n\n<p>For starters, you could <a href=\"https:\/\/fiverr.com\">sign up for sites like Fiverr<\/a> where you list a clear task, your qualifications, and some samples, thereby allowing potential clients to find you in their extensive marketplace.<br><\/p>\n\n\n\n<p>But that’s still pretty passive. Remember, the goal is to stop waiting for jobs to come to you.<br><\/p>\n\n\n\n<p>A bit better would be to <a href=\"https:\/\/millo.co\/freelance-job-sites\">try searching freelance jobs websites<\/a> for clients that match your skill set, timeline, and interest areas. Actively reach out to clients with freelance jobs that you want.<br><\/p>\n\n\n\n<p>I’m also a major fan of knocking on doors, cold-emailing or cold-calling to find clients. In fact, I’ve used cold-emailing to build my six-figure solo business.<br><\/p>\n\n\n\n<p>To be a successful cold-pitcher, however, takes work and practice. It takes knowledge of selling. <br><\/p>\n\n\n\n<p>This brings me to my next point: in order to build a better freelance business, you <em>have<\/em> to learn how to sell yourself.<\/p>\n\n\n\n<h3>Advice #2: You <em>have<\/em> to learn how to sell.<\/h3>\n\n\n<span class='bctt-click-to-tweet'><span class='bctt-ctt-text'><a href='https:\/\/twitter.com\/intent\/tweet?url=https%3A%2F%2Fworkspace.fiverr.com%2Fblog%2Fwhy-some-freelancers-bring-in-big-money-while-others-struggle-to-find-work%2F&#038;text=In%20order%20to%20build%20a%20better%20%23freelance%20business%2C%20you%20have%20to%20learn%20how%20to%20sell%20yourself.&#038;related' target='_blank'rel=\"noopener noreferrer\">In order to build a better #freelance business, you have to learn how to sell yourself. <\/a><\/span><a href='https:\/\/twitter.com\/intent\/tweet?url=https%3A%2F%2Fworkspace.fiverr.com%2Fblog%2Fwhy-some-freelancers-bring-in-big-money-while-others-struggle-to-find-work%2F&#038;text=In%20order%20to%20build%20a%20better%20%23freelance%20business%2C%20you%20have%20to%20learn%20how%20to%20sell%20yourself.&#038;related' target='_blank' class='bctt-ctt-btn'rel=\"noopener noreferrer\">Click To Tweet<\/a><\/span>\n\n\n\n<p>Whether clients miraculously start coming to you or you have to start knocking doors doesn’t really matter. In both scenarios, you <em>have<\/em> to know how to sell yourself.<br><\/p>\n\n\n\n<p>It’s one of the most common pitfalls I see in new and experienced freelancers alike: <a href=\"https:\/\/doubleyourfreelancing.com\/4-mistakes-when-selling\/\">we don’t learn how to effectively master the art of sales<\/a>.<br><\/p>\n\n\n\n<p>We’re great designers or developers or writers or coaches. <br><\/p>\n\n\n\n<p>But we’re terrible salespeople.<br><\/p>\n\n\n\n<p>I’m here to tell you: it’s holding you back.<br><\/p>\n\n\n\n<p>As a freelancer, you should think of every single moment as a selling opportunity.* <br><\/p>\n\n\n\n<p>When you’re chatting with the owner of the local coffee shop you visit almost every day? Selling moment.<br><\/p>\n\n\n\n<p>When you’re <a href=\"https:\/\/workspace.fiverr.com\/blog\/how-to-write-great-proposals-that-win-you-more-freelance-projects\/\">drafting up a proposal<\/a>? The deal’s not done yet. Selling moment.<br><\/p>\n\n\n\n<p>Even when you’re wrapping up the final details on a successful client project? Yep, selling moment. <br><br>But what should you be selling <em>after<\/em> you’re finished with a client project? Keep reading into the next section and I’ll tell you.<br><\/p>\n\n\n\n<p>To become a good salesperson will take time, practice, hard work and patience. You can expedite the process by searching for sales courses, reading some of <a href=\"https:\/\/www.ryrob.com\/best-business-books\/\">the best business books for freelancers<\/a>, joining social communities, or even getting a part-time sales job to learn from someone who’s been selling for decades. <br><\/p>\n\n\n\n<p><em>*Note: I don’t mean in that sleazy way your neighbor tries to get you to come to jewelry parties or your cousin tries to sell you essential oils in some sort of pyramid scheme. Selling can be incredibl natural and unobtrusive when done correctly.<\/em><\/p>\n\n\n\n<h3>Advice #3: Focus on converting one-time clients into recurring revenue.<\/h3>\n\n\n\n<p>One of the most common complaints I hear from freelancers is the <a href=\"https:\/\/convertkit.com\/finances-for-freelancers\/\">ever-gnawing presence of the feast-famine cycle<\/a>.<br><\/p>\n\n\n\n<p>It’s annoying. You work yourself to the bone promoting your business. Selling, selling, selling. Which means you have a great month (or two) of steady client work, exciting projects, and money in the bank. <br><\/p>\n\n\n\n<p>But before you know it, those projects are over and—because you’ve been working so hard on client projects—you’re back where you were: with lots of time and very little client work to fill that time.<br><\/p>\n\n\n\n<p>What successful freelancers do well that you haven’t figured out yet is the art of turning one-time clients into recurring revenue.<br><\/p>\n\n\n\n<p><a href=\"https:\/\/productizeandscale.com\/why-productized-service\/\">Some people call it “Productizing”<\/a> your services. Other people call it “retainer work”. Whatever you choose to call it, it’s basically the same thing:<br><\/p>\n\n\n\n<p><em>Recurring client revenue.<\/em><br><\/p>\n\n\n\n<p>Revenue you can depend on; that you can expect every month for the foreseeable future.<br><\/p>\n\n\n\n<p>In order to go from one-off clients to recurring revenue, you might have to tinker with your business model a bit first. For example, instead of offering one-off coaching sessions, try offering a lower monthly coaching fee that adds up over a series of months.<br><\/p>\n\n\n\n<p>If you’re a designer, try an “on-call” model where your client sends you small jobs throughout the month which you complete in sequence in return for a monthly subscription fee.<br><\/p>\n\n\n\n<p>Or, if you’re mostly freelancing through marketplaces, use the built-in communication features to pitch more services on a regular basis.<br><\/p>\n\n\n\n<p>As the old business adage reminds us: it’s much easier to keep a current customer than to find a brand-new one.<br><\/p>\n\n\n\n<p>Convincing clients to sign a retainer deal isn’t the only way to build more predictable revenue into your business, though. Read on.<br><\/p>\n\n\n\n<h3>Advice #4: Build systems that bring you passive income.<\/h3>\n\n\n\n<p>There’s an important distinction I need to make before we continue here. There’s a difference between passive income and recurring revenue.<br><\/p>\n\n\n\n<p>A lot of freelancers mix those up.<br><\/p>\n\n\n\n<p>They claim they want to build recurring revenue when what they really want is money that comes every month without any additional work—that’s passive income. <br><br>There are <a href=\"https:\/\/workspace.fiverr.com\/blog\/5-ways-freelancers-generate-passive-income\/\">lots of ways freelancers can build passive income into their businesses.<\/a><br><\/p>\n\n\n\n<p>For starters, try looking at the byproduct of the services you provide for clients. If you’re a web designer, are their elements of a client project you could sell as a plugin or in marketplaces like Envato’s CodeCanyon?<br><\/p>\n\n\n\n<p>If you’re a writer, could you take time each week to write for yourself instead of just your clients and thereby start a blog that eventually makes money? Or could you write an ebook on a topic you’re passionate about and find avenues in which to sell it?<br><br>If you’re a coach, could you take the most common issues your student are faced with and create a course clients who can’t afford your coaching services could take instead?<br><\/p>\n\n\n\n<p>Achieving true 100% passive income status is next to impossible. But you can build pockets of passive income into your freelance business to supplement any client revenue you’re bringing in. <\/p>\n\n\n\n<h3>Advice #5: Prepare to raise your rates.<\/h3>\n\n\n\n<p>If you’re on the hunt for articles about how to make more money as a freelancer (like I’m sharing in this one), I’m 100% certain you’re going to come across a thousand posts about <a href=\"https:\/\/workspace.fiverr.com\/blog\/raising-your-freelance-rates-in-2019-heres-how-to-do-it-right\/\">raising your rates<\/a>.<br><\/p>\n\n\n\n<p>Look… I’m a big fan of raising your rates. I agree with the idea that most freelancers probably do need to be charging more.<br><\/p>\n\n\n\n<p>At the same time, I’m really worried that it seems to be such a common fix-all solution for struggling freelancers. <br><\/p>\n\n\n\n<p>Desperate freelancers everywhere are “raising their rates” all because they read it on the blog of some super-successful fellow freelancer and they find themselves in the same position as before: unable to find clients or make any money.<br><\/p>\n\n\n\n<p>So don’t just raise your rates for the sake of raising your rates. Here are a couple ways to know if it’s time to raise your prices:<br><\/p>\n\n\n\n<ul><li>You already have a full client roster at your current rates and more clients keep coming your way without much effort.<\/li><li>New clients don’t negotiate at all on price—a sign they see far more value in your work than what you’re charging.<\/li><\/ul>\n\n\n\n<p>If you’re experiencing these phenomena and still not making as much money as you’d like to or need to each month, then it’s definitely time to raise your rates. <br><\/p>\n\n\n\n<p><a href=\"https:\/\/itunes.apple.com\/us\/podcast\/my-freelance-life\/id1337845985?mt=2\">One freelancer that I checked in with<\/a> almost weekly for an entire year after quitting his full-time job started first by charging <em>double<\/em> what he was making at his day job.<br><\/p>\n\n\n\n<p>Then he doubled that rate.<br><\/p>\n\n\n\n<p>Then he doubled it again.<br><\/p>\n\n\n\n<p>If you’re keeping track, he’s now making <em>eight times <\/em>per hour what he was making at his desk job. Imagine how that could change your life.<br><\/p>\n\n\n\n<p>After you’ve got systems in place, you’re finding clients using selling and job hunting as I recommended above, and you’re clipping along, follow the path of some of the most successful freelancers I know and start charging more.<\/p>\n\n\n\n<h2>You’ve got this!<\/h2>\n\n\n\n<p>After years of working closely with thousands of freelancers on my own blog and working for myself on the side and full-time for over a decade, I’ve realized this:<br><\/p>\n\n\n\n<p><em>There are as many different scenarios as there are different freelancers. <\/em><br><\/p>\n\n\n\n<p>But if I had to lump all of that experience together and explain the differences between struggling freelancers and those that are making six figures or more on a regular basis, the advice outlined in this article would be it.<br><\/p>\n\n\n\n<p>A few thoughts before I leave you:<br><\/p>\n\n\n\n<ul><li><strong>Keep an abundance mentality<\/strong>—there are plenty of clients, money, freelance jobs, and opportunities out there to keep you gainfully employed as a freelancer.<\/li><li><strong>Stay positive<\/strong>—no one wants to work with someone who’s disgruntled, rude, pessimistic or unhappy in their own job.<\/li><li><strong>Work hard<\/strong>—I’ve yet to meet a successful freelancer that hasn’t worked very hard to get where they are. I’ve also never met one who said all the work wasn&#8217;t worth it in the end. It’s very worth it.<\/li><\/ul>\n\n\n\n<p>Above all, remember: you’ve got this! Now go out there a keep up the hard work.<br><\/p>\n","protected":false},"excerpt":{"rendered":"<p>You can beat the feast or famine cycle of freelancing by setting your business up for six figures. Read how in this guest post from Preston Lee. <\/p>\n","protected":false},"author":110,"featured_media":10031,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[2,19],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Why Some Freelancers Bring in Big Money While Others Struggle to Find Work<\/title>\n<meta name=\"description\" content=\"It does not seem fair. The truth is, there are a few things that highly successful freelancers are doing that you’re probably not doing.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/workspace.fiverr.com\/blog\/why-some-freelancers-bring-in-big-money-while-others-struggle-to-find-work\/\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"Why Some Freelancers Bring in Big Money While Others Struggle to Find Work\" \/>\n<meta name=\"twitter:description\" content=\"It does not seem fair. The truth is, there are a few things that highly successful freelancers are doing that you’re probably not doing.\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/10vsSYYQ.jpeg\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Preston Lee\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Why Some Freelancers Bring in Big Money While Others Struggle to Find Work","description":"It does not seem fair. The truth is, there are a few things that highly successful freelancers are doing that you’re probably not doing.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/workspace.fiverr.com\/blog\/why-some-freelancers-bring-in-big-money-while-others-struggle-to-find-work\/","twitter_card":"summary_large_image","twitter_title":"Why Some Freelancers Bring in Big Money While Others Struggle to Find Work","twitter_description":"It does not seem fair. The truth is, there are a few things that highly successful freelancers are doing that you’re probably not doing.","twitter_image":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/10vsSYYQ.jpeg","twitter_misc":{"Written by":"Preston Lee","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/workspace.fiverr.com\/#organization","name":"Fiverr","url":"https:\/\/workspace.fiverr.com\/","sameAs":[],"logo":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#logo","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","width":512,"height":512,"caption":"Fiverr"},"image":{"@id":"https:\/\/workspace.fiverr.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/workspace.fiverr.com\/#website","url":"https:\/\/workspace.fiverr.com\/","name":"Fiverr Workspace","description":"","publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/workspace.fiverr.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/blog\/why-some-freelancers-bring-in-big-money-while-others-struggle-to-find-work\/#primaryimage","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/10vsSYYQ.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/10vsSYYQ.jpeg","width":1200,"height":576},{"@type":"WebPage","@id":"https:\/\/workspace.fiverr.com\/blog\/why-some-freelancers-bring-in-big-money-while-others-struggle-to-find-work\/#webpage","url":"https:\/\/workspace.fiverr.com\/blog\/why-some-freelancers-bring-in-big-money-while-others-struggle-to-find-work\/","name":"Why Some Freelancers Bring in Big Money While Others Struggle to Find Work","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/why-some-freelancers-bring-in-big-money-while-others-struggle-to-find-work\/#primaryimage"},"datePublished":"2020-11-25T22:16:30+00:00","dateModified":"2021-11-28T09:51:15+00:00","description":"It does not seem fair. The truth is, there are a few things that highly successful freelancers are doing that you’re probably not doing.","breadcrumb":{"@id":"https:\/\/workspace.fiverr.com\/blog\/why-some-freelancers-bring-in-big-money-while-others-struggle-to-find-work\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/workspace.fiverr.com\/blog\/why-some-freelancers-bring-in-big-money-while-others-struggle-to-find-work\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/workspace.fiverr.com\/blog\/why-some-freelancers-bring-in-big-money-while-others-struggle-to-find-work\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Fiverr Workspace","item":"https:\/\/workspace.fiverr.com\/"},{"@type":"ListItem","position":2,"name":"Why Some Freelancers Bring in Big Money While Others Struggle to Find Work"}]},{"@type":["Article","BlogPosting"],"@id":"https:\/\/workspace.fiverr.com\/blog\/why-some-freelancers-bring-in-big-money-while-others-struggle-to-find-work\/#article","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/blog\/why-some-freelancers-bring-in-big-money-while-others-struggle-to-find-work\/#webpage"},"author":{"@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/93abecc3e7c99b3d39eb331cc36558ae"},"headline":"Why Some Freelancers Bring in Big Money While Others Struggle to Find Work","datePublished":"2020-11-25T22:16:30+00:00","dateModified":"2021-11-28T09:51:15+00:00","mainEntityOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/why-some-freelancers-bring-in-big-money-while-others-struggle-to-find-work\/#webpage"},"wordCount":2149,"publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"image":{"@id":"https:\/\/workspace.fiverr.com\/blog\/why-some-freelancers-bring-in-big-money-while-others-struggle-to-find-work\/#primaryimage"},"thumbnailUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/10vsSYYQ.jpeg","articleSection":["Freelance knowledge","GROWING YOUR BUSINESS"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/93abecc3e7c99b3d39eb331cc36558ae","name":"Preston Lee","image":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cdd223e61a05b88bc936adf70f54ee73?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cdd223e61a05b88bc936adf70f54ee73?s=96&d=mm&r=g","caption":"Preston Lee"},"description":"Preston Lee is the founder of Millo where he and his team help freelancers find remote work so they can live anywhere and do work they love. If you’re ready to take the leap into freelancing, join their community of freelancers at Millo.co.","sameAs":["https:\/\/millo.co\/"]}]}},"_links":{"self":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/6217"}],"collection":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/users\/110"}],"replies":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/comments?post=6217"}],"version-history":[{"count":0,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/6217\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media\/10031"}],"wp:attachment":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media?parent=6217"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/categories?post=6217"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/tags?post=6217"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}