{"id":6666,"date":"2020-11-25T22:16:34","date_gmt":"2019-05-10T20:25:28","guid":{"rendered":"https:\/\/www.and.co\/blog\/?p=6666"},"modified":"2022-01-17T07:04:33","modified_gmt":"2022-01-17T07:04:33","slug":"freelancers-focus-deep-work","status":"publish","type":"post","link":"https:\/\/workspace.fiverr.com\/blog\/freelancers-focus-deep-work\/","title":{"rendered":"5 Ways for Freelancers to Reclaim Their Focus with Deep Work"},"content":{"rendered":"\n<p>As a freelancer, you have no choice but to be a jack of all trades. Between marketing your business, responding to clients, and managing your finances, it’s a 24\/7 grind. <\/p>\n\n\n\n<p>The ability to juggle a million different priorities isn’t just an advantage—it’s a must.<br><\/p>\n\n\n\n<p>But what if all the phone calls, emailing, chatting, texting, and tweeting are actually destroying your ability to focus? According to <a href=\"https:\/\/freedom.to\/blog\/cal-newport-interview\/\">Cal Newport<\/a>, it’s a problem we all face.<br><\/p>\n\n\n\n<p>In his popular book <em><a href=\"https:\/\/www.amazon.com\/Deep-Work-Focused-Success-Distracted\/dp\/1455586692\">Deep Work: Rules for Focused Success in a Distracted World<\/a><\/em>, Newport argues that we’re inundated with “shallow work”—all the small, mindless tasks that don’t require your full attention. Not only does “shallow work” eat up a lot of your precious time; it also shatters your ability to concentrate when you do have time.<br><\/p>\n\n\n\n<p>It’s not only you. Scientists have found that thanks to smartphones, humans now have a shorter attention span <a href=\"https:\/\/www.telegraph.co.uk\/science\/2016\/03\/12\/humans-have-shorter-attention-span-than-goldfish-thanks-to-smart\/\">than goldfish<\/a>. The average person touches their smartphone <a href=\"https:\/\/blog.dscout.com\/mobile-touches\">2,617 times a day<\/a>, and heavy users clock in a whopping 5,427 touches a day.<br><\/p>\n\n\n\n<p>There’s a big difference between being busy and being productive, and for many freelancers and telecommuters, shallow work is something you’re likely drowning in. But the good news is that you can reclaim your focus and tap into unparalleled levels of productivity. Introducing… deep work.<\/p>\n\n\n\n<h2>What is deep work?<\/h2>\n\n\n\n<p>Newport coined the concept of “deep work,” which means focusing all your attention on one task or project, without interruption, for 90 minutes or longer. The key to deep work is eliminating “context shifts”—all the phone calls, notifications, and interruptions that bring your mind back to shallow work.<br><\/p>\n\n\n\n<p>It’s a myth that the human brain can multitask effectively. Researchers at UC Irvine found that the typical office worker is interrupted every three minutes and five seconds. After being interrupted, it takes them an average of <a href=\"https:\/\/www.washingtonpost.com\/news\/inspired-life\/wp\/2015\/06\/01\/interruptions-at-work-can-cost-you-up-to-6-hours-a-day-heres-how-to-avoid-them\/?utm_term=.25be7d1ec7b1\">23 minutes and 15 seconds to regain their focus<\/a>.<br><\/p>\n\n\n\n<p>If your work involves writing, computer programming, creating, or intense problem solving, you can’t afford to lose hours every day to these interruptions and context shifts. Deep work helps you reach the coveted <a href=\"https:\/\/www.ted.com\/talks\/mihaly_csikszentmihalyi_on_flow\">state of flow<\/a>, which not only boosts your productivity; psychologist Mihaly Csikszentmihalyi says it’s the true key to happiness.<\/p>\n\n\n\n<p><em>Related: <a href=\"https:\/\/workspace.fiverr.com\/blog\/6-unexpected-productivity-tips-for-freelancers-inspired-by-ted-talks\/\">6 Unexpected Productivity Tips for Freelancers (Inspired by TED Talks)<\/a><\/em><\/p>\n\n\n\n<h2>Why is deep work important for a freelancer or remote worker?<\/h2>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>“The market does not reward you for being busy. It rewards you for producing things that are rare and valuable. This requires depth.”<br><\/p><cite>&#8211; Cal Newport<\/cite><\/blockquote>\n\n\n\n<p>Distractions may be already harming your performance more than you realize. Anecdotally, Newport found that most people experience a<a href=\"https:\/\/time.com\/4817946\/brain-games-distraction-attention\/\"> 50% drop in productivity<\/a> and cognitive capacity when they’re multi-tasking and in a state of distraction.<br><\/p>\n\n\n\n<p>In this era of connectivity and distractibility, a person who can concentrate has an incredible advantage. Your career won’t be built by going to lots of meetings, responding to messages, and clearing your inbox; it will come from devoting long, hard hours to cognitively demanding work. <\/p>\n\n\n\n<p>“The true scarce commodity of the future will be <a href=\"https:\/\/www.nytimes.com\/2016\/01\/22\/opinion\/the-eight-second-attention-span.html\">human attention<\/a>,” said Satya Nadella, the CEO of Microsoft.<\/p>\n\n\n\n<p><em>More: <a href=\"https:\/\/workspace.fiverr.com\/blog\/how-working-from-home-can-actually-increase-your-productivity\/\">How Working From Home Makes You More Productive<\/a><\/em><\/p>\n\n\n\n<h2>5 ways to practice deep work<\/h2>\n\n\n\n<p>So how do you do deep work? If the thought of disconnecting from your phone and trying to focus for 90 minutes sends you into a cold sweat, don’t worry. Deep work is actually a skill, not an inherent ability, and like any skill, it’s something you can work to improve.<\/p>\n\n\n\n<h3>1. &nbsp;Make it a ritual<\/h3>\n\n\n\n<p>One key to deep work is ritualizing it. Find a spot you like, whether it’s in a coffee shop or library, and designate that as where you’ll complete all your deep work. Although anywhere too noisy will definitely hamper your ability to concentrate, a moderate level of ambient noise actually <a href=\"https:\/\/www.jstor.org\/stable\/10.1086\/665048?seq=1&amp;version=meter+at+2&amp;module=meter-Links&amp;pgtype=Blogs&amp;mediaId=%25%25ADID%25%25&amp;priority=true&amp;action=click&amp;contentCollection=meter-links-click\">boosts creativity<\/a>. It also helps to be around other people who are working: one study suggests that <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/26265430\">mental effort is contagious<\/a>.<br><\/p>\n\n\n\n<p>Ritualizing your deep work is important for two reasons. First of all, doing the same thing at the same time in the same place will act as a trigger to your brain that it’s time to buckle down and focus. Positive psychology experts note that rituals “<a href=\"https:\/\/www.fastcompany.com\/3049175\/how-to-harness-the-power-of-rituals-to-improve-your-work\">shape the way our brains are feeling<\/a>, thinking, and acting,” and signal that it’s time for a specific mindset or activity.<br><\/p>\n\n\n\n<p>What’s more, research shows that we all have only a finite amount of energy, and <a href=\"https:\/\/faculty.washington.edu\/jdb\/345\/345%20Articles\/Baumeister%20et%20al.%20(1998).pdf\">making decisions is exhausting<\/a>. As a freelancer, that’s probably no news to you. It’s called “ego depletion.” Even making small decisions, such as choosing where and when you’ll work, takes willpower. If you choose the same spot and time every time, you can eliminate decision-making and save your focus for where it’s needed.<\/p>\n\n\n\n<h3>2. Block off time<\/h3>\n\n\n\n<p>Be proactive with your schedule and decide what your ideal deep-to-shallow-ratio should be. Daily planning may be mundane, but it’s the only effective way to make sure you’ll accomplish all that is important.<br><\/p>\n\n\n\n<p>Choose how much time you can devote to deep work. Every day? Twice a week? Set an ambitious yet attainable goal. Block off those hours in your calendar, and then schedule your shallow work—checking email, making phone calls, reading the news—around that. <em>4-Hour Workweek<\/em> author Tim Ferriss only checks his <a href=\"https:\/\/www.fastcompany.com\/3030999\/what-i-learned-from-checking-email-only-twice-a-day\">email twice a day<\/a> during designated times and has popularized the idea that you can boost your productivity quite dramatically by not being available 24 hours a day.<br><\/p>\n\n\n\n<p>Be protective of your deep work and treat it like you would a doctor’s appointment or important meeting. Newport also advocates keeping a scoreboard where you tally how many hours of deep work you perform each week. It’s an easy and visual way to keep track of where you stand and stay motivated to focus on what’s important. Is your tally not as high as you’d like it to be? Adjust your schedule accordingly.<br><\/p>\n\n\n\n<h3>3. Use distraction-blocking software<\/h3>\n\n\n\n<p>At first, deep work might be hard. Really hard. Staring into space, alone with only your thoughts, you may find yourself positively itching to check your phone. This craving is very real: many psychologists compare the age of connectivity to “<a href=\"https:\/\/www.psychologytoday.com\/blog\/virtual-addictions\/201710\/digital-distraction-internet-and-smartphone-addiction\">the world’s largest slot machine<\/a>.”<br><\/p>\n\n\n\n<p>When you go online or check your phone, you don’t know what you’re going to see and how pleasurable it will be. Whenever you get an email, notification, or “like,” your brain interprets this as a “digital reward” and releases dopamine. Dopamine has been called the <a href=\"https:\/\/www.slate.com\/articles\/health_and_science\/science\/2013\/07\/what_is_dopamine_love_lust_sex_addiction_gambling_motivation_reward.html\">Kim Kardashian of neurotransmitters<\/a>, linked with all your most sinful behaviors and impulses. But more accurately, dopamine signals feedback for a predicted reward. Dopamine itself doesn’t make you feel good, but it’s what makes you seek out pleasure.<br><\/p>\n\n\n\n<p>Don’t underestimate the addictiveness of this feedback loop. <a href=\"https:\/\/www.psychologytoday.com\/blog\/brain-wise\/201311\/use-unpredictable-rewards-keep-behavior-going\">Intermittent reinforcemen<\/a>t is well known to be the most powerful motivator on the planet. This is true for any kind of information you compulsively check, whether it’s the news, stocks, or sports. The unpredictability has you hooked.<br><\/p>\n\n\n\n<p>Why rely on willpower alone? It’s a finite resource, and you are up against a real addiction. Regain control over your behavior by using an app and website blocker such as <a href=\"https:\/\/freedom.to\/\">Freedom<\/a>. It allows you to block whatever apps or sites you choose both on your phone and computer.<\/p>\n\n\n\n<p>While you’re in the midst of deep work, it will prevent you from even unconsciously going on autopilot and scrolling through Facebook. Perhaps more importantly, use Freedom even when you’re not practicing deep work to break that addictive rewards cycle and build healthier behaviors.<\/p>\n\n\n\n<p><em>Related: <a href=\"https:\/\/workspace.fiverr.com\/blog\/best-chrome-extensions-productivity-freelancer\/\">14 Chrome Extensions to Increase Your Productivity<\/a><\/em><\/p>\n\n\n\n<h3>4. Cut down on (or quit!) social media<\/h3>\n\n\n\n<p>It’s a well-documented fact that in addition to being a huge time-suck, <a href=\"https:\/\/www.newyorker.com\/tech\/elements\/how-facebook-makes-us-unhappy\">Facebook makes people unhappy<\/a>. It’s full of stimuli that are all competing for our attention: sensational headlines, political clickbait, adorable puppies, and honeymoon photos of people you barely know. The more stuff you have to filter through, the less you are able to meaningfully engage with any of it. Most people spend far more time passively scrolling through social content than they do engaging with it, and passive experiences translate to feelings of disconnection and discontent.<\/p>\n\n\n\n<p>Newport takes an extreme approach and eschews all forms of social media. But it doesn’t have to be all or nothing thing. You can strive to make social media a controlled habit by scheduling when you’ll check it, doing so only a few times a week, and doing it from a desktop or laptop. (“The most devastatingly effective psychological exploitations are baked into the phone apps,” Newport says.)<br><\/p>\n\n\n\n<p>Do you have a critical deadline? Are you ready for a more intense detox? Take a total social media hiatus. Every year before the NBA playoffs, superstar LeBron James sends out a <a href=\"https:\/\/www.cbssports.com\/nba\/news\/steph-curry-like-lebron-james-taking-break-from-social-media-for-nba-playoffs\/\">“Zero Dark Thirty-23”<\/a> tweet, signaling that he’s taking a break to avoid unnecessary distractions. His hashtag #StrivingForGreatness says it all, doesn&#8217;t it? Two-time reigning MVP award winner Steph Curry has followed suit: “I’m not reinventing the wheel. It’s just a way to help me keep my focus on what’s important.”<\/p>\n\n\n\n<h3>5. Be patient<\/h3>\n\n\n\n<p>Deep work is about rewiring your brain, and it’s a process that takes time, practice, and discipline. Think of it like building muscle or physical strength. Most people couldn’t wake up tomorrow and run a marathon. Instead, you’d have to commit to a long training schedule where you gradually increase mileage and build up endurance. The same goes for deep work. If you find it hard to focus the first few times, don’t lose heart. Keep at it. You’ll get better, and in time, you’ll start to reap the rewards.<br><\/p>\n\n\n\n<p>Being patient also means embracing boredom. Next time you’re standing in line at the grocery store, resist the urge to whip out your phone. Instead, be there in the moment, and let your mind wander. You don’t need to be stimulated all the time. There’s actually a well-established <a href=\"https:\/\/qz.com\/1020976\/the-scientific-link-between-boredom-and-creativity\/\">scientific link between boredom and creativity<\/a>, and every time you resist the urge to check your email, you give your brain the chance to rest and reset.<\/p>\n\n\n\n<h2>Razor-sharp focus is yours for the taking<\/h2>\n\n\n\n<p>Whether you’re a freelancer, telecommuter, or remote worker, there’s no question that it can be hard to stay focused. But those who do have an incredible competitive advantage, and it’s your prerogative to find ways to produce work that stands out. Deep work is an amazing weapon to have in your arsenal.<br><\/p>\n\n\n\n<p>You don’t have to tell people you’re practicing deep work, but it can help to declare it, especially to those who are accustomed to having constant access to your attention. (You don’t want your mom to panic when she can’t reach you.) <\/p>\n\n\n\n<p>You’ll probably find that people will be supportive, and you might even inspire others to follow suit. With a little preparation and a lot of hard work, you can reclaim your ability to concentrate and focus on what matters most.<br><\/p>\n","protected":false},"excerpt":{"rendered":"<p>We share 5 practical strategies that freelancers can use to stay focused and get more done, using deep work. <\/p>\n","protected":false},"author":44,"featured_media":10469,"comment_status":"closed","ping_status":"closed","sticky":true,"template":"","format":"standard","meta":[],"categories":[6],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>5 Ways for Freelancers to Reclaim Their Focus with Deep Work<\/title>\n<meta name=\"description\" content=\"In this article, we share 5 practical strategies that freelancers can use to stay focused and get more done, using deep work. Read more here.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/workspace.fiverr.com\/blog\/freelancers-focus-deep-work\/\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"5 Ways for Freelancers to Reclaim Their Focus with Deep Work\" \/>\n<meta name=\"twitter:description\" content=\"In this article, we share 5 practical strategies that freelancers can use to stay focused and get more done, using deep work. Read more here.\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/8-ud0_jg.png\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Freedom\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"5 Ways for Freelancers to Reclaim Their Focus with Deep Work","description":"In this article, we share 5 practical strategies that freelancers can use to stay focused and get more done, using deep work. Read more here.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/workspace.fiverr.com\/blog\/freelancers-focus-deep-work\/","twitter_card":"summary_large_image","twitter_title":"5 Ways for Freelancers to Reclaim Their Focus with Deep Work","twitter_description":"In this article, we share 5 practical strategies that freelancers can use to stay focused and get more done, using deep work. Read more here.","twitter_image":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/8-ud0_jg.png","twitter_misc":{"Written by":"Freedom","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/workspace.fiverr.com\/#organization","name":"Fiverr","url":"https:\/\/workspace.fiverr.com\/","sameAs":[],"logo":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#logo","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","width":512,"height":512,"caption":"Fiverr"},"image":{"@id":"https:\/\/workspace.fiverr.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/workspace.fiverr.com\/#website","url":"https:\/\/workspace.fiverr.com\/","name":"Fiverr Workspace","description":"","publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/workspace.fiverr.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/blog\/freelancers-focus-deep-work\/#primaryimage","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/8-ud0_jg.png","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/8-ud0_jg.png","width":1200,"height":576},{"@type":"WebPage","@id":"https:\/\/workspace.fiverr.com\/blog\/freelancers-focus-deep-work\/#webpage","url":"https:\/\/workspace.fiverr.com\/blog\/freelancers-focus-deep-work\/","name":"5 Ways for Freelancers to Reclaim Their Focus with Deep Work","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/freelancers-focus-deep-work\/#primaryimage"},"datePublished":"2019-05-10T20:25:28+00:00","dateModified":"2022-01-17T07:04:33+00:00","description":"In this article, we share 5 practical strategies that freelancers can use to stay focused and get more done, using deep work. Read more here.","breadcrumb":{"@id":"https:\/\/workspace.fiverr.com\/blog\/freelancers-focus-deep-work\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/workspace.fiverr.com\/blog\/freelancers-focus-deep-work\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/workspace.fiverr.com\/blog\/freelancers-focus-deep-work\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Fiverr Workspace","item":"https:\/\/workspace.fiverr.com\/"},{"@type":"ListItem","position":2,"name":"5 Ways for Freelancers to Reclaim Their Focus with Deep Work"}]},{"@type":["Article","BlogPosting"],"@id":"https:\/\/workspace.fiverr.com\/blog\/freelancers-focus-deep-work\/#article","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/blog\/freelancers-focus-deep-work\/#webpage"},"author":{"@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/1204e4b3cd55a112d340d0278ab9de86"},"headline":"5 Ways for Freelancers to Reclaim Their Focus with Deep Work","datePublished":"2019-05-10T20:25:28+00:00","dateModified":"2022-01-17T07:04:33+00:00","mainEntityOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/freelancers-focus-deep-work\/#webpage"},"wordCount":1878,"publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"image":{"@id":"https:\/\/workspace.fiverr.com\/blog\/freelancers-focus-deep-work\/#primaryimage"},"thumbnailUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/8-ud0_jg.png","articleSection":["Inspiration"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/1204e4b3cd55a112d340d0278ab9de86","name":"Freedom","image":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/be5186b01eb5b953a73b740a5f4cf4ff?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/be5186b01eb5b953a73b740a5f4cf4ff?s=96&d=mm&r=g","caption":"Freedom"},"description":"Freedom lets you block distracting websites and apps across all of your devices so you can focus on what matters most."}]}},"_links":{"self":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/6666"}],"collection":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/users\/44"}],"replies":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/comments?post=6666"}],"version-history":[{"count":0,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/6666\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media\/10469"}],"wp:attachment":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media?parent=6666"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/categories?post=6666"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/tags?post=6666"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}