{"id":6675,"date":"2020-11-25T22:16:34","date_gmt":"2019-05-22T01:17:18","guid":{"rendered":"https:\/\/www.and.co\/blog\/?p=6675"},"modified":"2022-01-23T08:22:44","modified_gmt":"2022-01-23T08:22:44","slug":"find-freelance-clients-instagram","status":"publish","type":"post","link":"https:\/\/workspace.fiverr.com\/blog\/find-freelance-clients-instagram\/","title":{"rendered":"How to Find Freelance Clients Using Instagram"},"content":{"rendered":"\n<p>Social media marketing is a powerful strategy that can help you expand your reach as a freelancer. <\/p>\n\n\n\n<p>Instagram, in particular, can be a great platform to expand your digital presence for your business and connect with current and potential clients.  <\/p>\n\n\n\n<p>With its highly visual focus, Instagram can be a great way to capture the attention of those in your niche, particularly if you work in the creative fields. You can use it as an unconventional portfolio, helping to showcase your work and grow your audience.<br><\/p>\n\n\n\n<p>If you&#8217;re yet to make use of Instagram for finding freelance clients, let’s make sure that you are set up for success with a few simple tips for your presence and outreach.<\/p>\n\n\n\n<h2>Make sure your profile is A+<\/h2>\n\n\n\n<p>Before reaching out to potential clients, it’s important to make sure that your profile showcases your work and establishes your credibility in your industry.<\/p>\n\n\n\n<h3>The basics<\/h3>\n\n\n\n<p>Let’s make sure that you’ve covered the basics in regards to your profile.<br><\/p>\n\n\n\n<p>Your account should be <a href=\"https:\/\/learn.g2crowd.com\/instagram-business-profile\">registered as an Instagram business profile<\/a>. Not only does this change provide your profile with a tag that indicates you&#8217;re using this profile professionally, but it also provides insight into the analytics behind your accounts.<br><\/p>\n\n\n\n<p>Along with this, it should go without saying that you should make sure that your posts are kept professional on this page. The pictures you take when you&#8217;re out with your friends may be great, but they don’t belong on your business profile. Create a personal profile to share this content.<br><\/p>\n\n\n\n<p>Finally, make sure that your bio section and your profile picture accurately reflect your offerings. Your bio will be what people see and read before looking at your posts, so it should quickly explain your qualifications and services. Your profile picture should be professional, so consider using a headshot or your logo.<br><\/p>\n\n\n\n<p>Check out this denim painter’s Instagram bio. She keeps her information short and to the point, so if someone glances over profile they can easily understand the basics of her business.<\/p>\n\n\n\n<h3>Your feed<\/h3>\n\n\n\n<p>The next step is to make sure your feed is worth following. Gaining and retaining followers is dependent on publishing content others will enjoy.<br><\/p>\n\n\n\n<p>Your feed should be cohesive but original. Choose a few different types of posts and vary them throughout your feed. Use one filter, or custom preset, for all your posts to ensure that the look of your profile stays consistent.<\/p>\n\n\n\n<p>Illustrator <a href=\"https:\/\/www.instagram.com\/melanie.johnsson\/\">Melanie Johnsson<\/a>maintains a consistent color palette in her feed, which includes a mix of illustrations and photographs<em>.<\/em><\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img width=\"537\" height=\"639\" src=\"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/10\/Freelancers-on-Instagram.png\" alt=\"\" class=\"wp-image-9803\" srcset=\"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/10\/Freelancers-on-Instagram.png 537w, https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/10\/Freelancers-on-Instagram-252x300.png 252w\" sizes=\"(max-width: 537px) 100vw, 537px\" \/><figcaption><br><\/figcaption><\/figure><\/div>\n\n\n\n<h3>Be authentic<\/h3>\n\n\n\n<p>If you plan to use Instagram as a platform to source new business, people need to trust you. The first step to gaining trust is to make sure that your profile looks authentic. <\/p>\n\n\n\n<p>To give followers an insight into you, you might like to share some images of your workspace alongside your work, like<strong> <\/strong>freelance illustrator <a href=\"https:\/\/www.instagram.com\/caglazimmermann\/\">Cagla Zimmermann<\/a> does.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><a href=\"https:\/\/www.instagram.com\/p\/Bxm76dwH1rV\/\" target=\"_blank\" rel=\"noreferrer noopener\"><img width=\"925\" height=\"593\" src=\"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/10\/Cagla-Zimmermann.png\" alt=\"\" class=\"wp-image-9802\" srcset=\"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/10\/Cagla-Zimmermann.png 925w, https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/10\/Cagla-Zimmermann-300x192.png 300w, https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/10\/Cagla-Zimmermann-768x492.png 768w\" sizes=\"(max-width: 925px) 100vw, 925px\" \/><\/a><\/figure>\n\n\n\n<p>Alongside this, make sure that you have a real following behind your account—don’t buy your following. Engagement with a bought following is notoriously low, so in order to have the best post performance, an authentic following is your best bet. <\/p>\n\n\n\n<p>To build up your account following, you can use organic methods like using relevant hashtags on your posts and following people who share your interests. When you do end up pitching your services over Instagram, having a natural following helps to further establish your credibility.<\/p>\n\n\n\n<p>Be sure to engage with your following by responding to comments to enhance your authenticity and ensure your followers stick around. <\/p>\n\n\n\n<h2>All about posts &amp; posting<\/h2>\n\n\n\n<p>In order to find freelance clients through Instagram, you need to develop a strategy behind your posts, to establish credibility and regularly engage your audience.<\/p>\n\n\n\n<h3>Types of posts<\/h3>\n\n\n\n<p>There are three ways to publish organic content on Instagram—standard posts, Instagram stories, and Instagram Live—and there are benefits to using each in your strategy for finding freelance clients. <\/p>\n\n\n\n<h4>Standard posts<\/h4>\n\n\n\n<p>When someone looks at your profile to decide whether to follow you or choose you as a business partner, they will evaluate the posts on your page. Instagram profile posts are the best way to establish your authority in your industry. <br><\/p>\n\n\n\n<p>Use Instagram posts to show off your work and create a connection with your audience. If your services are visual-based, make sure to highlight the best work you’ve done for clients through your posts. <\/p>\n\n\n\n<p><a href=\"https:\/\/www.instagram.com\/connernesbit\/\">Leuca Floral,<\/a> a freelance florist based out of Utah, does an admirable job of displaying his floral arrangements on Instagram. By using high-quality photos, his expertise is presented for his followers to see.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><a href=\"https:\/\/www.instagram.com\/p\/BrnSHcFg8j7\/\" target=\"_blank\" rel=\"noreferrer noopener\"><img width=\"807\" height=\"593\" src=\"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/10\/Leuca-Floral.png\" alt=\"\" class=\"wp-image-9801\" srcset=\"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/10\/Leuca-Floral.png 807w, https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/10\/Leuca-Floral-300x220.png 300w, https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/10\/Leuca-Floral-768x564.png 768w\" sizes=\"(max-width: 807px) 100vw, 807px\" \/><\/a><\/figure>\n\n\n\n<p>Instagram gives you a platform where it&#8217;s entirely appropriate to share your personal projects as well as professional ones—so if there&#8217;s something you&#8217;ve always wanted to create, go for it.<\/p>\n\n\n\n<p>Do try to vary your content as well—your profile should serve as more than just a regurgitation of the work you produce. Find ways to provide additional value to your target audience. <\/p>\n\n\n\n<h4>Instagram Stories<\/h4>\n\n\n\n<p>Using Instagram Stories is a great way to provide temporary posts and further the connection between you and your followers. There are a lot of customization features in Instagram Stories, from tagging a location or user, to adding a gif or sharing a poll.<br><\/p>\n\n\n\n<p>The way that you customize your Instagram Stories is completely up to you. You can use them to further educate your clients about the work you do, give a behind-the-scenes tour, or ask questions about the content you’re already producing. Stories can be a good way to expand your presence on the platform and keep your profile top of mind once you already have a following.<\/p>\n\n\n\n<h4>Instagram Live <\/h4>\n\n\n\n<p>Instagram Live is a feature on the app that allows you to record video live and have followers tune in. This type of Instagram content is great for educating your following and having Q&amp;A sessions. When you go live, make sure that you’re furthering your authority in your industry by providing information that is beneficial to your following. <br><\/p>\n\n\n\n<p>Don’t surprise your following with an Instagram Live. Make sure they know about it beforehand by using normal posts and Stories to build hype. You want to have a large audience watching in order to get the maximum benefit.  <br><\/p>\n\n\n\n<h3>Diving into your posts<\/h3>\n\n\n\n<p>There are a few other aspects of posting, beyond your actual posts, that can help set up your profile for success in finding freelance clients on Instagram. <\/p>\n\n\n\n<h4>Captions<\/h4>\n\n\n\n<p>Captions provide another opportunity for you to dive deeper into your posts. You can use your captions to add to the image and engage your audience by providing insight into your work. Make sure that the copy of your caption provokes conversation or likes by asking a question or asking for your audience to share their thoughts.<\/p>\n\n\n\n<p>UX Designer <a href=\"https:\/\/www.instagram.com\/informationlovers\/\">Katharina Clasen<\/a> shares engaging and informative tips with her followers, and asks for their input too. <\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><a href=\"https:\/\/www.instagram.com\/p\/BvpGrHshNFx\/\"><img width=\"921\" height=\"587\" src=\"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/10\/Information-Lovers-on-Instagram.png\" alt=\"\" class=\"wp-image-9800\" srcset=\"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/10\/Information-Lovers-on-Instagram.png 921w, https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/10\/Information-Lovers-on-Instagram-300x191.png 300w, https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/10\/Information-Lovers-on-Instagram-768x489.png 768w\" sizes=\"(max-width: 921px) 100vw, 921px\" \/><\/a><\/figure><\/div>\n\n\n\n<h4>Hashtag Etiquette<\/h4>\n\n\n\n<p>The days of using every hashtag under the sun are gone. You need to use hashtags strategically to help get your content in front of the right people at the right time. &nbsp;<br><\/p>\n\n\n\n<p>Do research on Instagram to see which hashtags your desired clients are likely to be using or following, and start incorporating those in order to be found. Keep in mind that if a hashtag has over 1 million posts you’re not likely to be found if you use it.<br><\/p>\n\n\n\n<p>A great way to use hashtags is to find people to follow. If you’re focusing on local clients, you can find accounts by searching # + (your nearest big city) + (your industry). See what’s being posted under this hashtag and how you can help these accounts in their goals.<br><\/p>\n\n\n\n<h4>Post often &amp; at the right time<\/h4>\n\n\n\n<p>In order to stay relevant for your followers and have a higher chance of conversion, it’s important to stay active on the platform. Post often, but not too often—no more than once a day—in order to build out your profile and establish your Instagram presence.<br><\/p>\n\n\n\n<p>Active posting helps keep your brand relevant in the minds of your followers. You want to make sure they are familiar with you before you reach out.<br><\/p>\n\n\n\n<p>To ensure the best performance, you also need to make sure to post at the right time. There are general guidelines as to when is the best time to post, but your Instagram business account also allows you to see when your followers are most active. Use this information when planning posts.<\/p>\n\n\n\n<p>Managing your social media may seem like a daunting task, but <a href=\"https:\/\/www.g2.com\/categories\/social-media-mgmt\">social media management tools<\/a> can centralize your accounts in order to plan posts ahead of time.<br><\/p>\n\n\n\n<h2>Find your niche &amp; engage<\/h2>\n\n\n\n<p>Social media provides many opportunities to engage in smaller communities which can help you identify prospects when searching for freelance clients on Instagram. Finding your targeted niche and engaging with them early on will help establish a sense of familiarity and trust between you and them.<br><\/p>\n\n\n\n<p>To find your potential clients, utilize the search feature with keywords and hashtags to find accounts. Do a quick analysis of their page and see if they would be a business that could benefit from your services. If they would, follow them and start slowly engaging with their profile. <br><\/p>\n\n\n\n<p>Finding, following, and engaging with your community will help ensure your cold pitch will have a softer landing when you send it. Remember, your goal is to help your clients, so make sure your profile already provides content that offers value to them. <br><\/p>\n\n\n\n<p>Engaging with your following is crucial since you also want them to <a href=\"https:\/\/later.com\/blog\/how-to-increase-instagram-engagement\/\">engage with you<\/a>, but it’s important to make sure that you don’t come off as obsessive—you don’t want your future clients to be turned off before you even reach out. Comment naturally and like posts. Your engagement should help reinforce that you aren’t a stranger to your future clients when you send your cold pitch.<\/p>\n\n\n\n<h2>Slide into the DM’s &amp; send your pitch<\/h2>\n\n\n\n<p>Clients aren&#8217;t going to fall into your lap. The best way to find freelance clients on Instagram is to reach out to your followers who could benefit from your services.<br><\/p>\n\n\n\n<p>When reaching out over Instagram, try to keep your message short, conversational, and professional all at the same time. It’s unlikely that people will read your entire message so keep it to the point. <\/p>\n\n\n\n<p>Customize your message to fit for your industry, but a good starting point could sound something like this: <br><\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><em>“Hey! <\/em>😊 <em>Thanks for following along. I’d love to chat about how I can help you with __. I’ve specialized in ____ &nbsp;for __ year s and have worked with ____ <\/em><strong>(name businesses or reference a specific group here)<\/strong>.<em> Check out my Insta feed—I’ve highlighted some of my work there! Can I send you some more information?”<\/em><br><\/p><\/blockquote>\n\n\n\n<p>It’s to your benefit to spend some time preparing a script to send when reaching out over Instagram DMs, and test out variations. But leave some room for personalization so you can show that you care about helping your followers, not just looking for another dollar. You’re likely not the first business to reach out, so make sure that you are fully prepared to ask any follow-up questions, such as how your services are priced and if you offer different lengths of contracts. <\/p>\n\n\n\n<p>As important as your message is, if it’s sent at the wrong time it’s not going to help convert a potential client. I recommend following a user for a minimum of a week and engaging with their content before sending over a message. As long as the user is active on Instagram, this will provide enough time for you to become recognizable to them. <\/p>\n\n\n\n<p>If they don’t respond, don’t worry—sometimes people take a break from social media or simply have a busy inbox. You should follow up with top priority clients three to six days later. Keep your follow up message short but more conversational.<br><\/p>\n\n\n\n<h3>Make the most of your Instagram<\/h3>\n\n\n\n<p>Most of your potential clients are already using Instagram for their business. Your Instagram profile can help you expand your reach and provide a new channel from which to source work. <br><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Instagram is a great platform to expand your digital presence for your business. Use your profile as an unconventional portfolio to land more clients.<\/p>\n","protected":false},"author":12,"featured_media":9796,"comment_status":"closed","ping_status":"closed","sticky":true,"template":"","format":"standard","meta":[],"categories":[19],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to Find Freelance Clients Using Instagram<\/title>\n<meta name=\"description\" content=\"Instagram is a great platform to expand your digital presence for your business. Use your profile as an unconventional portfolio to land more clients.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/workspace.fiverr.com\/blog\/find-freelance-clients-instagram\/\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"How to Find Freelance Clients Using Instagram\" \/>\n<meta name=\"twitter:description\" content=\"Instagram is a great platform to expand your digital presence for your business. Use your profile as an unconventional portfolio to land more clients.\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/Header-Image_unlimited.jpg\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Anastasia Masters\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How to Find Freelance Clients Using Instagram","description":"Instagram is a great platform to expand your digital presence for your business. Use your profile as an unconventional portfolio to land more clients.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/workspace.fiverr.com\/blog\/find-freelance-clients-instagram\/","twitter_card":"summary_large_image","twitter_title":"How to Find Freelance Clients Using Instagram","twitter_description":"Instagram is a great platform to expand your digital presence for your business. Use your profile as an unconventional portfolio to land more clients.","twitter_image":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/Header-Image_unlimited.jpg","twitter_misc":{"Written by":"Anastasia Masters","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/workspace.fiverr.com\/#organization","name":"Fiverr","url":"https:\/\/workspace.fiverr.com\/","sameAs":[],"logo":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#logo","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","width":512,"height":512,"caption":"Fiverr"},"image":{"@id":"https:\/\/workspace.fiverr.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/workspace.fiverr.com\/#website","url":"https:\/\/workspace.fiverr.com\/","name":"Fiverr Workspace","description":"","publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/workspace.fiverr.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/blog\/find-freelance-clients-instagram\/#primaryimage","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/Header-Image_unlimited.jpg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/Header-Image_unlimited.jpg","width":1200,"height":576},{"@type":"WebPage","@id":"https:\/\/workspace.fiverr.com\/blog\/find-freelance-clients-instagram\/#webpage","url":"https:\/\/workspace.fiverr.com\/blog\/find-freelance-clients-instagram\/","name":"How to Find Freelance Clients Using Instagram","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/find-freelance-clients-instagram\/#primaryimage"},"datePublished":"2019-05-22T01:17:18+00:00","dateModified":"2022-01-23T08:22:44+00:00","description":"Instagram is a great platform to expand your digital presence for your business. Use your profile as an unconventional portfolio to land more clients.","breadcrumb":{"@id":"https:\/\/workspace.fiverr.com\/blog\/find-freelance-clients-instagram\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/workspace.fiverr.com\/blog\/find-freelance-clients-instagram\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/workspace.fiverr.com\/blog\/find-freelance-clients-instagram\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Fiverr Workspace","item":"https:\/\/workspace.fiverr.com\/"},{"@type":"ListItem","position":2,"name":"How to Find Freelance Clients Using Instagram"}]},{"@type":["Article","BlogPosting"],"@id":"https:\/\/workspace.fiverr.com\/blog\/find-freelance-clients-instagram\/#article","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/blog\/find-freelance-clients-instagram\/#webpage"},"author":{"@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/12882eed221dfc437bdafc3cb324b29d"},"headline":"How to Find Freelance Clients Using Instagram","datePublished":"2019-05-22T01:17:18+00:00","dateModified":"2022-01-23T08:22:44+00:00","mainEntityOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/find-freelance-clients-instagram\/#webpage"},"wordCount":2053,"publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"image":{"@id":"https:\/\/workspace.fiverr.com\/blog\/find-freelance-clients-instagram\/#primaryimage"},"thumbnailUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/Header-Image_unlimited.jpg","articleSection":["GROWING YOUR BUSINESS"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/12882eed221dfc437bdafc3cb324b29d","name":"Anastasia Masters","image":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/5440c8bf2ef46afe5ad5a4201736677d?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/5440c8bf2ef46afe5ad5a4201736677d?s=96&d=mm&r=g","caption":"Anastasia Masters"},"description":"Anastasia Masters is a Content Marketing Associate at G2 Crowd. Hailing from Michigan, she graduated from the University of Michigan with a degree in history. In her spare time, Anastasia enjoys eating her way through Chicago's different neighborhoods, exploring new places to visit across the globe, and watching the Chicago Cubs."}]}},"_links":{"self":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/6675"}],"collection":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/users\/12"}],"replies":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/comments?post=6675"}],"version-history":[{"count":0,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/6675\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media\/9796"}],"wp:attachment":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media?parent=6675"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/categories?post=6675"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/tags?post=6675"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}