{"id":6765,"date":"2020-11-25T22:16:35","date_gmt":"2019-06-24T03:11:33","guid":{"rendered":"https:\/\/www.and.co\/blog\/?p=6765"},"modified":"2021-12-27T14:58:15","modified_gmt":"2021-12-27T14:58:15","slug":"start-freelance-writing","status":"publish","type":"post","link":"https:\/\/workspace.fiverr.com\/blog\/start-freelance-writing\/","title":{"rendered":"How to Start Freelance Writing (Everything You Need to Know)"},"content":{"rendered":"\n<p>On the surface, getting started in freelance writing seems so simple…<\/p>\n\n\n\n<ul><li>Have writing skills.<\/li><li>Find companies willing to pay you.<\/li><li>Reach out to them and get gigs.<\/li><li>Make millions.<\/li><\/ul>\n\n\n\n<p>Sweet! You can stop reading this post now 😉 Go get clients!<\/p>\n\n\n\n<p><em>Just kidding.<\/em><\/p>\n\n\n\n<p>As you’ve probably found out, <strong>finding new writing clients and booking paid gigs is NEVER that easy—especially when you’re brand new, have no portfolio, and don’t have a network to tap into.<\/strong><\/p>\n\n\n\n<p>It’s tough—but not&nbsp;<em>impossible.<\/em><\/p>\n\n\n\n<p>With the tools and tactics in this guide (and a bit of hustle), you’ll be able to grab your first paying client in no time.<\/p>\n\n\n\n<p>You ready?<\/p>\n\n\n\n<p>Let’s write. ✏️<\/p>\n\n\n\n<hr class=\"wp-block-separator\"\/>\n\n\n\n<p class=\"has-text-align-center\"><strong>Jump to:<\/strong><\/p>\n\n\n\n<ol><li><a href=\"#homebase\">Create a &#8220;home base&#8221; to show off your work (to potential clients)<\/a><\/li><li><a href=\"#getpublished\">How to start building a portfolio ASAP<\/a><\/li><li><a href=\"#pitching\">How to pitch for freelance writing opportunities (both free &amp; paid!)<\/a><\/li><li><a href=\"#overdeliver\">Three tips for overdelivering value for your first client (and why it&#8217;s vital)<\/a><\/li><li><a href=\"#referrals\">How to appropriately ask for referrals<\/a><\/li><li><a href=\"#findcompanies\">How to specifically find companies who will pay you to freelance write<\/a><\/li><li><a href=\"#system\">Organize your &#8220;freelance system&#8221;<\/a><\/li><li><a href=\"#second\">BONUS: How to land your second freelance client<\/a><\/li><\/ol>\n\n\n\n<hr class=\"wp-block-separator\"\/>\n\n\n\n<h2>First, You Need to Understand What Freelance Writing Actually Looks Like<\/h2>\n\n\n\n<p>If you’re new to freelance writing, don’t skip this step.<\/p>\n\n\n\n<p>What you’re about to read could save you hours of time (and a lot of frustration).<\/p>\n\n\n\n<p><strong>Producing content for money is work! It’s not always easy, and it won’t always pay thousands of dollar per post. It’ll also take a while to ramp up your clients and earnings.<\/strong><\/p>\n\n\n\n<p>It’s crucial that you manage your expectations.<\/p>\n\n\n\n<p>Even with this guide, it’ll still take hours of hard work to land a client, and then you’ll have to, ya know,&nbsp;<em>do the work<\/em>&nbsp;for your clients.<\/p>\n\n\n\n<p>That said, freelance writing&nbsp;<em>is<\/em>&nbsp;an amazing side hustle (or full-time career path), filled with variety, <a href=\"https:\/\/workspace.fiverr.com\/blog\/how-much-should-i-charge-for-my-services-how-to-set-your-rates-as-a-freelancer\/\">great hourly rates<\/a>, and the ability to work at home while binging on Netflix.<\/p>\n\n\n\n<p><em>(Don’t actually do that, by the way).<\/em><\/p>\n\n\n\n<h2 id=\"homebase\">1. You Need a “Home Base” on the Internet (Where You Can Show Your Work)<\/h2>\n\n\n\n<p>Remember in 3rd grade when the teacher asked you to “show your work?”<\/p>\n\n\n\n<p>This is kind of like that.<\/p>\n\n\n\n<p><strong>When you’re trying to convince a company to pay you for your writing, they’ll want to see examples of your writing.<\/strong><\/p>\n\n\n\n<p>#duh<\/p>\n\n\n\n<p>The most common method for most freelance writers is to start a blog, or otherwise have a personal website <em>(complete with a &#8220;work with me&#8221; page).<\/em><\/p>\n\n\n\n<p>Holly from <a href=\"https:\/\/clubthrifty.com\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Club Thrifty (opens in a new tab)\">Club Thrifty<\/a> has a fantastic portfolio page on her blog.<\/p>\n\n\n\n<p>More specifically, this “home base” website will need three things:<\/p>\n\n\n\n<ol><li>Examples of your writing<\/li><li>A portfolio page with links to external articles (once you get them)<\/li><li>Information on how to work with you (and contact you)<\/li><\/ol>\n\n\n\n<p><strong>Don’t get overwhelmed yet, though.<\/strong><\/p>\n\n\n\n<p>We’ll talk more about those details in a minute, but for now, you just need to get your home base set-up!<\/p>\n\n\n\n<p>The best course of action will be to start a very simple, minimal website.<\/p>\n\n\n\n<p>With the right set of instructions, you can easily have something set up in an afternoon, after which you should start publishing content (that you can show to potential freelance clients)!<\/p>\n\n\n\n<p><a href=\"https:\/\/doyouevenblog.com\/start-a-blog\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"This illustrative guide will teach you how to start a blog, step by step! (opens in a new tab)\">This illustrative guide will teach you how to start a blog, step by step!<\/a><\/p>\n\n\n\n<p><em>Pro Tip: If this is your first time setting up a website, keep things as simple as humanly possible! There are a <\/em><strong><em>lot<\/em><\/strong><em>&nbsp;of new things to learn in the beginning, so take it easy on yourself.<\/em><\/p>\n\n\n\n<p><strong>You don’t need a fancy theme or even a logo. You need a functioning, professional-looking site to show potential clients. Keep it minimal, and there will be fewer things to screw up.<\/strong><\/p>\n\n\n\n<p>Technical newbies should re-read that paragraph 👆<\/p>\n\n\n\n<p>Even if you don’t want to set up a portfolio blog right now, you’ll most definitely need one eventually.<\/p>\n\n\n\n<p>It&nbsp;<em>is<\/em> possible to start freelance writing without a blog, but it sure makes things easier if you do have one!<\/p>\n\n\n\n<p>The next point, however, is not optional.<\/p>\n\n\n\n<h2 id=\"getpublished\">2. You Need to Get Published on Somebody Else’s Blog ASAP<\/h2>\n\n\n\n<p>You’re not going to like this…<\/p>\n\n\n\n<p>But you need to do whatever it takes to get published on somebody else’s platform—even if that’s doing your first article for free.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-style-large\"><p>&#8220;What? No way! I don&#8217;t work for free&#8230;&#8221;<\/p><\/blockquote>\n\n\n\n<p>I get it. Working for free doesn&#8217;t sound very appealing, but when you&#8217;re just starting out, you need to consider it.<\/p>\n\n\n\n<p>Why?<\/p>\n\n\n\n<p>Every freelance client on the planet is going to want to see if you can write&nbsp;<em>for other people.<\/em><\/p>\n\n\n\n<p><strong>In fact, this is the most important piece of advice in this entire article: the quality of your past writing gigs either makes or breaks your opportunities for new, better freelance writing clients.<\/strong><\/p>\n\n\n\n<p>But you’re in luck!<\/p>\n\n\n\n<p>Even if you’ve never written a piece of freelance content before, there’s a simple solution for getting started:&nbsp;<strong>the guest post!<\/strong><\/p>\n\n\n\n<h3>Why guest posts are awesome for new freelance writers:<\/h3>\n\n\n\n<ol><li>They get your feet wet for conducting outreach\/pitching<\/li><li>It costs you nothing and gets you valuable writing experience, as well as something to add to your portfolio<\/li><li>It’s help to build your “writing for other people” muscle.<\/li><\/ol>\n\n\n\n<h3>How to find blogs to guest post on:<\/h3>\n\n\n\n<p>First, you’ll want to start small.<\/p>\n\n\n\n<p>Don’t go reaching out to huge blogs that have massive following and have been around for decades.<\/p>\n\n\n\n<p>Compile a list of blogs in your niche (we’ll talk about niches in a minute).<\/p>\n\n\n\n<p><strong>Here’s my recommended process <\/strong><em>(using an aspiring freelance writer in the personal finance niche as an example)<\/em><strong>:<\/strong><\/p>\n\n\n\n<ol><li>Create a spreadsheet to drop the names, URLs, and contact emails in<\/li><li>Go to Google and search “best personal finance blogs”<\/li><li>Open the top 10 results, sort through all the blogs, and put them on your spreadsheet.<\/li><li>Go to Pinterest and search “personal finance” (or other sub-topic keywords like “budgeting,” “frugality,” or “investing.”)<\/li><li>Open several pins, and add those resulting blogs to your spreadsheet<\/li><li>Go to&nbsp;<a href=\"https:\/\/detailed.com\/all\/\">Detailed.com<\/a>&nbsp;and click on your niche (they only have 10 large niches)<\/li><li>Open those blogs and add them to your spreadsheet (I recommend starting from the bottom of the list, as the top blogs are&nbsp;<strong>huge<\/strong>&nbsp;sites that’ll be tough to get guest posts on.<\/li><\/ol>\n\n\n\n<p>You can use the Chrome extensions&nbsp;<a href=\"https:\/\/chrome.google.com\/webstore\/detail\/hunter-find-email-address\/hgmhmanijnjhaffoampdlllchpolkdnj?hl=en\">Hunter<\/a>&nbsp;to find bloggers’ email addresses, or just use the contact forms on their site (check their site footer for the link).<\/p>\n\n\n\n<h2 id=\"pitching\">3. How to Pitch Bloggers for Guest Posts (or Your First Paid Opportunity)<\/h2>\n\n\n\n<p><strong>Huge mega-hint:<\/strong>&nbsp;Most of these tips apply for pitching paid freelance services as well!<\/p>\n\n\n\n<p>Pay attention 😃<\/p>\n\n\n\n<p>Every other “how to pitch yourself for a writing opportunity” article probably contains some form of copy\/paste template.<\/p>\n\n\n\n<p>But those are increasingly ineffective (as everybody like yourself tends to use them).<\/p>\n\n\n\n<h3>Instead, here are the essentials for a great outreach email.<\/h3>\n\n\n\n<p>These work whether you’re trying to land a guest post or connecting with your first freelance client:<\/p>\n\n\n\n<ol><li><strong>Write like a human.<\/strong>&nbsp;No scripts, no templates, no copy\/paste. Do use proper spelling, grammar, formatting, and be professional, but use natural language.<\/li><li><strong>Be brief.<\/strong>&nbsp;No 500 word emails, please! Write out the entire email, then cut it in half. No fluff.<\/li><li><strong>Be honest and transparent<\/strong>. Under no circumstances should you try to hide the fact that you’re asking for an opportunity! Make your ask clear.<\/li><li><strong>Be specific<\/strong>. Don’t leave anything to chance. Share&nbsp;<em>exactly<\/em>&nbsp;what you’re looking for and&nbsp;<em>exactly<\/em> what you bring to the table for them (with your content).<\/li><li><strong>Give specific suggestions.<\/strong>&nbsp;“I noticed you have a ‘ketogenic desserts’ category on your blog, but haven’t posted anything there in over 4 months. I have 3 specific blog post ideas for you! [Post A, Post B, and Post C]”<\/li><li><strong>Always show them “WIIFM.” (“What’s in in for me?”)<\/strong>&nbsp;That’s what your contact will be thinking when they open the email, so make the benefits of your freelance writing very clear.<\/li><\/ol>\n\n\n\n<p>Write short emails that sound like they’re coming from a friend or peer, present your ask\/offer clearly, and focus on building genuine relationships and adding value to the other person.<\/p>\n\n\n\n<p>You’ll get guest opportunities.<\/p>\n\n\n\n<h2 id=\"overdeliver\">4. Three ways to Overdeliver Value on Your First Gig (and Why It’s Critical You Do)<\/h2>\n\n\n\n<p>Do you remember what you’re after here?<\/p>\n\n\n\n<p>A lucrative freelance writing career?<\/p>\n\n\n\n<p><strong>Referrals and word of mouth are the top ways freelance writers find more work. Do whatever it takes to impress your first client and overdeliver.<\/strong><\/p>\n\n\n\n<p>This applies to initial guest post opportunities and your early paid clients.<\/p>\n\n\n\n<h3>Tip #1 &#8211; Be flexible in your writing<\/h3>\n\n\n\n<p>As a matter of fact, this should be included in your pitch as well. Reassure potential clients that they should feel free to send&nbsp;<em>back<\/em>&nbsp;your content with changes, improvements, or revisions.<\/p>\n\n\n\n<p>They want any guest content to be&nbsp;<em>good,<\/em>&nbsp;so reassure them you’ll do whatever it takes to make that happen!<\/p>\n\n\n\n<h3>Tip #2 &#8211; Share the content once it’s live<\/h3>\n\n\n\n<ul><li>Share on social media.<\/li><li>If you have an email list, email them about the guest post.<\/li><li>Write about the experience on your own blog and link back to the post.<\/li><li>Etc.<\/li><\/ul>\n\n\n\n<h3>Tip #3 &#8211; Follow up a week after it’s live<\/h3>\n\n\n\n<p>Ask your client&nbsp;<em>“How was the response from the guest post? Is there anything I can do to help?”<\/em><\/p>\n\n\n\n<p>It’s unlikely they’ll come back with anything, but it shows them how caring and dedicated you are just in case.<\/p>\n\n\n\n<p><strong>When you first start freelance writing, these are the types of interactions that’ll increase the likelihood growing your work opportunities quicker.<\/strong><\/p>\n\n\n\n<p>Overdeliver on your first few gigs, and you’ll quickly find yourself getting more opportunities (or repeat opportunities)!<\/p>\n\n\n\n<h2 id=\"referrals\">5. You Need to Ask for Referrals<\/h2>\n\n\n\n<p>And not just reaching out to past clients—because you might not have any of those yet.<\/p>\n\n\n\n<p>The truth is, you already have a network of some sort, even if you don’t know it.<\/p>\n\n\n\n<ul><li>Search your LinkedIn contacts for people who like you<\/li><li>Email that college professor you were close with<\/li><li>Text your mom<\/li><\/ul>\n\n\n\n<p>If this sounds silly, it is, and that’s why 95% of people would never think to actually implement this 😃<\/p>\n\n\n\n<p>Say something like this:<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-style-large\"><p>“Hey cousin Ed! Long time no see! I’ve recently gotten into freelance writing as a career path (I write about [topic] for [type of company you serve]), and I’m looking for a bit more work. Do you know of anybody who might want articles for their website\/blog? Anybody who works at [type of company you serve]? Etc? I just thought I’d ask!”<\/p><\/blockquote>\n\n\n\n<h3>Here’s why asking your personal network for referrals is awesome…<\/h3>\n\n\n\n<p>Two reasons:<\/p>\n\n\n\n<ol><li>There’s a small chance you’ll actually get a direct lead<\/li><li>There’s a very high chance you will now be “top of mind” if and when your friends&nbsp;<em>do<\/em>encounter somebody at [type of company you serve].<\/li><\/ol>\n\n\n\n<p>If you write for e-commerce platforms, you’ll want your friends to think of&nbsp;<em>you<\/em>&nbsp;when they meet an e-commerce CMO at a networking event.<\/p>\n\n\n\n<p>Got it?<\/p>\n\n\n\n<p><strong>Pro Tip<\/strong>: You should absolutely double-back with past clients or bloggers who you wrote a guest post for—asking them for referrals as well. Just be more professional in your language than if you were talking to Cousin Ed.<\/p>\n\n\n\n<h2 id=\"findcompanies\">6. How to Specifically Find Companies Who Will Pay You to Freelance Write<\/h2>\n\n\n\n<p>So you have a few articles published and you’re ready to level up into paid freelance writing.<\/p>\n\n\n\n<p>Buckle up.<\/p>\n\n\n\n<p><strong>This is the stage where you are absolutely not allowed to give up! You should expect to receive several “no’s” before you get a “yes.” Your first paid gig will always be the hardest.<\/strong><\/p>\n\n\n\n<p>Freelance writing gets easy the more you do it (since you have more work to show for yourself and more client wins to report).<\/p>\n\n\n\n<h3>Introducing the “Upside Down” Method of finding paying clients.<\/h3>\n\n\n\n<p><em>This hack comes from a guest post that James Johnson wrote on Nick Loper’s site, <a href=\"https:\/\/www.sidehustlenation.com\/upside-down-business-model-for-freelance-writing\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">Side Hustle Nation<\/a>.<\/em><\/p>\n\n\n\n<p>It’s a fantastic post, and you should read the whole thing!<\/p>\n\n\n\n<p>Here’s how James laid it out:<\/p>\n\n\n\n<p><strong>Rather than looking for companies to pitch to, you’ll be looking for other freelancers with other paid writing gigs under their belt. From there, you’ll reverse-engineer your search to discover companies with a track record of paying freelancers.<\/strong><\/p>\n\n\n\n<p>Here’s what you’ll do:<\/p>\n\n\n\n<ol><li>Go to Google and search for freelance writers in your niche. Use a query like&nbsp;<em>[niche] “guest post” + “is a freelance writer”<\/em><\/li><li>Find your way to those writers’ websites, and find their portfolio. Try searching for their “about” page “work with me” page.<\/li><li>Once you find their portfolio, browse through and note any companies that would be a good fit for you as well!<\/li><\/ol>\n\n\n\n<p>This method works well for finding companies that are proven to pay freelance writers.<\/p>\n\n\n\n<p><em>Pro Tip: In this process, you should be organizing your search in some sort of spreadsheet tracker or checklist. Keep a living document of companies you’d like to reach out to, noting when you’ve pitched them, when you should follow-up, etc.<\/em><\/p>\n\n\n\n<p>For more info, go back to that Side Hustle Nation link at the top of this section. James breaks it down in far more detail.<\/p>\n\n\n\n<h2>7. Here’s Another Pro Tip That’ll Help You Stand out From Other New Freelance Writers<\/h2>\n\n\n\n<p><em>Warning: This section suggests hustle moves that most new freelancers aren’t willing to do.<\/em><\/p>\n\n\n\n<p>Put yourself in the shoes of an editor who is receiving 20 emails a day from freelance writers.<\/p>\n\n\n\n<p>They see a lot of pitches like…<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-style-large\"><p><em>“Hey I’m Jerry, a freelancer from [blog], and I’d love to contribute to the Business Insider blog. Here’s my portfolio: [link]. What do you think?”<\/em><\/p><\/blockquote>\n\n\n\n<p>Or slightly better…<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-style-large\"><p><em>“Hey I’m Jerry, a freelancer from [blog], and I’d love to contribute to your platform. I had three article ideas in mind. [Idea one. Idea two. Idea three.]. What do you think?”<\/em><\/p><\/blockquote>\n\n\n\n<p><strong>Editors receive a ton of these pitches!<\/strong><\/p>\n\n\n\n<p>How can you stand out?<\/p>\n\n\n\n<p>Simple. Prove to them up front that you’re a hard worker.<\/p>\n\n\n\n<h3>How to prove you’ll be a great writer and add value to your client’s brand.<\/h3>\n\n\n\n<p>Do some form of work upfront—before they’ve actually said “yes.”<\/p>\n\n\n\n<p>This could take several forms:<\/p>\n\n\n\n<ul><li>Include 60-second video in your pitch explaining your article idea in greater detail.<\/li><li>Write the article beforehand, and tease it in your pitch email with a screenshot. Ask them if they’d like to read the entire thing.<\/li><li>Prepare three different article ideas, and include a one-paragraph summary of each idea, as well as five different headline alternatives for each.<\/li><li>Explain how <em>you<\/em>&nbsp;will promote the article to&nbsp;<em>your<\/em>&nbsp;audience once it’s live. Social media, email list, paid promotion?<\/li><\/ul>\n\n\n\n<p>If you do something a little extra like this, make sure to tailor your idea or pitch to their brand! It shouldn’t be a generic “Hey, I already have a random piece written and I thought you might want it.”<\/p>\n\n\n\n<p>It should be more like “Hey, I did all this work already specifically for your brand.”<\/p>\n\n\n\n<p><em>Pro Tip: I once got a guest post opportunity by submitting three articles ideas, summary, and alternative headlines—inside a Google Doc that I customized to their brand colors, logo, etc.<\/em><\/p>\n\n\n\n<h2 id=\"system\">8. Organize Your &#8220;Freelance System&#8221; (and Showcase It to Potential Clients)<\/h2>\n\n\n\n<p>Here’s another thing that all companies want from their freelance writers:&nbsp;<strong>They want you to be hyper-organized, timely, and professional in your services.<\/strong><\/p>\n\n\n\n<p>And not just the actual writing…<\/p>\n\n\n\n<ul><li>You’ll need to <a href=\"https:\/\/workspace.fiverr.com\/proposals\">send proposals<\/a><\/li><li>You’ll need contracts<\/li><li>You might need to track your hours<\/li><li>You’ll need to send invoices and collect payments.<\/li><\/ul>\n\n\n\n<p>These don’t really sound challenging until it’s actually time to&nbsp;<em>do<\/em>&nbsp;such administrative tasks.<\/p>\n\n\n\n<p>In case you haven&#8217;t noticed, this is the entire purpose of AND CO—to make your life 10x easier as a new freelance writer, giving you the tools to find and close new clients, and save time, energy, and money in your freelancing.<\/p>\n\n\n\n<p><strong>Example<\/strong>: Here&#8217;s <a href=\"https:\/\/workspace.fiverr.com\/invoicing-guide.html\">an entire guide to invoicing<\/a>, and here&#8217;s <a href=\"https:\/\/workspace.fiverr.com\/free-invoice-generator.html\">a free invoice generator!<\/a><\/p>\n\n\n\n<p><em>Pro Tip: You might even share your tools &amp; “admin system” with your prospective clients. They’ll like to know that you’re a professional, and will make it easy for them to pay you, etc.<\/em><\/p>\n\n\n\n<p>Don&#8217;t neglect the administrative side of freelancing. The amount of &#8220;backend&#8221; work often surprises new freelance writers!<\/p>\n\n\n\n<p>Be prepared, make things easier on yourself, and show your clients you&#8217;re a professional 👍<\/p>\n\n\n\n<h2 id=\"second\">BONUS: How to Land Your 2nd Freelance Writing Client<\/h2>\n\n\n\n<p>Too many new freelancers overlook this important step.<\/p>\n\n\n\n<p>Make sure to double-back with any clients you’ve worked for (or bloggers you’ve guest posted for) and collect any wins they received!<\/p>\n\n\n\n<p>What you’re doing is here is gathering testimonials and social proof that you can use to showcase your skills to new clients.<\/p>\n\n\n\n<p>Here&#8217;s an example from freelancer <a href=\"https:\/\/www.catherinealford.com\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Cat Alford's (opens in a new tab)\">Cat Alford&#8217;s<\/a> blog:<\/p>\n\n\n\n<p>Ask for…<\/p>\n\n\n\n<ul><li><strong>Revenues or leads<\/strong>. Did that post generate any sales for you?<\/li><li><strong>Traffic<\/strong>. How was traffic to our article?<\/li><li><strong>Shares<\/strong>. How did your audience respond to the article? Did it get many shares?<\/li><\/ul>\n\n\n\n<p>The more wins you can collect, the better. You can even create a living Google Doc with client testimonials and specific results from past writing gigs.<\/p>\n\n\n\n<h2>Are You Ready to Start Freelance Writing?<\/h2>\n\n\n\n<p>Before you head off to browse the internet and forget what you’ve learned, let’s recap:<\/p>\n\n\n\n<ul><li>Set up a blog or website to showcase your content and act as a portfolio (and contact method).<\/li><li>You’ll need to have published content of some sort. Guest posting is low-hanging fruit for getting published.<\/li><li>Use the “upside down” method for finding companies that are known to pay freelance writers.<\/li><li>Don&#8217;t forget the outreach principles outlined in this article. They&#8217;ll help you stand out from the crowds and land your first gig.<\/li><li>Do everything humanly possible to get that <em>first gig<\/em>&nbsp;and overdeliver value in any way you can. This will help with word of mouth referrals.<\/li><li>You’re not allowed to give up easily 😃<\/li><\/ul>\n\n\n\n<p>The path to making income through your writing is not an easy one, but it&nbsp;<em>is<\/em>&nbsp;doable with a bit of hustle!<\/p>\n\n\n\n<p>So what are you waiting for?<\/p>\n\n\n\n<p>Go execute!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Looking to start freelance writing but not sure where to start? Use this guide to avoid overwhelm and get your first paying freelance client.<\/p>\n","protected":false},"author":108,"featured_media":8341,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[2],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to Start Freelance Writing (Everything You Need to Know)<\/title>\n<meta name=\"description\" content=\"Looking to start freelance writing but not sure where to start? Use this guide to avoid overwhelm and get your first paying freelance client.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/workspace.fiverr.com\/blog\/start-freelance-writing\/\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"How to Start Freelance Writing (Everything You Need to Know)\" \/>\n<meta name=\"twitter:description\" content=\"Looking to start freelance writing but not sure where to start? Use this guide to avoid overwhelm and get your first paying freelance client.\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Pete McPherson\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"14 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How to Start Freelance Writing (Everything You Need to Know)","description":"Looking to start freelance writing but not sure where to start? Use this guide to avoid overwhelm and get your first paying freelance client.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/workspace.fiverr.com\/blog\/start-freelance-writing\/","twitter_card":"summary_large_image","twitter_title":"How to Start Freelance Writing (Everything You Need to Know)","twitter_description":"Looking to start freelance writing but not sure where to start? Use this guide to avoid overwhelm and get your first paying freelance client.","twitter_misc":{"Written by":"Pete McPherson","Est. reading time":"14 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/workspace.fiverr.com\/#organization","name":"Fiverr","url":"https:\/\/workspace.fiverr.com\/","sameAs":[],"logo":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#logo","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","width":512,"height":512,"caption":"Fiverr"},"image":{"@id":"https:\/\/workspace.fiverr.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/workspace.fiverr.com\/#website","url":"https:\/\/workspace.fiverr.com\/","name":"Fiverr Workspace","description":"","publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/workspace.fiverr.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/blog\/start-freelance-writing\/#primaryimage","inLanguage":"en-US","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/workspace.fiverr.com\/blog\/start-freelance-writing\/#webpage","url":"https:\/\/workspace.fiverr.com\/blog\/start-freelance-writing\/","name":"How to Start Freelance Writing (Everything You Need to Know)","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/start-freelance-writing\/#primaryimage"},"datePublished":"2019-06-24T03:11:33+00:00","dateModified":"2021-12-27T14:58:15+00:00","description":"Looking to start freelance writing but not sure where to start? Use this guide to avoid overwhelm and get your first paying freelance client.","breadcrumb":{"@id":"https:\/\/workspace.fiverr.com\/blog\/start-freelance-writing\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/workspace.fiverr.com\/blog\/start-freelance-writing\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/workspace.fiverr.com\/blog\/start-freelance-writing\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Fiverr Workspace","item":"https:\/\/workspace.fiverr.com\/"},{"@type":"ListItem","position":2,"name":"How to Start Freelance Writing (Everything You Need to Know)"}]},{"@type":["Article","BlogPosting"],"@id":"https:\/\/workspace.fiverr.com\/blog\/start-freelance-writing\/#article","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/blog\/start-freelance-writing\/#webpage"},"author":{"@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/c72abc25a45f9f40e661f93788e54d75"},"headline":"How to Start Freelance Writing (Everything You Need to Know)","datePublished":"2019-06-24T03:11:33+00:00","dateModified":"2021-12-27T14:58:15+00:00","mainEntityOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/start-freelance-writing\/#webpage"},"wordCount":3117,"publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"image":{"@id":"https:\/\/workspace.fiverr.com\/blog\/start-freelance-writing\/#primaryimage"},"thumbnailUrl":"","articleSection":["Freelance knowledge"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/c72abc25a45f9f40e661f93788e54d75","name":"Pete McPherson","image":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/7bee38494e2cc0c4503593b56809e164?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/7bee38494e2cc0c4503593b56809e164?s=96&d=mm&r=g","caption":"Pete McPherson"},"description":"Pete McPherson is one heck of a podcaster and blogger at Do You Even Blog, and also the founder of Online Impact: a premium membership community for bloggers, podcasters, and online entrepreneurs wanting to make more money.","sameAs":["https:\/\/doyouevenblog.com"]}]}},"_links":{"self":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/6765"}],"collection":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/users\/108"}],"replies":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/comments?post=6765"}],"version-history":[{"count":0,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/6765\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media?parent=6765"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/categories?post=6765"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/tags?post=6765"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}