{"id":6863,"date":"2020-11-25T22:16:35","date_gmt":"2019-07-11T02:05:23","guid":{"rendered":"https:\/\/www.and.co\/blog\/?p=6863"},"modified":"2021-10-24T08:17:26","modified_gmt":"2021-10-24T08:17:26","slug":"new-freelance-leads","status":"publish","type":"post","link":"https:\/\/workspace.fiverr.com\/blog\/new-freelance-leads\/","title":{"rendered":"How to Generate New Leads As a Freelancer in 5 Easy Steps"},"content":{"rendered":"\n<p>Most businesses have a sales team to bring in new leads. As a freelancer, you need to be that sales team. <\/p>\n\n\n\n<p>If you’re not a natural salesperson this will be the hardest part of the job. You need to identify suitable leads, figure out how to approach them, and then secure that contract.&nbsp;<\/p>\n\n\n\n<p>With a limited number of hours in the day, you don’t have the luxury of being able to endlessly experiment. You need strategies that work, so you can maintain the income that provides you with luxuries like being able to set your own work schedule.<\/p>\n\n\n\n<p>In this guide, I’ll share strategies to consistently generate new leads for your business. They are tactics that I’ve used as a freelancer to drum up business, and that I currently use at the agency I work for to close mid-five figure deals.<\/p>\n\n\n\n<h2>Spend a Minute in the Shoes of Your Client<\/h2>\n\n\n\n<p>If you want to land more clients, you need to understand the steps that your ideal employer would go through when they are looking for someone to work with. A good place to start that journey is on a freelancer site. These are places where thousands of freelancers come together to compete for the same business opportunities. They are a great place to see which marketing strategies work.<\/p>\n\n\n\n<p>I’ll use the platform Fiverr as my example.<\/p>\n\n\n\n<p>Say you are an employer looking for a writer. A quick search on Fiverr will provide you with 51,509 results.<\/p>\n\n\n\n<p>Let that number settle in for a minute.<\/p>\n\n\n\n<p><strong>To stand out in such a crowded marketplace you have a couple of different options. You can:<\/strong><\/p>\n\n\n\n<ul><li>Offer a cheaper service than the competition<\/li><li>Provide a better service than the competition<\/li><li>Define your Unique Selling Point (USP) and <a href=\"https:\/\/workspace.fiverr.com\/blog\/8-strategic-ways-to-stand-out-from-your-freelance-competition\/\">remove 99% of the competition<\/a><\/li><\/ul>\n\n\n\n<p>Should you take a closer look at the listings on Fiverr you’ll quickly notice that most freelancers go down the route of clearly defining their USP. This will help you to charge what you’re worth while focusing on your ideal client.<\/p>\n\n\n\n<h2>Step 1: How to Define Your Unique Selling Point<\/h2>\n\n\n\n<p>Defining your USP generally involves laser focusing on the pain points of your ideal client and offering them services that fit their needs. The advantage of this strategy is that as an employer, you are much more likely to hire ‘<em>the specialist<\/em>’ who caters to your pain points.<\/p>\n\n\n\n<p>Let’s zoom in on those first two candidates on the listing on Fiverr.<\/p>\n\n\n\n<p>You can see how the first two writers have limited their service offering. They are specialist CV writers. While both freelancers offer the same service, one of them has targeted a specific demographic within that niche. This laser focus allows her to charge more for her service.<\/p>\n\n\n\n<p>While being a specialist helps you attract your perfect client, it also makes your job easier. Each time you serve a client you gain more experience in that industry. You become an expert in the problems that these clients are facing and the solutions. This helps you improve your sales pitch, and generally reduces the amount of time you have to spend to service each client.<\/p>\n\n\n\n<p>Most of the successful freelancers and business owners I know have a well defined USP. Adam Connell is a good example. He’s built a number of websites that are designed to help bloggers grow their audience. He had this to say on the subject of finding your USP:<\/p>\n\n\n\n<p><em>“This might sound like an obvious one, but the best way to start defining your USP is with your niche. Specifically, drill down to a specific niche and stick to it.<\/em><\/p>\n\n\n\n<p><em>Here&#8217;s why this matters:<\/em><\/p>\n\n\n\n<p><em>When you offer any type of service (<\/em><a href=\"https:\/\/bloggingwizard.com\/choose-perfect-niche-for-your-blog\/\"><em>or content<\/em><\/a><em>) to a more general audience, you&#8217;re competing with everyone. And that includes agencies.<\/em><\/p>\n\n\n\n<p><em>When you focus on a specific niche, you cut down the competition and immediately stand out more.<\/em><\/p>\n\n\n\n<p><em>The next step? Learn about the competition in your chosen niche. Find what they do well, and not so well &#8211; and craft your offering strategically.<\/em><\/p>\n\n\n\n<p><em>And as a by-product, you’ll become more sought after and be able to command much higher rates.” <\/em><\/p>\n\n\n\n<p>&#8211; <a href=\"https:\/\/www.adamconnell.me\/\"><em>Adam Connell<\/em><\/a><em>.<\/em><\/p>\n\n\n\n<p>Basically, if you haven’t got a clearly defined USP then get one! It will help you attract more of your ideal clients.<\/p>\n\n\n\n<h2>Step 2: Get Comfortable with Cold Outreach<\/h2>\n\n\n\n<p>Once you’ve defined your USP you need to find people who are interested in your service. One of the most reliable ways to do this is cold outreach. This is where you pick up the phone or start typing an email, to someone you’ve never met before, but who might be interested in your service.<\/p>\n\n\n\n<p>If you’re not a salesperson, cold outreach will be something you probably won’t want to do. It takes a certain mindset to contact people you have never talked to before.<\/p>\n\n\n\n<p>I understand, but it is effective.<\/p>\n\n\n\n<p>One of my first part-time jobs was working for a telemarketing company selling timeshare. I was given a list of phone numbers at the start of my shift. After about three hours of work, I’d end the night with 2-3 leads.<\/p>\n\n\n\n<p>All I needed to generate those sales was a list of qualified leads, a script, and the confidence to just get on with it. More than 20 years later I use exactly the same system to find partners for software promotions. The process starts with generating a list of leads.<\/p>\n\n\n\n<h2>Step 3: How to Generate a List of Leads<\/h2>\n\n\n\n<p>Being able to generate a list of relevant leads is an essential part of running a business (it’s what sales teams are all about after all). Before I start researching I create an Excel sheet with the following columns:<\/p>\n\n\n\n<ul><li>Business Name<\/li><li>Business Website<\/li><li>Contact Person<\/li><li>Contact Details<\/li><\/ul>\n\n\n\n<p>If you’re targeting small- to medium-sized businesses you’ll find that Google My Business is a great resource for generating a list of prospective buyers. <\/p>\n\n\n\n<p>If your ideal client is a business with 50+ employees it gets more complicated. For a start, you need to identify the person you want to speak to. Think about what their possible title might be (e.g. Marketing Director, or Marketing Manager). You can generally find their contact details on LinkedIn or the About Page of their website.&nbsp;<\/p>\n\n\n\n<p>Undertaking this research is a relatively easy, but time-consuming process. For this reason, I recommend you note down the steps you went through to create the list. This way, if you decide it’s worth it, you can outsource that whole research process to another freelancer.&nbsp;<\/p>\n\n\n\n<p>Once you’ve got your list of leads you’ll need to contact people.<\/p>\n\n\n\n<h2>Step 4: How to Create an Email Template<\/h2>\n\n\n\n<p>One of the big decisions that you’ll need to make when you do cold outreach is how to contact your client. There are essentially three channels that you can choose between. These are:<\/p>\n\n\n\n<ul><li>social media\/professional networks<\/li><li>email<\/li><li>phone<\/li><li>in-person meetings.<\/li><\/ul>\n\n\n\n<p>To generate leads, it’s best to use a mix of these four channels. For the purpose of this post, I’ll focus on the best online way of connecting with prospective clients, namely email and social media.<\/p>\n\n\n\n<p>Before you start your outreach I recommend creating an <a href=\"https:\/\/workspace.fiverr.com\/blog\/5-steps-to-write-cold-emails-that-convert-freelance-clients\/\">email template<\/a> and social media template. This template will be a couple of paragraphs long and provide a clear outline of your business proposal that a potential client can buy into.<\/p>\n\n\n\n<p>This is what the email template I used to reach out to software companies looked like.<\/p>\n\n\n\n<p>This template is simple and to the point, but it is responsible for&nbsp; $100,000+ of sales. To increase the number of leads, I ran a few experiments. One effective tactic that I used was to include a link to a sales video—essentially a pitch to camera—in my email. This strategy dramatically increased the number of people who replied to my email.<\/p>\n\n\n\n<p>Email is always my first communication channel. With a good template, it’s also very easy to do this outreach thanks to all of the <a href=\"https:\/\/launchspace.net\/software-comparison\/blogger-outreach-tools\/\">blogger outreach software<\/a> out there.<\/p>\n\n\n\n<p>If an email fails you, and some people just don’t reply to emails, then I recommend that you follow up by a social media channel like LinkedIn or Facebook. If you’re going to use LinkedIn, make sure to connect with the person first otherwise you won’t be able to message them.<\/p>\n\n\n\n<p>Regardless of which channel you use, keep your opener simple. Your aim is to start a conversation.<\/p>\n\n\n\n<p>When they reply, keep your conversation simple. Outline why you are contacting them and what you hope to achieve. If they are interested in what you have to say then arrange a video call with them.<\/p>\n\n\n\n<h2>Step 5: How to Close More Clients<\/h2>\n\n\n\n<p>A video call is the final stage of your sales process. It’s much more effective for closing a sale than an email. That opportunity to chat and talk things through is also a chance to convince the person you are talking with that you know what you’re doing.<\/p>\n\n\n\n<p>Just like sending your first email, you want to be prepared for that first contact. Spend some time creating <a href=\"https:\/\/blog.hubspot.com\/sales\/sales-scripts-examples\">a script<\/a>&#8230; Then make sure to practice it out loud.<\/p>\n\n\n\n<p>While this might sound like a silly suggestion it’s actually helpful. You’ll catch problems with your flow when you say things out loud. This is an opportunity for you to edit and improve your pitch before talking to the prospective client.<\/p>\n\n\n\n<p>Here are a few quick tips to keep in mind when you do eventually get on that call:<\/p>\n\n\n\n<ul><li>Spend more time listening to the person who you are trying to sell to than you spend talking (people love to talk about themselves)<\/li><li>Note down key phrases and points that the person you are talking to on the call. Then use those points in any <a href=\"https:\/\/workspace.fiverr.com\/blog\/how-to-write-great-proposals-that-win-you-more-freelance-projects\/\">written proposal<\/a> you make later down the line<\/li><li>Focus on the value that you offer the client—i.e. money saved or money generated—and the difficulty of the task. Don’t focus on how much your product or service costs.<\/li><li>Make sure you close your call with a clear set of follow on steps. This will help you avoid that “what happens next” situation, which is all too common.<\/li><\/ul>\n\n\n\n<p>That’s it. After your first two or three video calls, you’ll quickly get into your stride. Over time and with practice you’ll figure out a sales pitch that works well for your product offering and sales style. The hard part from that point is delivering the service. I&#8217;ll leave that up to you!<\/p>\n\n\n\n<h2>Wrapping Up<\/h2>\n\n\n\n<p>The decision to go freelance is an exciting one, but it also comes along with a steep learning curve. In addition to performing your particular talent, you also need to get to grips with other basic business functions, especially customer acquisition.<\/p>\n\n\n\n<p>Maybe as a marketing specialist, I shouldn’t say this, but the truth is it’s not that hard. The key is to have a clear and repeatable process for bringing on new customers. That’s exactly what I’ve tried to talk you through today.<\/p>\n\n\n\n<p><strong>Now go get ‘em.<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Learn how to identify suitable leads, figure out how to approach them, and secure new contracts. <\/p>\n","protected":false},"author":102,"featured_media":9812,"comment_status":"closed","ping_status":"closed","sticky":true,"template":"","format":"standard","meta":[],"categories":[19],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to Generate New Leads As a Freelancer in 5 Easy Steps<\/title>\n<meta name=\"description\" content=\"Learn how to identify suitable leads, figure out how to approach them, and secure new contracts.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/workspace.fiverr.com\/blog\/new-freelance-leads\/\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"How to Generate New Leads As a Freelancer in 5 Easy Steps\" \/>\n<meta name=\"twitter:description\" content=\"Learn how to identify suitable leads, figure out how to approach them, and secure new contracts.\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/Header-Image_Announcement.jpg\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Nico Prins\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How to Generate New Leads As a Freelancer in 5 Easy Steps","description":"Learn how to identify suitable leads, figure out how to approach them, and secure new contracts.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/workspace.fiverr.com\/blog\/new-freelance-leads\/","twitter_card":"summary_large_image","twitter_title":"How to Generate New Leads As a Freelancer in 5 Easy Steps","twitter_description":"Learn how to identify suitable leads, figure out how to approach them, and secure new contracts.","twitter_image":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/Header-Image_Announcement.jpg","twitter_misc":{"Written by":"Nico Prins","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/workspace.fiverr.com\/#organization","name":"Fiverr","url":"https:\/\/workspace.fiverr.com\/","sameAs":[],"logo":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#logo","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","width":512,"height":512,"caption":"Fiverr"},"image":{"@id":"https:\/\/workspace.fiverr.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/workspace.fiverr.com\/#website","url":"https:\/\/workspace.fiverr.com\/","name":"Fiverr Workspace","description":"","publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/workspace.fiverr.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/blog\/new-freelance-leads\/#primaryimage","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/Header-Image_Announcement.jpg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/Header-Image_Announcement.jpg","width":1200,"height":576},{"@type":"WebPage","@id":"https:\/\/workspace.fiverr.com\/blog\/new-freelance-leads\/#webpage","url":"https:\/\/workspace.fiverr.com\/blog\/new-freelance-leads\/","name":"How to Generate New Leads As a Freelancer in 5 Easy Steps","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/new-freelance-leads\/#primaryimage"},"datePublished":"2019-07-11T02:05:23+00:00","dateModified":"2021-10-24T08:17:26+00:00","description":"Learn how to identify suitable leads, figure out how to approach them, and secure new contracts.","breadcrumb":{"@id":"https:\/\/workspace.fiverr.com\/blog\/new-freelance-leads\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/workspace.fiverr.com\/blog\/new-freelance-leads\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/workspace.fiverr.com\/blog\/new-freelance-leads\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Fiverr Workspace","item":"https:\/\/workspace.fiverr.com\/"},{"@type":"ListItem","position":2,"name":"How to Generate New Leads As a Freelancer in 5 Easy Steps"}]},{"@type":["Article","BlogPosting"],"@id":"https:\/\/workspace.fiverr.com\/blog\/new-freelance-leads\/#article","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/blog\/new-freelance-leads\/#webpage"},"author":{"@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/5a7bb780c69b580a2b857bcfa2c86c51"},"headline":"How to Generate New Leads As a Freelancer in 5 Easy Steps","datePublished":"2019-07-11T02:05:23+00:00","dateModified":"2021-10-24T08:17:26+00:00","mainEntityOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/new-freelance-leads\/#webpage"},"wordCount":1870,"publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"image":{"@id":"https:\/\/workspace.fiverr.com\/blog\/new-freelance-leads\/#primaryimage"},"thumbnailUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/Header-Image_Announcement.jpg","articleSection":["GROWING YOUR BUSINESS"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/5a7bb780c69b580a2b857bcfa2c86c51","name":"Nico Prins","image":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/fb2bc5de7d8b7566498a510149b60e51?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/fb2bc5de7d8b7566498a510149b60e51?s=96&d=mm&r=g","caption":"Nico Prins"},"description":"Nico Prins is an online marketer with a passion for travel. He spends most of his week helping FTSE 100 and Fortune 500 companies develop and implement content marketing strategies. In his spare time, he runs Launch Space where he shares blogging tips and releases free tools for online marketers."}]}},"_links":{"self":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/6863"}],"collection":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/users\/102"}],"replies":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/comments?post=6863"}],"version-history":[{"count":0,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/6863\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media\/9812"}],"wp:attachment":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media?parent=6863"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/categories?post=6863"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/tags?post=6863"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}