{"id":6917,"date":"2020-11-25T22:16:37","date_gmt":"2019-08-07T04:02:41","guid":{"rendered":"https:\/\/www.and.co\/blog\/?p=6917"},"modified":"2022-01-04T09:24:29","modified_gmt":"2022-01-04T09:24:29","slug":"video-marketing-promote-freelance-work","status":"publish","type":"post","link":"https:\/\/workspace.fiverr.com\/blog\/video-marketing-promote-freelance-work\/","title":{"rendered":"How to Use Video Marketing To Promote Your Freelance Work"},"content":{"rendered":"\n<p>Video marketing is one of the most effective forms of communication we currently have available to us. <\/p>\n\n\n\n<p>Human beings are visual learners, which means generating more video content the potential to strengthen and empower your brand and boost your freelance marketing campaign. <\/p>\n\n\n\n<p>Here are just a <a href=\"https:\/\/www.wordstream.com\/blog\/ws\/2017\/03\/08\/video-marketing-statistics\">few video marketing statistics<\/a>, to show you the impact that video marketing can have on your reach and visibility:<\/p>\n\n\n\n<ul><li>You probably already have a landing page, or a portfolio set up to promote your work, right? If so, you should know that <strong>including even a single video on that landing page can increase conversions by as much as 80%.<\/strong><\/li><li><strong>Video content drives an incredible 157% increase in organic traffic from search engine results pages<\/strong> &#8211; meaning that it makes people more likely to find your work in the first place.<\/li><li>The <strong>average conversion rate for websites that use video is 4.8%<\/strong>, compared to just 2.9% for those that don&#8217;t.<\/li><\/ul>\n\n\n\n<p class=\"has-text-align-center\">Source: <a href=\"https:\/\/www.uscreen.tv\/\">Uscreen<\/a><\/p>\n\n\n\n<p>Video collateral is also a great way to empower other marketing efforts you&#8217;re engaged in, too, like <a href=\"https:\/\/workspace.fiverr.com\/blog\/5-steps-to-write-cold-emails-that-convert-freelance-clients\/\">cold emails<\/a> (which we&#8217;ll get to in greater detail in a bit). But regardless of how you look at it, it&#8217;s clear that this is one opportunity you can&#8217;t afford to overlook.<\/p>\n\n\n\n<h2>Why Freelancers Should Leverage Video Marketing<\/h2>\n\n\n\n<p>One of the most important reasons why all freelancers should be taking full advantage of video marketing ultimately comes down to the importance of showing, not telling, what it is you&#8217;re capable of doing. <\/p>\n\n\n\n<p>Being a freelancer is difficult from a certain perspective because you&#8217;re not <em>only<\/em> selling your products and services—you have to sell <em>yourself<\/em>, too. You need clients to understand not only what you do and why it&#8217;s so important, but why you specifically are the person they need to be working with. This alone requires you to be convincing, engaging and approachable all at the same time—and video collateral is one of the best chances you have to do it.<\/p>\n\n\n\n<p>If you&#8217;re a freelance video editor, for example, a great way to promote your work is to show it off. Instead of creating a laundry list of credentials and qualifications on your website, edit together a reel of some of the work you&#8217;re most proud of. You can, for example, take five minutes to pull together a variety of clips that really show off the extent of what you&#8217;re capable of. Yes, the fact that you&#8217;re knowledgeable in this software or you went to that school is important, but ultimately the work speaks for itself.<\/p>\n\n\n\n<p>But maybe the biggest, long-term reason why video marketing should be used to promote your freelance work comes back to that idea of selling. <\/p>\n\n\n\n<p>When you <a href=\"https:\/\/www.uscreen.tv\/blog\/how-to-make-a-good-youtube-video\/\">make a good video<\/a> and upload it to your website, it suddenly takes a little bit of the burden off of you because that content itself is doing a significant part of the &#8220;convincing&#8221; when it comes to new leads. Plus, that video collateral becomes the perfect type of salesman—the kind that never needs to eat or sleep, that never goes on vacation and that can continue to push you and your freelance business 24 hours a day, seven days a week, 365 days a year.<\/p>\n\n\n\n<p>At that point, even something as simple as a video ad is more than just an ad—it&#8217;s a <em>champion<\/em> that spreads your message far and wide all day, every day.<\/p>\n\n\n\n<h2>6 Powerful Ways to Use Video to Promote Your Freelance Work<\/h2>\n\n\n\n<p>Convinced about the impact that video marketing can have on your freelance business?<\/p>\n\n\n\n<p>Here are the 6 ways you can use video to build your brand and promote your freelance work:<\/p>\n\n\n\n<h3>1. Take Clients Behind-the-Scenes<\/h3>\n\n\n\n<p>Video doesn&#8217;t have to be highly-polished and well-produced in order to sell. You can start leveraging video marketing by using as many different types of video content as possible. Let&#8217;s say you’re working <a href=\"https:\/\/www.uscreen.tv\/blog\/how-to-make-money-as-an-artist\/\">as a freelance artist<\/a>, for example. In addition to a portfolio of still images on your website, include a video or two that actually shows off the hard work, sweat and dedication that goes into each piece. You could do a short time-lapse video, for example, showing how something goes from blank canvas to finished product. <\/p>\n\n\n\n<p>Video is the perfect medium to convey the value that you can bring to clients, and this is a simple yet powerful way to show your talents, and take your prospects behind-the-scene to get to know your work on a more personal level.<\/p>\n\n\n\n<p>Take this video from Minnie Small, a freelance illustrator from south-east London, as an example:<\/p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe title=\"Creating a Client Illustration From Start To Finish · Behind the Scenes · ad\" width=\"500\" height=\"281\" src=\"https:\/\/www.youtube.com\/embed\/ShLUxJBMHvo?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe>\n<\/div><\/figure>\n\n\n\n<h3>2. Supercharge Your Cold Email Outreach With Personalized Videos<\/h3>\n\n\n\n<p>Landing new clients via cold emails is possible. With the right approach, cold email outreach can be an extremely effective tactic to land new contracts and grow your business.&nbsp;<\/p>\n\n\n\n<p>To get started, in addition to using a semi-personalized email template, you can record a short 30 seconds to 90 seconds long personalized video where you talk directly to the client, and explain the value you can offer. <a href=\"https:\/\/www.wordstream.com\/blog\/ws\/2017\/03\/08\/video-marketing-statistics\">Studies show<\/a> that an initial email with a video tends to have a click-through rate that is about 96% higher than those without.&nbsp;<\/p>\n\n\n\n<p>These videos don’t need to be well-crafted. You can record these using your webcam and send them to the client with minimum edits. Make sure to always end your video with a clear call-to-action. That can be a simple CTA, where you ask your prospect to respond to your email or schedule a free call with you.<\/p>\n\n\n\n<p>This strategy will not only help you boost your email open rates and response rates, but also will help you connect with your target client on a more personal level than a text email could ever do.<\/p>\n\n\n\n<p>To read more about perfecting your cold email outreach, check out this awesome guide to <a href=\"https:\/\/workspace.fiverr.com\/blog\/5-steps-to-write-cold-emails-that-convert-freelance-clients\/\">cold emails from freelancer Ryan Robinson<\/a>.<\/p>\n\n\n\n<h3>3. Host Live Q&amp;A Sessions<\/h3>\n\n\n\n<p>To grow and <a href=\"https:\/\/workspace.fiverr.com\/blog\/scale-your-freelance-business\/\">scale your freelance business<\/a>, you would need to brand yourself as an expert in your niche. Live Q&amp;A videos are a great way to establish yourself as a brand and an expert.<\/p>\n\n\n\n<p>There are several different variations on the “Question and Answer” (Q&amp;A) videos that you can use. You can record an interview or a talk with another micro-influencer or an expert in your niche. You can take questions from your followers or readers and answer them on video.&nbsp;<\/p>\n\n\n\n<p>To get started, host live Q&amp;A sessions or film regular discussion videos and put them up on your own YouTube and social media channels. Live video is a great way to not only promote yourself but to do so in an engaging way that invites participation from your audience. <a href=\"https:\/\/livestream.com\/blog\/live-video-statistics-livestream\">About 80% of people<\/a> say they would rather watch video from a brand than read a blog. Because you&#8217;re a freelancer, in this case, that brand is you.&nbsp;<\/p>\n\n\n\n<p>Here’s an example of this video marketing strategy in action, from Neil Patel:<\/p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe title=\"How to Find a Profitable Niche Market for Your Blog | Turn Your Passion into Profit with These Tips\" width=\"500\" height=\"281\" src=\"https:\/\/www.youtube.com\/embed\/EPaqxSoU2K0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe>\n<\/div><\/figure>\n\n\n\n<h3>4. Record Client Video Testimonials<\/h3>\n\n\n\n<p>There’s no doubt about it. Client testimonials are the most powerful way you can establish your authority and land new clients. The modern version of this practice is the video testimonial, which takes the effectiveness of client testimonials to the next level.<\/p>\n\n\n\n<p>To start making video testimonials, sit down with some of your existing, satisfied clients to record them talking about working with you. Effective client video testimonials aren’t all about the production value. You don’t need to make these videos highly-polished. More than anything else, you need a powerful story that creates an emotional connection between your prospects and the client in your testimonial. The aim of the video should be to show the value that you can bring to potential clients. Rather than simply telling a prospect what it is you do, you&#8217;re showing them the genuine impact you make that nobody else can. Not only is this the perfect chance to convey your message in a fresh and engaging new way, but it&#8217;s also a great way to <a href=\"https:\/\/workspace.fiverr.com\/blog\/8-strategic-ways-to-stand-out-from-your-freelance-competition\/\">stand out from all of your competitors<\/a>, too.<\/p>\n\n\n\n<p>Video testimonials are one of the most powerful marketing tools you have at your disposal to establish yourself as an expert and <a href=\"https:\/\/workspace.fiverr.com\/blog\/3-pillars-of-growing-your-freelance-business\/\">grow your freelance business<\/a>. You can use your video testimonials on your website, landing pages, portfolio, as well as your email outreach. The possibilities are endless.<\/p>\n\n\n\n<h3>5. Boost Your Impact by Turning your Videos into Blog Posts<\/h3>\n\n\n\n<p>When it comes to creating video content, most people would start from their blog, and work their way up from there, by turning their blog posts to videos. Though that’s an awesome way to boost your blog posts reach, there are instances where a topic is better discussed and talked about in a video. For that, every time you record a new video, <a href=\"https:\/\/workspace.fiverr.com\/blog\/start-freelance-writing\/\">write a blog<\/a> about it and post it on your website. You could also publish the video with the transcript. The goal here is to use every communication channel you have to promote your video.<\/p>\n\n\n\n<p>Derek Halpern of Social Triggers has an 80\/20 rule: 20% content creation, 80% promotion. That means for every hour you spend creating a video, you should spend four hours to promote that video.&nbsp;<\/p>\n\n\n\n<p>Blog posts that incorporate video tend to attract as many as <a href=\"https:\/\/www.wordstream.com\/blog\/ws\/2017\/03\/08\/video-marketing-statistics\">three times the number of inbound links<\/a> than those without. So by incorporating your video with a blog post, not only will you increase your reach, but you’ll also boost your website’s visibility on the search results pages.<\/p>\n\n\n\n<h3>6. Always End Your Videos With a Clear CTA<\/h3>\n\n\n\n<p>Call-to-actions are an essential part of your videos. Similar to what you would do in a blog or a landing page, make sure that all of your videos have a clear CTA at the end that informs your prospects not only what you want them to do, but how. This could be as simple as subscribing to your YouTube channel so that they always get additional content soon after you publish it, visiting your website, or scheduling a free consultation call to talk more about your work and what you can offer to your clients. Make sure that you always give people a direction, and they&#8217;ll likely follow it. <a href=\"https:\/\/youtu.be\/1JdnWgnJBIk\">Source<\/a><\/p>\n\n\n\n<h2>Incorporate Video into Your Marketing Strategy<\/h2>\n\n\n\n<p>These days, video marketing is absolutely one of the most powerful tools you have in your arsenal. Not only do people actually consume more of it than ever before, but as a communication format, it&#8217;s equal parts convincing, compelling and engaging—all of which are elements you need as much of as possible. <\/p>\n\n\n\n<p>None of this is to say that you should only leverage video content as a part of your marketing campaign. Naturally, other techniques like traditional SEO should still be applied to help you break into more profitable markets. But overall, video content can become the rock-solid foundation upon which the rest of your marketing campaign can be built. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Discover 6 ways to use video content to promote your freelance business &#8211; without needing to be an expert in video.<\/p>\n","protected":false},"author":10,"featured_media":8463,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[19],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to Use Video Marketing To Promote Your Freelance Work<\/title>\n<meta name=\"description\" content=\"Discover 6 ways to use video content to promote your freelance business - without needing to be an expert in video.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/workspace.fiverr.com\/blog\/video-marketing-promote-freelance-work\/\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"How to Use Video Marketing To Promote Your Freelance Work\" \/>\n<meta name=\"twitter:description\" content=\"Discover 6 ways to use video content to promote your freelance business - without needing to be an expert in video.\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Amir Shahzeidi\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How to Use Video Marketing To Promote Your Freelance Work","description":"Discover 6 ways to use video content to promote your freelance business - without needing to be an expert in video.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/workspace.fiverr.com\/blog\/video-marketing-promote-freelance-work\/","twitter_card":"summary_large_image","twitter_title":"How to Use Video Marketing To Promote Your Freelance Work","twitter_description":"Discover 6 ways to use video content to promote your freelance business - without needing to be an expert in video.","twitter_misc":{"Written by":"Amir Shahzeidi","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/workspace.fiverr.com\/#organization","name":"Fiverr","url":"https:\/\/workspace.fiverr.com\/","sameAs":[],"logo":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#logo","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","width":512,"height":512,"caption":"Fiverr"},"image":{"@id":"https:\/\/workspace.fiverr.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/workspace.fiverr.com\/#website","url":"https:\/\/workspace.fiverr.com\/","name":"Fiverr Workspace","description":"","publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/workspace.fiverr.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/blog\/video-marketing-promote-freelance-work\/#primaryimage","inLanguage":"en-US","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/workspace.fiverr.com\/blog\/video-marketing-promote-freelance-work\/#webpage","url":"https:\/\/workspace.fiverr.com\/blog\/video-marketing-promote-freelance-work\/","name":"How to Use Video Marketing To Promote Your Freelance Work","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/video-marketing-promote-freelance-work\/#primaryimage"},"datePublished":"2019-08-07T04:02:41+00:00","dateModified":"2022-01-04T09:24:29+00:00","description":"Discover 6 ways to use video content to promote your freelance business - without needing to be an expert in video.","breadcrumb":{"@id":"https:\/\/workspace.fiverr.com\/blog\/video-marketing-promote-freelance-work\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/workspace.fiverr.com\/blog\/video-marketing-promote-freelance-work\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/workspace.fiverr.com\/blog\/video-marketing-promote-freelance-work\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Fiverr Workspace","item":"https:\/\/workspace.fiverr.com\/"},{"@type":"ListItem","position":2,"name":"How to Use Video Marketing To Promote Your Freelance Work"}]},{"@type":["Article","BlogPosting"],"@id":"https:\/\/workspace.fiverr.com\/blog\/video-marketing-promote-freelance-work\/#article","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/blog\/video-marketing-promote-freelance-work\/#webpage"},"author":{"@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/472ce1961553e6d6a2f037bd7e2951d1"},"headline":"How to Use Video Marketing To Promote Your Freelance Work","datePublished":"2019-08-07T04:02:41+00:00","dateModified":"2022-01-04T09:24:29+00:00","mainEntityOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/video-marketing-promote-freelance-work\/#webpage"},"wordCount":1839,"publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"image":{"@id":"https:\/\/workspace.fiverr.com\/blog\/video-marketing-promote-freelance-work\/#primaryimage"},"thumbnailUrl":"","articleSection":["GROWING YOUR BUSINESS"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/472ce1961553e6d6a2f037bd7e2951d1","name":"Amir Shahzeidi","image":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cc0e8f62a3c531e6717a7434c60c3422?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cc0e8f62a3c531e6717a7434c60c3422?s=96&d=mm&r=g","caption":"Amir Shahzeidi"},"description":"Amir is the digital marketing manager at Uscreen, a video monetization platform that allows content creators to distribute and monetize their videos online via video websites and OTT apps."}]}},"_links":{"self":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/6917"}],"collection":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/users\/10"}],"replies":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/comments?post=6917"}],"version-history":[{"count":0,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/6917\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media?parent=6917"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/categories?post=6917"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/tags?post=6917"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}