{"id":6972,"date":"2020-11-25T22:16:38","date_gmt":"2019-09-06T14:24:16","guid":{"rendered":"https:\/\/www.and.co\/blog\/?p=6972"},"modified":"2022-03-27T08:10:56","modified_gmt":"2022-03-27T08:10:56","slug":"8-skills-to-master-your-first-30-days-freelancer","status":"publish","type":"post","link":"https:\/\/workspace.fiverr.com\/blog\/8-skills-to-master-your-first-30-days-freelancer\/","title":{"rendered":"8 Skills you&#039;ll have to master in your first 30 days as a freelancer"},"content":{"rendered":"\n<p>Taking the leap into freelancing is exhilarating! You’re (finally) going to be your own boss. Your destiny is now 100% in your hands. It’s you against the world—and you’re ready to crush it.<\/p>\n\n\n\n<p>And while it’s an absolute adrenaline rush, once the reality of what you’ve done sinks in, it can also be a bit overwhelming.<\/p>\n\n\n\n<p>Why? Because all of a sudden you’ve (most likely) gone from being a cog in a large machine to running an entire operation on your own.<\/p>\n\n\n\n<p>Along with this newfound freedom comes a lot of new responsibilities and probably quite a few new skill sets.<\/p>\n\n\n\n<p>So if you’re considering making the move to freelancing (full-time or on the side), here are 8 skills you’ll need to be prepared to master in your first 30 days.<\/p>\n\n\n\n<h2>1. Finding consistent freelance work<\/h2>\n\n\n\n<p>It may seem obvious, but in your first 30 days as a freelancer, you’ll want to focus a huge amount of your time and energy on finding freelance clients.<\/p>\n\n\n\n<p>There are dozens of different ways you can go about this, but here are some of the best options I’ve seen implemented in my 10+ years working with freelancers:<\/p>\n\n\n\n<h3>Tapping into your existing network<\/h3>\n\n\n\n<p>Ask just about any freelancer and they’ll tell you their #1 way of finding new clients is word-of-mouth.<\/p>\n\n\n\n<p>Of course, getting word-of-mouth referrals can be pretty tough when you don’t have any clients at all: it’s a bit of a chicken-and-egg situation.<\/p>\n\n\n\n<p>When you don’t have an existing client base you can get referrals from, the next best option (and it’s a pretty good one) is to tap into your own personal networks and social groups.<\/p>\n\n\n\n<p>Tell your most trusted friends and family members what you’re working on and ask them if they know anyone that might need your services. You’ll be surprised what will come out of the woodwork just by talking to people frequently about your new freelancing endeavors.<\/p>\n\n\n\n<p>If you find your personal network is a bit slim, you can try joining social media groups where clients reach out to freelancers or where freelancers exchange gigs.&nbsp;<\/p>\n\n\n\n<p>Start with our list of <a href=\"https:\/\/workspace.fiverr.com\/blog\/19-freelance-writing-job-and-community-goldmines\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"19 freelance job community gold mi (opens in a new tab)\">19 freelance job community gold mi<\/a><a href=\"https:\/\/workspace.fiverr.com\/blog\/19-freelance-writing-job-and-community-goldmines\/\">nes<\/a> and start making connections that can lead to eventual work.<\/p>\n\n\n\n<h3>Searching high-quality freelance job sites<\/h3>\n\n\n\n<p>While tapping into your network is a great long-term strategy, it can take a while before you reap the rewards of your efforts in that avenue.&nbsp;<\/p>\n\n\n\n<p>If you’re ready to start freelancing right now, then you don’t have time to wait. You need clients now.<\/p>\n\n\n\n<p>For quicker results, learn how to effectively navigate <a href=\"https:\/\/millo.co\/freelance-job-sites\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"freelance job websites (opens in a new tab)\">freelance job websites<\/a> where clients are actively posting freelance jobs and looking for a candidate.<\/p>\n\n\n\n<p>For starters, <a href=\"https:\/\/fiverr.com\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"try Fiverr (opens in a new tab)\">try Fiverr<\/a> where thousands of clients and freelancers get connected every single day for small, medium, or large tasks in every industry.<\/p>\n\n\n\n<h3>Sending well-crafted cold emails<\/h3>\n\n\n\n<p>If tapping into your personal network and searching freelance job websites still leaves you empty-handed, you’ll have to get even more proactive.<\/p>\n\n\n\n<p>That means sending well-crafted cold emails that are likely to get open, read and replied to.&nbsp;<\/p>\n\n\n\n<p>Cold-emailing can be extremely labor-intensive and time-consuming. To speed things up and increase your success rate, review our <a href=\"https:\/\/workspace.fiverr.com\/blog\/5-steps-to-write-cold-emails-that-convert-freelance-clients\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"5 steps for writing successful cold emails (opens in a new tab)\">5 steps for writing successful cold emails<\/a>.<\/p>\n\n\n\n<h2>2. Selling yourself to clients<\/h2>\n\n\n\n<p>Whether you’re pitching via email or some other way, learning how to <a href=\"https:\/\/workspace.fiverr.com\/blog\/how-to-write-article-pitches\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"pitch clients effectively (opens in a new tab)\">pitch clients effectively<\/a> is the second most critical skill you’ll need to master in your first 30 days as a freelancer.<\/p>\n\n\n\n<p>But selling can be really scary—often causing freelancers to freeze, give up, or completely blow any chance they had with a new client.<\/p>\n\n\n\n<h3>Why most people cringe at the word “sales”<\/h3>\n\n\n\n<p>Of course, there’s a natural tendency for some people to shy away from sales. Their image of salesmanship has been tainted by door-to-door pest control salesmen, spammy online sales funnels, or pushy car dealerships.<\/p>\n\n\n\n<p>It doesn’t have to be that way.&nbsp;<\/p>\n\n\n\n<p>In fact, the best salespeople aren’t pushy. They aren’t rude. And they understand what author Michael Gerber said:&nbsp;<\/p>\n\n\n\n<p>“Most salespeople think that selling is ‘closing.’ It isn’t. Selling is opening.”&nbsp;<\/p>\n\n\n\n<p>As you genuinely want to serve and help the potential clients you reach out to, your genuineness and kindness will shine through.&nbsp;<\/p>\n\n\n\n<p>Entire libraries can be filled with advice on selling yourself, but as you ramp up your freelancing, here are three quick ways to make good progress toward being a top-notch salesman for your business.<\/p>\n\n\n\n<h3>Learn the basics of sales and persuasion<\/h3>\n\n\n\n<p>If you’ve never done any part of selling or persuasive writing\/speaking, then you should start there.<\/p>\n\n\n\n<p>Whether you prefer to check out a book from your local library, listen to a podcast,&nbsp; watch a basic sales course on Udemy, or attend a training seminar, their may be no better investment you can make in your freelance business than learning how to sell yourself.<\/p>\n\n\n\n<h3>Study history’s best salespeople<\/h3>\n\n\n\n<p>There’s no shortage of talented salespeople who’ve won awards for their ability to connect with their audience and eventually sell them something worthwhile.<\/p>\n\n\n\n<p>A quick search for experts like David Ogilvy or Tiffani Bova will give you zillions of results to study at your leisure.<\/p>\n\n\n\n<p>One of my favorite thought-leaders in the world of selling is the legendary Zig Ziglar.&nbsp;<\/p>\n\n\n\n<p>To get a taste of his talent, read <a rel=\"noreferrer noopener\" aria-label=\"this excellent article (opens in a new tab)\" href=\"https:\/\/blog.getbase.com\/the-zig-ziglar-school-of-sales-how-to-overcome-5-basic-sales-obstacles\" target=\"_blank\">this excellent article<\/a> recapping Ziglar’s responses to the 5 most common sales roadblocks.&nbsp;<\/p>\n\n\n\n<p>No doubt, you’ll hear the above objections as you reach out to new clients.<\/p>\n\n\n\n<h3>Practice, practice, practice<\/h3>\n\n\n\n<p>No amount of theory and studying can give you quicker results than old fashioned practice can.<\/p>\n\n\n\n<p>Once you’ve got a basic idea of how you’ll present yourself, how you’ll respond to basic objections, and what you’ll say to authentically connect with your potential clients, give it a try.<\/p>\n\n\n\n<p>If you’re nervous, test it out on family members or friends.&nbsp;<\/p>\n\n\n\n<p>If you want a better experience, pick up the phone or send an email to some of the “less important” potential clients you’ve identified. Learning the ropes on these kinds of clients helps you practice so when you call up your dream client, you’re ready.<\/p>\n\n\n\n<h2>3. Negotiating like a pro (and not a jerk)<\/h2>\n\n\n\n<p>It happens all the time when pitching your services to a new client: they try to squeeze a little more work out of you or bring your price down.<\/p>\n\n\n\n<p>In your first 30 days of freelancing, you’ll want to practice your negotiation skills—a talent that will pay off throughout your freelancing career.<\/p>\n\n\n\n<p>Negotiating doesn’t mean you have to be a jerk, or get angry and frustrated with a potential client.<\/p>\n\n\n\n<p>Keep in mind: for some, negotiating is a fun challenge or even a game. As a freelancer, you can hold your ground and negotiate like a pro with <a href=\"https:\/\/workspace.fiverr.com\/blog\/negotiaton-tips-entrepreneurs-freelancers\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"our top negotiation tips for freelancers and entrepreneurs (opens in a new tab)\">our top negotiation tips for freelancers and entrepreneurs<\/a>.<\/p>\n\n\n\n<h3>How much should you charge?<\/h3>\n\n\n\n<p>As a brand-new freelancer, it can be really difficult to <a rel=\"noreferrer noopener\" aria-label=\"identify how much you should charge (opens in a new tab)\" href=\"https:\/\/workspace.fiverr.com\/blog\/how-to-price-your-freelance-services-for-more-revenue-and-less-headaches\" target=\"_blank\">identify how much you should charge<\/a> for your services.<\/p>\n\n\n\n<p>While there are lots of great freelance rate calculators out there, I’ve found there are far too many variables including where you live, how many people you support, how anxious you are to leave your day job, how willing you are to eat Ramen noodles while you’re getting started, etc.<\/p>\n\n\n\n<p>My best advice is to pick a number you feel only slightly uncomfortable with. Once you have a few clients that are willing to pay that price, raise it. Then keep raising it until you get significant push-back from potential new clients.<\/p>\n\n\n\n<p>The market will tell you when you’ve gone too high. But until then, keep raising those rates!<\/p>\n\n\n\n<h3>A note about “not giving in”<\/h3>\n\n\n\n<p>Many experienced freelancers will tell you not to “give in” and lower your prices when a client starts negotiating.&nbsp;<\/p>\n\n\n\n<p>While I see where these more advanced freelancers are coming from, this advice can literally kill a brand-new freelancer.<\/p>\n\n\n\n<p>If your goal is to freelance full-time, you need to get clients and revenue in the door. Don’t let stubbornness or pride get in the way of a sound business decision.<\/p>\n\n\n\n<p>Negotiation master Herb Cohen coined the term “win-win negotiation” which essentially means the best negotiations end with both parties thinking they’ve “won.”&nbsp;<\/p>\n\n\n\n<p>Here’s what that might look like from a practical point of view for a new freelancer:<\/p>\n\n\n\n<p>If you expect you’ll get a lot of pushback on price, then add an extra 30% to your initial bid. Then, when they “talk you down” to your original price, they’ll feel like they’ve won by saving 30% and you’ll feel like you’ve won by booking a new client.<\/p>\n\n\n\n<p>Win-win.<\/p>\n\n\n\n<h2>4. Knowing when to say “yes” to a project<\/h2>\n\n\n\n<p>While your primary goal in the first 30 days of freelancing is to bring on new work—most likely just about <em>any<\/em> work you can find, it’s still important to understand how to evaluate each freelance job as it comes your way.<\/p>\n\n\n\n<p>This is critical because the clients you join with and the projects you take on in your first 30 days can have a lasting impact on your business.<\/p>\n\n\n\n<p>Why?&nbsp;<\/p>\n\n\n\n<p>The projects you complete as a new freelancer will likely fill your portfolio—which you’ll use to get more (similar) work. If you take projects you don’t <em>want<\/em> more of, then you’ve wasted that opportunity.<\/p>\n\n\n\n<p>The clients you work with will be your best source of referrals. But if you don’t like the clients you work with, why would you also want to work with their friends?<\/p>\n\n\n\n<p>The industries you work in will help you establish a niche in the marketplace. But if you take odd jobs in any industry, you lose your appeal. As the saying goes: if you try to please everyone, you please no one.<\/p>\n\n\n\n<p>Learn how to say “yes” (or “no”) to a potential client or project in your first 30 days as a freelancer.<\/p>\n\n\n\n<h2>5. Closing a deal<\/h2>\n\n\n\n<p>Not only do you need to know how to recognize the right opportunities and negotiate properly with potential clients, you should also know how to close a deal.<\/p>\n\n\n\n<p>In other words, you need to know how to get a client to officially agree to a new project.<\/p>\n\n\n\n<p>Never-ending email chains or non-committal telephone calls can kill your productivity (and morale) quicker than just about anything when you’re getting started.<\/p>\n\n\n\n<p>Don’t be afraid to use direct “yes”-focused phrases in your communication such as:<\/p>\n\n\n\n<ul><li>“So we agree? Let’s get started on this project.”<\/li><li>“Can I send a <a href=\"https:\/\/workspace.fiverr.com\/proposals\/\" target=\"_blank\" rel=\"noreferrer noopener\">proposal<\/a> or <a aria-label=\"contract (opens in a new tab)\" href=\"https:\/\/workspace.fiverr.com\/blog\/freelance-contract-clauses\/\" target=\"_blank\" rel=\"noreferrer noopener\">contract<\/a> over so we can get started right away?”<\/li><li>“Great. Let’s move forward, should we?”<\/li><\/ul>\n\n\n\n<p>For more on closing the deal, <a href=\"https:\/\/business.tutsplus.com\/tutorials\/how-freelancers-can-close-the-deal-without-seeming-too-pushy--cms-25197\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"here’s Envato’s best advice  (opens in a new tab)\">here’s Envato’s best advice <\/a>for closing a freelance deal without seeming pushy.<\/p>\n\n\n\n<h2>6. Writing and sending an invoice<\/h2>\n\n\n\n<p>Once you’ve found a job, negotiated the terms, closed the deal, and you’re ready to start working you need to send your potential client an invoice.<\/p>\n\n\n\n<p>Learning how to draft an invoice the right way will help you:<\/p>\n\n\n\n<ul><li>Look professional<\/li><li>Manage expectations<\/li><li>Get paid (and stay in business)<\/li><\/ul>\n\n\n\n<p>If you’ve never written an invoice before, try reading Millo’s article: <a href=\"https:\/\/millo.co\/how-to-write-an-invoice\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"How to write an invoice (and get paid) in 5 simple steps. (opens in a new tab)\">How to write an invoice (and get paid) in 5 simple steps.<\/a>&nbsp;<\/p>\n\n\n\n<p>You should also use AND.CO to generate invoices that are slick, simple, and payable as soon as your client receives it.&nbsp;<\/p>\n\n\n\n<p>The AND.CO <a rel=\"noreferrer noopener\" aria-label=\"invoice tool (opens in a new tab)\" href=\"https:\/\/workspace.fiverr.com\/invoicing\" target=\"_blank\">invoice tool<\/a> generates perfect invoices in 20 seconds or less, allows you to accept payments directly on the invoice itself, and (get this!) even reminds a client to pay their invoice if it’s overdue.<\/p>\n\n\n\n<p>Or you can create your invoice manually <a href=\"https:\/\/workspace.fiverr.com\/free-invoice-generator\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"here (opens in a new tab)\">here<\/a>.<\/p>\n\n\n\n<h2>7. Delivering a project on-time and as-promised<\/h2>\n\n\n\n<p>Freelancers have a bad reputation in some industries for being consistently late on their project deliveries.<\/p>\n\n\n\n<p>Don’t feed that stereotype.<\/p>\n\n\n\n<p>In addition to Fiverr’s tips for avoiding late deliveries, here are two ways to ensure you get your client’s work to them on time:<\/p>\n\n\n\n<h3>Build in a buffer<\/h3>\n\n\n\n<p>Since you’re new to freelancing, it’s possible some tasks that didn’t used to take as long at your desk job now take much longer.<\/p>\n\n\n\n<p>Why’s that? Because you’re also wearing hundreds of other hats in your business, trying to juggle the administration of your business with the actual client work that needs to get done.<\/p>\n\n\n\n<p>To solve that, build in buffers in your timeline.<\/p>\n\n\n\n<p>If you think a project is most likely going to take a week to complete, tell your client it’ll take 10 days.&nbsp;<\/p>\n\n\n\n<p>Then, when you need 8 days to complete it, they’ll be utterly surprised and delighted when you deliver the project 2 days early. If you had quoted them 7 days and delivered in 8, they would have been upset.<\/p>\n\n\n\n<p>Magic.<\/p>\n\n\n\n<h3>Stick to the scope<strong>&nbsp;<\/strong><\/h3>\n\n\n\n<p>What you’ll soon learn about freelancing is this: few clients ever stick to the original scope of the project you agreed to.<\/p>\n\n\n\n<p>We call this <a rel=\"noreferrer noopener\" aria-label=\"scope creep (opens in a new tab)\" href=\"https:\/\/freelanceconference.com\/2019\/04\/how-to-squash-scope-creep\/\" target=\"_blank\">scope creep<\/a>.<\/p>\n\n\n\n<p>They always have some new idea or concern that adds to the total time and effort you have to put into a project.<\/p>\n\n\n\n<p>While making the client happy is your top priority, there’s nothing wrong with encouraging them to stick to the original budget and timeline.<\/p>\n\n\n\n<p>Of course, if a client wants to pay you more or extend the timeline, by all means: accept the extra money and work.<\/p>\n\n\n\n<h2>8. Upselling your client<\/h2>\n\n\n\n<p>Finally, if you’re going to survive beyond your first 30 days as a freelancer, you may want to learn <a rel=\"noreferrer noopener\" aria-label=\"how to upsell your client (opens in a new tab)\" href=\"https:\/\/logogeek.uk\/logo-design\/10-upsells\/\" target=\"_blank\">how to upsell your client<\/a>.<\/p>\n\n\n\n<p>Upselling, in its most basic form, means finding creative ways to get a little more revenue from each project or each client.<\/p>\n\n\n\n<p>You’ve seen this in action when you get asked “would you like fries with that?” or if you’d like to upgrade your airplane seat for just $30 more.<\/p>\n\n\n\n<p>There are lots of ways to upsell a freelance client, but here are two that have worked well for me in the past:<\/p>\n\n\n\n<h3>Add a complementary service<\/h3>\n\n\n\n<p>First, try adding a complementary service to your offering.<\/p>\n\n\n\n<p>This is not to be confused with a complimentary (with an “i”) service—in other words, free.<\/p>\n\n\n\n<p>Instead offer something of value that enhances and adds to your original offer.<\/p>\n\n\n\n<p>If you’re a writer, for example, you might offer to add quality images and charts to your article for only $50 more.<\/p>\n\n\n\n<h3>Offer a recurring discount<\/h3>\n\n\n\n<p>While offering a discount isn’t always the best idea, doing so in exchange for predictable work can be life-changing for a young freelancer.&nbsp;<\/p>\n\n\n\n<p>If your client is happy with the $200 graphics you designed for their Instagram account, offer to design a new one weekly for $175 each if they’ll commit to 6 months of work.&nbsp;<\/p>\n\n\n\n<p>The client gets a deal and you sleep a little easier at night. Plus, you don’t have to start over completely every month wondering where you’ll find your next client.<\/p>\n\n\n\n<h2>The reality about your first 30 days as a freelancer<\/h2>\n\n\n\n<p>Even after reading this full article and all the resources included in it, the reality is: your first 30 days as a freelance will most likely (1) fly by and (2) be pretty sloppy.<\/p>\n\n\n\n<p>That’s ok.<\/p>\n\n\n\n<p>Freelancing is a learning process. You’re embarking on a journey most people never dare take and, if you stick with it, you’ll figure it out!<\/p>\n\n\n\n<p>If you take the time to review the skills outlined in this article, you’ll be a step ahead of the competition and your first 30 days (and beyond) will be some of the best you’ve ever experienced.<\/p>\n\n\n\n<p>You’ve got this, fellow freelancer. Good luck!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Taking the leap into freelancing is exhilarating! You’re (finally) going to be your own boss. Your destiny is now 100% in your hands. It’s you against<\/p>\n","protected":false},"author":110,"featured_media":11400,"comment_status":"closed","ping_status":"closed","sticky":true,"template":"","format":"standard","meta":[],"categories":[2],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>8 Skills you&#039;ll have to master in your first 30 days as a freelancer<\/title>\n<meta name=\"description\" content=\"If you’re considering making the move to freelancing (full-time or on the side), here are 8 skills you’ll need to be prepared to master in your first 30 days.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/workspace.fiverr.com\/blog\/8-skills-to-master-your-first-30-days-freelancer\/\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"8 Skills you&#039;ll have to master in your first 30 days as a freelancer\" \/>\n<meta name=\"twitter:description\" content=\"If you’re considering making the move to freelancing (full-time or on the side), here are 8 skills you’ll need to be prepared to master in your first 30 days.\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/JjvjU3sw-1024x492-1-1.webp\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Preston Lee\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"12 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"8 Skills you'll have to master in your first 30 days as a freelancer","description":"If you’re considering making the move to freelancing (full-time or on the side), here are 8 skills you’ll need to be prepared to master in your first 30 days.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/workspace.fiverr.com\/blog\/8-skills-to-master-your-first-30-days-freelancer\/","twitter_card":"summary_large_image","twitter_title":"8 Skills you'll have to master in your first 30 days as a freelancer","twitter_description":"If you’re considering making the move to freelancing (full-time or on the side), here are 8 skills you’ll need to be prepared to master in your first 30 days.","twitter_image":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/JjvjU3sw-1024x492-1-1.webp","twitter_misc":{"Written by":"Preston Lee","Est. reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/workspace.fiverr.com\/#organization","name":"Fiverr","url":"https:\/\/workspace.fiverr.com\/","sameAs":[],"logo":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#logo","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","width":512,"height":512,"caption":"Fiverr"},"image":{"@id":"https:\/\/workspace.fiverr.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/workspace.fiverr.com\/#website","url":"https:\/\/workspace.fiverr.com\/","name":"Fiverr Workspace","description":"","publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/workspace.fiverr.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/blog\/8-skills-to-master-your-first-30-days-freelancer\/#primaryimage","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/JjvjU3sw-1024x492-1-1.webp","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/JjvjU3sw-1024x492-1-1.webp","width":1024,"height":492},{"@type":"WebPage","@id":"https:\/\/workspace.fiverr.com\/blog\/8-skills-to-master-your-first-30-days-freelancer\/#webpage","url":"https:\/\/workspace.fiverr.com\/blog\/8-skills-to-master-your-first-30-days-freelancer\/","name":"8 Skills you'll have to master in your first 30 days as a freelancer","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/8-skills-to-master-your-first-30-days-freelancer\/#primaryimage"},"datePublished":"2019-09-06T14:24:16+00:00","dateModified":"2022-03-27T08:10:56+00:00","description":"If you’re considering making the move to freelancing (full-time or on the side), here are 8 skills you’ll need to be prepared to master in your first 30 days.","breadcrumb":{"@id":"https:\/\/workspace.fiverr.com\/blog\/8-skills-to-master-your-first-30-days-freelancer\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/workspace.fiverr.com\/blog\/8-skills-to-master-your-first-30-days-freelancer\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/workspace.fiverr.com\/blog\/8-skills-to-master-your-first-30-days-freelancer\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Fiverr Workspace","item":"https:\/\/workspace.fiverr.com\/"},{"@type":"ListItem","position":2,"name":"8 Skills you&#039;ll have to master in your first 30 days as a freelancer"}]},{"@type":["Article","BlogPosting"],"@id":"https:\/\/workspace.fiverr.com\/blog\/8-skills-to-master-your-first-30-days-freelancer\/#article","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/blog\/8-skills-to-master-your-first-30-days-freelancer\/#webpage"},"author":{"@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/93abecc3e7c99b3d39eb331cc36558ae"},"headline":"8 Skills you&#039;ll have to master in your first 30 days as a freelancer","datePublished":"2019-09-06T14:24:16+00:00","dateModified":"2022-03-27T08:10:56+00:00","mainEntityOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/8-skills-to-master-your-first-30-days-freelancer\/#webpage"},"wordCount":2644,"publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"image":{"@id":"https:\/\/workspace.fiverr.com\/blog\/8-skills-to-master-your-first-30-days-freelancer\/#primaryimage"},"thumbnailUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/JjvjU3sw-1024x492-1-1.webp","articleSection":["Freelance knowledge"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/93abecc3e7c99b3d39eb331cc36558ae","name":"Preston Lee","image":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cdd223e61a05b88bc936adf70f54ee73?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cdd223e61a05b88bc936adf70f54ee73?s=96&d=mm&r=g","caption":"Preston Lee"},"description":"Preston Lee is the founder of Millo where he and his team help freelancers find remote work so they can live anywhere and do work they love. If you’re ready to take the leap into freelancing, join their community of freelancers at Millo.co.","sameAs":["https:\/\/millo.co\/"]}]}},"_links":{"self":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/6972"}],"collection":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/users\/110"}],"replies":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/comments?post=6972"}],"version-history":[{"count":0,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/6972\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media\/11400"}],"wp:attachment":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media?parent=6972"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/categories?post=6972"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/tags?post=6972"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}