{"id":7182,"date":"2020-11-25T22:16:41","date_gmt":"2019-11-27T19:13:13","guid":{"rendered":"https:\/\/www.and.co\/blog\/?p=7182"},"modified":"2022-03-28T09:24:22","modified_gmt":"2022-03-28T09:24:22","slug":"business-ideas-for-freelancers","status":"publish","type":"post","link":"https:\/\/workspace.fiverr.com\/blog\/business-ideas-for-freelancers\/","title":{"rendered":"5 Business Ideas for Freelancers"},"content":{"rendered":"\n<p>If you’re a freelancer, you most likely enjoy the amount of flexibility you have, <em>especially<\/em> when compared to a typical 9-5.&nbsp;&nbsp;<br><\/p>\n\n\n\n<p>You get to work from home, from cafes, and even pantless (Don’t give me that look, I know you’ve done it). Basically, you&#8217;re your own boss.<br><br>But there’s one catch: The minute you stop freelancing, you stop making money.<br><\/p>\n\n\n\n<p>For this reason, it’s a good idea to diversify your income, <em>especially <\/em>because freelancing offers <em>a ton <\/em>of flexibility and experience that can be further leveraged to start a business. <br><br>In fact, freelancing has allowed me to scale from writer to consultant and business owner (which brings in over 5 figures) in just a year <a href=\"https:\/\/www.dherealmark.com\/life-after-graduation\/\">after my graduation.&nbsp;<\/a><br><\/p>\n\n\n\n<p>But what business should you start?<br><\/p>\n\n\n\n<p>Well, there are many ways to start your journey to being self employed but it’s a good idea to reverse engineer people that have already done it (for inspiration).<br><\/p>\n\n\n\n<p>So I’ve reached out to freelancers that have scaled to business owners to understand what worked (and what didn’t work) for them.&nbsp;<br><\/p>\n\n\n\n<ol><li>Create information products<\/li><li>Make money from client recommendations<\/li><li>Provide an expert consultancy service<\/li><li>Start a digital marketing agency<\/li><li>Coach people that want to be like you<strong>&nbsp;&nbsp;<\/strong><\/li><\/ol>\n\n\n\n<p>(Spoiler alert: All these people started out as freelancers).<\/p>\n\n\n\n<h2>1. <strong>Create information products<\/strong><\/h2>\n\n\n\n<p>As a freelancer, you will possess valuable expertise and knowledge—and this know-how can be leveraged to create information products.<br><\/p>\n\n\n\n<p>An information product is any form of digital products that shares knowledge with the purpose of educating the user in that area.&nbsp;<br><\/p>\n\n\n\n<p>While having technical knowledge might be something you don’t even think about anymore, selling it in the form of info products requires basic groundwork. But it’s worth the effort you put in.<br><\/p>\n\n\n\n<p>Here are some perks to selling info products online:<br><\/p>\n\n\n\n<ol><li><strong>Easy and cheap to sell: <\/strong>the investment surrounding info products is very low. Most of what you’ll be spending is your mental energy to form ideas that you can sell over a digital medium, hence, reducing your financial risks.&nbsp;<\/li><li><strong>Free storage costs: <\/strong>your info products basically have free storage, unlike physical goods that require warehouses. You can store large amounts of data on the cloud and have multiple platforms to choose from.&nbsp;<\/li><li><strong>A huge market: <\/strong>you have a global audience at your fingertips and it&#8217;s easier to find a niche you can target online with information available at your disposal.<\/li><li><strong>High margins: <\/strong>selling info products limits most, if not all, of your costs to the digital world, making for a tempting ROI.&nbsp;<\/li><\/ol>\n\n\n\n<h3><strong>Case: Adam Enfroy’s Attractive Info Products<\/strong><br><\/h3>\n\n\n\n<p><a href=\"https:\/\/adamenfroy.com\">Ad<\/a><a href=\"https:\/\/adamenfroy.com\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"am Enfroy (opens in a new tab)\">am Enfroy<\/a>, a digital marketer grew his blog to over 150k monthly readers and leverage his expertise as a blogger to create info-products (think: link building and affiliate blueprint).&nbsp;<br><\/p>\n\n\n\n<p>These infographics work great for Adam’s audience and more importantly, they’re an easy way to bring in some passive income. <br><br>To give you an idea, if 100 people bought Adam’s info-products, that would amount to a cool 3,900 bucks (And he has 150k visitors).&nbsp;<br><\/p>\n\n\n\n<p>Similarly you can leverage, your know-how to easily create info-products and benefit from giving your audience <em>real<\/em> value. <\/p>\n\n\n\n<p>Source: <a href=\"https:\/\/www.adamenfroy.com\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Adamenfroy.com (opens in a new tab)\">Adamenfroy.com<\/a><\/p>\n\n\n\n<p>The files are uploaded and hosted on <a rel=\"noreferrer noopener\" aria-label=\"BigCommerce (opens in a new tab)\" href=\"https:\/\/www.bigcommerce.com\/\" target=\"_blank\">BigCommerce<\/a>, and sync to his <a href=\"https:\/\/wordpress.org\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"WordPress (opens in a new tab)\">WordPress<\/a> site via an API. Like physical products, info products have product pages, including a title, images, a description, reviews, and a buy now button.&nbsp;<br><\/p>\n\n\n\n<p>However, instead of being shipped, these products are simply downloaded as zip files, making it a whole lot easier to generate revenue with less work once they’re created.&nbsp;<br><\/p>\n\n\n\n<p><strong>Here are the steps to get started with informational products:<\/strong><br><\/p>\n\n\n\n<ol><li>Choose an <a rel=\"noreferrer noopener\" aria-label=\"ecommerce platform (opens in a new tab)\" href=\"https:\/\/www.bigcommerce.com\/blog\/ecommerce-website-builders\/\" target=\"_blank\">ecommerce platform<\/a> to host your digital products.<\/li><li>Decide which type of files you are going to create &#8211; this could be a PDF, spreadsheet, Word document, ebook, or bundle of files.<\/li><li>Create your info product. Either design it yourself or leverage another freelancer on a site like <a href=\"https:\/\/fiverr.com\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Fiverr (opens in a new tab)\">Fiverr<\/a>.<\/li><li>Upload your digital product to your website and enter all of the required information.<\/li><li>Promote your digital product on your website by adding it to the menu navigation and your welcome email series.<\/li><\/ol>\n\n\n\n<h2>2. <strong>Make money from client recommendations<\/strong><\/h2>\n\n\n\n<p>Another simple way to start a business is to make money from client recommendations.<br><\/p>\n\n\n\n<p>Let’s say you’re a copywriter but your client expresses that they also need help with web design, social media, etc.&nbsp;<br><\/p>\n\n\n\n<p>You can still jump right in and give them recommendations—and you can also earn a sweet commission on the side i.e. affiliate commision.&nbsp;<br><\/p>\n\n\n\n<p>Affiliate marketing is where you make money selling other people’s digital products (sometimes physical but usually digital) through your affiliate link. The fundamentals are pretty simple, but there are certain tricks you can apply to increase your earnings. You can find a comprehensive guide to <a href=\"https:\/\/launchspace.net\/blog\/affiliate-marketing\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"affiliate marketing here (opens in a new tab)\">affiliate marketing here<\/a>.<br><\/p>\n\n\n\n<h3><strong>Case: Hailey Lucas, Digital Marketer&nbsp;<\/strong><br><\/h3>\n\n\n\n<p><a aria-label=\"Hailey Lucas (opens in a new tab)\" href=\"https:\/\/haileylucas.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Hailey Lucas<\/a>, a digital marketer and freelancer, runs her own blog providing tips on how to become a successful freelancer. <br>Source: <a aria-label=\"Hailey Lucas’ blog (opens in a new tab)\" href=\"https:\/\/haileylucas.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Hailey Lucas’ blog<\/a><br><\/p>\n\n\n\n<p>Providing expertise into organic marketing strategies, she also has insights into the area of affiliate marketing.&nbsp;<br><\/p>\n\n\n\n<p>“Being able to act as a consultant to your clients and connecting them to the other services they need really increases retention rate by 100%,” Hailey says.&nbsp;<br><\/p>\n\n\n\n<p>How can you make this additional revenue through affiliate marketing? Here’s Hailey’s advice: <strong>partner with marketing agencies in your niche.&nbsp;<\/strong><br><\/p>\n\n\n\n<p>Find someone who you can trust your clients with and negotiate a percentage that you both find fair for all business that you send them. This can be from 10% to even 50%. For your best shot, try and negotiate a residual commission deal with the agency.<br><\/p>\n\n\n\n<p>From Hailey’s experience, agencies never want to turn down additional business and it’s a win-win for both parties.&nbsp;<br><\/p>\n\n\n\n<p>By utilizing your existing network and helping your clients in the process, they don’t have to go seeking out and interviewing multiple service providers. You can also count on those clients sending lots of referrals for being helpful and a great connector!<br><\/p>\n\n\n\n<p><strong>Here are the steps to follow to get started:<\/strong>&nbsp;<br><\/p>\n\n\n\n<ol><li>Connect with CEOs\/founders\/owners of the partnerships you want<strong>: <\/strong>make the time to introduce yourself and your value proposition&nbsp;<\/li><li>Negotiate a fair commission rate<\/li><li>Start utilizing your existing client roster. For all future clients, be sure to assess all their needs and identify other opportunities for services that your agency partner can provide<\/li><li>Start earning additional revenue and\/or passive income<\/li><li>Repeat the process for more success!<br><\/li><\/ol>\n\n\n\n<h2>3. <strong>Provide an expert consultancy service<\/strong><\/h2>\n\n\n\n<p>Are you aware of your core-competency real value? A skill that you can sell to people for good money? Are you an expert in a field that can provide insights and guidance to prospects?<br><\/p>\n\n\n\n<p>Being a consultant is a good way to go. With the Internet on your side, running an online consultancy business has never been easier.&nbsp;<br><\/p>\n\n\n\n<p>If you are looking to draw an income without large capital investments like an office, consultancy is for you. Margins are high as less money is tied up in physical assets.&nbsp;<br><\/p>\n\n\n\n<p>The greatest asset you have to sell here is <strong>your mind<\/strong>.&nbsp;<br><\/p>\n\n\n\n<p>But first you need to have a suitable client base, which might be challenging..<br><\/p>\n\n\n\n<p>You have to prove your expertise and form a trustworthy relationship with your customers.Then slowly scale up from there.&nbsp;<br><\/p>\n\n\n\n<p>Ask yourself these questions before considering an online consultancy business:<br><\/p>\n\n\n\n<ol><li>Do I have marketable skills and expertise that I can transform into a service?<\/li><li>Will this add value to my clients? Am I capable of providing solutions?<\/li><li>Do I have a feasible strategy to attract clients? Is there a market niche I can exploit?<\/li><\/ol>\n\n\n\n<p>If you answered yes, then you’re on the right track to building your path as a self-employed consultant.<br><\/p>\n\n\n\n<h3><strong>Case: Jeremy Noronha, Technical SEO Consultant<\/strong><br><\/h3>\n\n\n\n<p>There are a lot of areas you can start up a consultancy in but the best way to go about it is to derive expertise from your own experience. <a href=\"https:\/\/jeremynoronha.com\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Jeremy Noronha (opens in a new tab)\">Jeremy Noronha<\/a> is an example of this.<br><\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/lh3.googleusercontent.com\/p-Zlv1dCoi-fl6T036DRUr6DmJwHhlWeaT1QmkQr9Dy-TqOKmvqi4kTg4AMbNYIgN7hYU2IIw_HDewJo4MyGmgi_7lpn64enIb3p1vUtUtGODqbwsba_4BjxBMHVy0DaqUgASHd_\" alt=\"\"\/><\/figure><\/div>\n\n\n\n<p>Source: <a href=\"https:\/\/jeremynoronha.com\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Jeremy Noronha’s blog (opens in a new tab)\">Jeremy Noronha’s blog<\/a><br><\/p>\n\n\n\n<p>He started off with no qualifications and no experience but this didn’t stop him from making a living out of it. Jeremy leveraged the internet to build his own travel blog and became the Head of SEO at <a href=\"https:\/\/foundr.com\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Foundr (opens in a new tab)\">Foundr<\/a>.&nbsp;<br><\/p>\n\n\n\n<p>He also works as an internet marketing and blogging consultant, using his success to guide people looking for a similar experience.<br><\/p>\n\n\n\n<p>“Other than leveraging the skills you already have, you can combine multiple existing skills to be able to offer better service,” he says.<br><\/p>\n\n\n\n<p>For example, a graphic designer capable of coding designs is more valuable than hiring a separate graphic designer and developer.&nbsp;<br><\/p>\n\n\n\n<p>“You want to optimize for the end metric your client actually cares about and not just a vanity metric.”<br><\/p>\n\n\n\n<p>It’s important to identify what your clients are looking for and provide them with those solutions.&nbsp;<br><\/p>\n\n\n\n<p>For instance, a technical SEO consultant has the ability to work for a couple of hours, double the traffic to their client’s website and maximize revenue. Giving them the ability to charge more than an SEO freelancer who would stick to writing content.&nbsp;<br><\/p>\n\n\n\n<p>Consulting offers an amazing opportunity for those who have cross-functional skills.&nbsp;&nbsp;<br><\/p>\n\n\n\n<h2>4. <strong>Start a Digital Marketing Agency<\/strong><\/h2>\n\n\n\n<p>If you have already decided to freelance, you must consider opening a digital marketing agency. For example, a self-employed content writer could easily scale up to their own digital marketing agency from scratch.<br><\/p>\n\n\n\n<p>You do not need special set of skills or a PhD. All you need is hardwork and dedication.<br><\/p>\n\n\n\n<p>The leap from being a freelancer to running your own agency may seem daunting but it’s an easy one if you’re prepared.&nbsp;<br><\/p>\n\n\n\n<p>If you feel overwhelmed by the number of projects you have in the pipeline or wish to increase your capacity, an agency is a good way to scale up while still retaining some control.<br><\/p>\n\n\n\n<p>By combining your expertise with others, you can create a business composed of high talent and multiple offerings rather than stay limited to a single service.&nbsp;<br><\/p>\n\n\n\n<p>For example, over time, you can expand your digital marketing agency to include SEO, advertising and more.&nbsp;<br><\/p>\n\n\n\n<h3><strong>Case: Brittany Ryan, Content Chief at Pointed Copywriting<\/strong><\/h3>\n\n\n\n<p><a aria-label=\"Brittany Ryan (opens in a new tab)\" href=\"https:\/\/www.linkedin.com\/in\/brittany-ryan-writes?originalSubdomain=cy\" target=\"_blank\" rel=\"noreferrer noopener\">Brittany Ryan<\/a> is the founder of <a aria-label=\"Pointed Copywriting (opens in a new tab)\" href=\"https:\/\/pointedcopywriting.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Pointed Copywriting<\/a>, a SaaS content agency. <br>Source: <a aria-label=\"LinkedIn (opens in a new tab)\" href=\"https:\/\/www.linkedin.com\/in\/brittany-ryan-writes\/\" target=\"_blank\" rel=\"noreferrer noopener\">LinkedIn<\/a><br><\/p>\n\n\n\n<p>Her experience to building her own digital market agency stems from the experience of identifying unique differentiators in the transition from a solopreneur to <em>an agency.<\/em><br><\/p>\n\n\n\n<p>It helps to identify your personal USP (user value proposition) first.&nbsp;<br><\/p>\n\n\n\n<p>As a freelancer, your skill set, your perseverance and hustle can set you apart from your competition. But you’ve got to think a step further.<br><\/p>\n\n\n\n<p>How can you scale that USP to an <strong>agency-wide level<\/strong>?<br><\/p>\n\n\n\n<p>Brittany recommends asking yourself the following set of questions:<br><\/p>\n\n\n\n<ul><li>What are some of the things you constantly talk about in sales and client calls?<\/li><li>What industry-related topics always get you on your soapbox?<\/li><li>What parts of your product, service, or process are unique to you?<\/li><\/ul>\n\n\n\n<p>Now, how can your answers to the above questions be scaled to an agency-level? How can you bring this value to your clients, your team and your partners.&nbsp;<br><\/p>\n\n\n\n<p>Start from these questions and build your agency.<\/p>\n\n\n\n<p><br>On another note, Brittany recommends streamlining your service to minimal errors <em>before<\/em> scaling to agency level. After all, you can’t take on more work if you can’t handle the bandwidth.<br><br>Here are a few best practices you can follow:<br><\/p>\n\n\n\n<ol><li>When you’re ready to scale, create a simple and easy to understand set of guidelines (or a checklist). You’ll use this to ensure quality is being maintained.&nbsp;<\/li><li>Start by sub-contracting to just one freelancer. You want to use this period to learn and identify issues before going big.<\/li><li>Once streamlined, take on more freelancers and work towards building an agile team.<\/li><\/ol>\n\n\n\n<p>On a similar note, I recommend using <a href=\"https:\/\/workspace.fiverr.com\/blog\/a-guide-to-operating-a-remote-team\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"team communication tools (opens in a new tab)\">team communication tools<\/a> to inform effective and efficient communication between teams.&nbsp;<\/p>\n\n\n\n<h2>5. <strong>Coach people that want to be like you&nbsp;&nbsp;<\/strong><\/h2>\n\n\n\n<p>Online coaching and consulting is gaining huge popularity. Even universities are introducing distance learning courses that take place over the internet purely.<br><\/p>\n\n\n\n<p>So why don’t you start one yourself?<br><\/p>\n\n\n\n<p>If you have expertise in any field: cooking, art, finance, law, sports, anything,, you can start your own coaching program.<br><\/p>\n\n\n\n<p>Do you have a strong and inspiring experience that led to you becoming a freelancer? You can even consider coaching aspiring students on how they can build their careers in that space.&nbsp;<br><\/p>\n\n\n\n<p>A popular example of coaching programs includes Masterclass.<br><\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh6.googleusercontent.com\/1J56f1l6zZWAcCA4nAX8ZR13A229gdYcGOmh6Z3YcSr6oMYepRUpojY_qzayPsYJx2JYifWJcEeax9Oyt2jZNRUCM_4Hhk8bTJ_4NMBtKFVJ71r7pVM3oFl6NX3h8Xu68FVgPVBq\" alt=\"\"\/><\/figure>\n\n\n\n<p>Source: <a href=\"https:\/\/www.masterclass.com\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"www.masterclass.com (opens in a new tab)\">www.masterclass.com<\/a><br><\/p>\n\n\n\n<p>They have coaching in several fieldscting, writing, comedy, music, sports, etc. You name it, and masterclass has the industry&#8217;s best tutoring at your fingertips.&nbsp;<br><\/p>\n\n\n\n<p>So why don’t you make your own masterclass now? As a matter of fact, you can combine your consultancy services with your coaching services on the side.<br><\/p>\n\n\n\n<p>While you help a business in some way with your expertise, you can also help someone learn how to help businesses themselves.<br><\/p>\n\n\n\n<h3><strong>Case Nico Prins, Founder of Launch Space&nbsp;<\/strong><br><\/h3>\n\n\n\n<p>Nico, founder of<a href=\"https:\/\/launchspace.net\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" Launch Space (opens in a new tab)\"> Launch Space<\/a>, says that if you stick to your job for long enough, there will come a time where you become an expert in your niche.&nbsp;<br><\/p>\n\n\n\n<p>People won&#8217;t necessarily turn to you for the answer to a business problem, but you realize you are in a position to provide advice that helps people achieve their goals. <\/p>\n\n\n\n<p>His first attempt at mentoring was a course called Instant Blogging Success. He had shared a step-by-step program for growing and monetizing a blog through selling backlinks.<br><\/p>\n\n\n\n<p>Below are a couple of things he learned from running premium courses and offering coaching services:<br><\/p>\n\n\n\n<ol><li><strong>Don&#8217;t start charging for advice immediately: <\/strong>wait till you reach a point in your career where friends and business acquaintances are turning to you for advice. You&#8217;ll find a lot of &#8216;mentors&#8217; who do this, but talented people are quick to figure out when you are full of BS. You&#8217;ll quickly get a bad reputation.<\/li><\/ol>\n\n\n\n<ol><li><strong>When starting out, offer your coaching services for free: <\/strong>or even at a reduced price to people with whom you have a professional relationship. This will help you establish your reputation.<\/li><\/ol>\n\n\n\n<ol><li><strong>If you&#8217;re planning to sell an online course, beta-test it: <\/strong>take a select group of clients through the course, before you open it up to the general public. You&#8217;ll learn a lot from this process, which will help you deliver a better product.<\/li><\/ol>\n\n\n\n<ol><li><strong>Remember that education is a two-way process: <\/strong>don&#8217;t be arrogant. You are going to learn a lot from the people you are mentoring.<\/li><\/ol>\n\n\n\n<h2>You’ve aced freelancing. What’s next?<\/h2>\n\n\n\n<p>The world wide web is the best thing that has happened to humankind as it offers the freedom to choose what you want to do and where you want to do it from.&nbsp;<br><\/p>\n\n\n\n<p>Mind you, that sitting long hours on the computer and the digital lifestyle does take a toll on your mental and physical health. So make sure you establish a healthy balance.<br><\/p>\n\n\n\n<p>Good things come to those who sow the seed and wait.&nbsp;<br><\/p>\n\n\n\n<p>Select your path, select your niche and keep at it. There are so many options to choose from.<br><\/p>\n","protected":false},"excerpt":{"rendered":"<p>5 Business Ideas to get started as a freelancer<\/p>\n","protected":false},"author":86,"featured_media":7184,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[2],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>5 Business Ideas for Freelancers<\/title>\n<meta name=\"description\" content=\"5 Business Ideas to get started as a freelancer. Learn from successful freelancers with 5 different casr studies. Understand how to make money.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/workspace.fiverr.com\/blog\/business-ideas-for-freelancers\/\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"5 Business Ideas for Freelancers\" \/>\n<meta name=\"twitter:description\" content=\"5 Business Ideas to get started as a freelancer. Learn from successful freelancers with 5 different casr studies. Understand how to make money.\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Mark Quadros\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"12 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"5 Business Ideas for Freelancers","description":"5 Business Ideas to get started as a freelancer. Learn from successful freelancers with 5 different casr studies. Understand how to make money.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/workspace.fiverr.com\/blog\/business-ideas-for-freelancers\/","twitter_card":"summary_large_image","twitter_title":"5 Business Ideas for Freelancers","twitter_description":"5 Business Ideas to get started as a freelancer. Learn from successful freelancers with 5 different casr studies. Understand how to make money.","twitter_misc":{"Written by":"Mark Quadros","Est. reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/workspace.fiverr.com\/#organization","name":"Fiverr","url":"https:\/\/workspace.fiverr.com\/","sameAs":[],"logo":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#logo","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","width":512,"height":512,"caption":"Fiverr"},"image":{"@id":"https:\/\/workspace.fiverr.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/workspace.fiverr.com\/#website","url":"https:\/\/workspace.fiverr.com\/","name":"Fiverr Workspace","description":"","publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/workspace.fiverr.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/blog\/business-ideas-for-freelancers\/#primaryimage","inLanguage":"en-US","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/workspace.fiverr.com\/blog\/business-ideas-for-freelancers\/#webpage","url":"https:\/\/workspace.fiverr.com\/blog\/business-ideas-for-freelancers\/","name":"5 Business Ideas for Freelancers","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/business-ideas-for-freelancers\/#primaryimage"},"datePublished":"2019-11-27T19:13:13+00:00","dateModified":"2022-03-28T09:24:22+00:00","description":"5 Business Ideas to get started as a freelancer. Learn from successful freelancers with 5 different casr studies. Understand how to make money.","breadcrumb":{"@id":"https:\/\/workspace.fiverr.com\/blog\/business-ideas-for-freelancers\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/workspace.fiverr.com\/blog\/business-ideas-for-freelancers\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/workspace.fiverr.com\/blog\/business-ideas-for-freelancers\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Fiverr Workspace","item":"https:\/\/workspace.fiverr.com\/"},{"@type":"ListItem","position":2,"name":"5 Business Ideas for Freelancers"}]},{"@type":["Article","BlogPosting"],"@id":"https:\/\/workspace.fiverr.com\/blog\/business-ideas-for-freelancers\/#article","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/blog\/business-ideas-for-freelancers\/#webpage"},"author":{"@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/f3f3e8f98cfde62a137849dbfe4183b1"},"headline":"5 Business Ideas for Freelancers","datePublished":"2019-11-27T19:13:13+00:00","dateModified":"2022-03-28T09:24:22+00:00","mainEntityOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/business-ideas-for-freelancers\/#webpage"},"wordCount":2573,"publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"image":{"@id":"https:\/\/workspace.fiverr.com\/blog\/business-ideas-for-freelancers\/#primaryimage"},"thumbnailUrl":"","articleSection":["Freelance knowledge"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/f3f3e8f98cfde62a137849dbfe4183b1","name":"Mark Quadros","image":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/838c2ebe1426241a67c2a9edea7cd43c?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/838c2ebe1426241a67c2a9edea7cd43c?s=96&d=mm&r=g","caption":"Mark Quadros"},"description":"Mark Quadros is a SaaS writer that produces rad content that not only drives traffic but also boosts user engagement. In his free time, he loves traveling the world and living a minimalist life from his backpack."}]}},"_links":{"self":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/7182"}],"collection":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/users\/86"}],"replies":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/comments?post=7182"}],"version-history":[{"count":0,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/7182\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media?parent=7182"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/categories?post=7182"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/tags?post=7182"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}