{"id":7336,"date":"2020-11-25T22:16:43","date_gmt":"2020-01-06T22:18:22","guid":{"rendered":"https:\/\/www.and.co\/blog\/?p=7336"},"modified":"2020-11-25T22:16:43","modified_gmt":"2020-01-06T22:18:22","slug":"6-new-years-resolution-ideas-to-build-a-better-freelance-business","status":"publish","type":"post","link":"https:\/\/workspace.fiverr.com\/blog\/6-new-years-resolution-ideas-to-build-a-better-freelance-business\/","title":{"rendered":"6 New Years Resolution Ideas to Build a Better Freelance Business"},"content":{"rendered":"\n<p>The end of one year and the beginning of another provides a natural opportunity for reflection.&nbsp;<br \/><\/p>\n\n\n<p>Whether you’ve <a href=\"https:\/\/workspace.fiverr.com\/blog\/quitting-job-without-burning-bridges-freelance-full-time\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"just started freelancing (opens in a new tab)\">just started freelancing<\/a> or have been doing it for a while, there’s really no bad time to consider what’s working and what you could be doing better. And since you’re the boss, there’s <em>no one else<\/em> to provide an end of year review. <br \/><\/p>\n\n\n<p>Whether it happens or not, it’s all on you. Even though you certainly don’t have to do it, I challenge you to give it a try.<br \/><\/p>\n\n\n<p>While you’re thinking about what happened in your business over the past year, consider making changes in terms of these six New Years resolution ideas:<br \/><\/p>\n\n\n<h2>#1: Resolve to do more networking<\/h2>\n\n\n<p>If you spend the majority of your time working from home, it’s important to make excuses to get out of the house.<br \/><\/p>\n\n\n<p>It’s hard to stay energized if you isolate yourself from other people. And even if you really do your best work on your own at home, it sure can be lonely.<br \/><\/p>\n\n\n<p>But besides the benefits of togetherness you’ll achieve by getting out of the house and <a href=\"https:\/\/workspace.fiverr.com\/blog\/how-to-get-freelance-work-build-a-freelance-community\/\">s<\/a><a href=\"https:\/\/workspace.fiverr.com\/blog\/how-to-get-freelance-work-build-a-freelance-community\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"urrounding yourself with other people (opens in a new tab)\">urrounding yourself with other people<\/a>, you may also find several business benefits.<br \/><\/p>\n\n\n<p>Specifically, looking for opportunities to network can be a great way to find collaborators and business prospects, alike.<br \/><\/p>\n\n\n<p>In Denver, I get face time with other interesting people with the following involvements:<\/p>\n\n\n<ul><li>WordCamp Denver event organization<\/li><li>WordPress Denver meetup volunteering (I’ve previously been in charge of the Denver Freelancers Union chapter)<\/li><li>Member (previously board member) of The Marketing Alliance, a business marketing association<\/li><\/ul>\n\n\n<p>The best part of my involvement with each group isn’t <em>just <\/em>about the fact that they provide excellent opportunities for finding well-paying clients. These networking opportunities also help me meet people who do work that complements mine.&nbsp;<br \/><\/p>\n\n\n<p>Once we’ve met and have established trust, we can refer business back and forth. It’s in situations like these that it’s especially important to know and communicate your niche to the people you’re networking with (and likewise ask people about what they’re best at).&nbsp;<br \/><\/p>\n\n\n<p>You may be able to create an additional revenue stream based on commission from referring business you don’t have the time or ability to do well.<br \/><\/p>\n\n\n<p>Don’t forget: freelancers, even in the same industry and niche, are your friends — not your competition. There’s definitely enough work out there for all of us.<br \/><\/p>\n\n\n<p>Although the Internet has made it easier for us to work and connect with others online, nothing beats an in-person connection. But even when you can’t justify an in-person meeting, virtual coffee chats and mastermind groups with other similar freelancers can help you build community and avoid isolation.<br \/><\/p>\n\n\n<p><strong>Ask yourself<\/strong>: which local groups could I see myself checking out to meet more people in my industry and niche?<br \/><\/p>\n\n\n<h2>#2: Resolve to dig into the numbers and understand cash flow<\/h2>\n\n\n<p>If you don’t understand how you’re bringing in and spending money within your business, it will be hard to set goals to increase your revenue and profit.<br \/><\/p>\n\n\n<h3>Resolve to set goals for business development<\/h3>\n\n\n<p>More specifically, resolve to set numeric goals around:<\/p>\n\n\n<ul><li>How many clients you want at one time<\/li><li>How many prospects you must interact with to close the deal, on average<\/li><li>How much money you want to make each month<\/li><\/ul>\n\n\n<p>Once you have some numbers in place, follow through by tracking your efforts to get there and see how much work it really takes to achieve your earnings goals.&nbsp;<\/p>\n\n\n<h3>Resolve to start a retirement account<\/h3>\n\n\n<p>I can’t emphasize this point enough —&nbsp;the longer you put this off, the less you’ll eventually benefit from compounding interest when you’re ready to retire.&nbsp;<br \/><\/p>\n\n\n<p>No one else is going to do this for you. There’s no HR department to hold your hand.&nbsp;<br \/><\/p>\n\n\n<p>It’s better to start <em>somewhere<\/em> than trying to get it perfect from the onset. <a href=\"https:\/\/www.acorns.com\/later\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Acorns (opens in a new tab)\">Acorns<\/a> offers a mix of retirement account options (including a SEP IRA, designed for self-employed individuals) that you can set and forget contributing to by sending automatic transactions from your personal checking account.<br \/><\/p>\n\n\n<h3>Resolve to audit your business expenses<\/h3>\n\n\n<p>If you’ve been tracking your business expenses with a tool like <a href=\"https:\/\/workspace.fiverr.com\/expense-tracking\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"AND.CO (opens in a new tab)\">AND.CO<\/a>, the process of going through individual transactions from the past year will be fairly straightforward.<br \/><\/p>\n\n\n<p>Take some time to determine the following in terms of the past calendar year:<\/p>\n\n\n<ul><li>Non-negotiable expenses for the tools and services that keep your business running<\/li><li>Nice-to-have tools and services that you can scale up or down depending on cash flow&nbsp;<\/li><li>Tools and services you’re paying for but not currently using<\/li><\/ul>\n\n\n<p>This final category of tools and services expenses should be cut immediately — you can always add them back in as necessary.<br \/><\/p>\n\n\n<p>While most software as a service (SaaS) tools ubiquitous in every freelancer’s list of “must-haves” charge monthly fees, keep an eye out for <a href=\"https:\/\/www.the-blogsmith.com\/what-is-appsumo-review\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"lifetime deals (opens in a new tab)\">lifetime deals<\/a> that can help with business needs on marketplaces like <a href=\"https:\/\/appsumo.com\/browse\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"AppSumo (opens in a new tab)\">AppSumo<\/a>.<br \/><\/p>\n\n\n<p><strong>Ask yourself:<\/strong> Are there tools I’m currently paying for that I haven’t used in the last few months? Can I get by without them or with a cheaper solution?<br \/><\/p>\n\n\n<h3>Resolve to get on top of bookkeeping and taxes<\/h3>\n\n\n<p>If you wait until the end of the year (or even the end of the month), accounting tasks pile up.<\/p>\n\n\n<p>Things get a little easier when you hire help for bookkeeping and tax preparation, but you’ll still want to regularly review this work&nbsp;— you know your business best.<\/p>\n\n\n<p>Regardless of whether or not your approach involves outsourcing or DIY, set aside a block of time each week to address:<\/p>\n\n\n<ul><li>Important forms that need to be filled out<\/li><li>Expense entry and categorization<\/li><li>Paying taxes as necessary (like quarterlies)&nbsp;<\/li><li>Meetings with your bookkeeper\/tax preparer (as necessary)<\/li><\/ul>\n\n\n<p>Having some personal involvement in these activities will also help to provide you with an informed snapshot of how your business is doing.<\/p>\n\n\n<p><strong>Ask yourself<\/strong>: How much time do accounting tasks take each week, on average?<\/p>\n\n\n<p><strong>Read additional tips for creating your <a href=\"https:\/\/workspace.fiverr.com\/blog\/freelance-accounting-101\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"freelance accounting system. (opens in a new tab)\">freelance accounting system.<\/a><\/strong><br \/><\/p>\n\n\n<h2>#3: Resolve to work <em>on<\/em> your business, not just <em>in<\/em> it.<\/h2>\n\n\n<p>The holidays, from Thanksgiving until mid-January, are notoriously slow for freelancers.&nbsp;<br \/><\/p>\n\n\n<p>During this timeframe, instead of throwing all of your efforts into getting new clients, I challenge you to take this opportunity to work on your business.<br \/><\/p>\n\n\n<p>A few new years resolution ideas for <a href=\"https:\/\/workspace.fiverr.com\/blog\/working-11-marketing-materials-youll-need\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"taking advantage of this dead time (opens in a new tab)\">taking advantage of this dead time<\/a>:<\/p>\n\n\n<ul><li>Update the copy or design of your website to reflect what you do <em>today<\/em> — not what you did three years ago when you initially launched it.<\/li><li>On a similar note, update your social profiles with more up-to-date bios, headshots, etc.<\/li><li>Line up and write guest blogs for brands in your industry\/niche who represent a similar audience to the type of clients you want to work with. The backlink to your website in your author bio will also help with SEO.<\/li><\/ul>\n\n\n<p><strong>Ask yourself<\/strong>: what have I been dying to work on that urgent work takes precedence over?<\/p>\n\n\n<p>Another way to make good use of this time? Document your processes.<br \/><\/p>\n\n\n<h2>#4: Resolve to document common business processes<\/h2>\n\n\n<p>At some point in your freelance business, you’ll want to consider <a href=\"https:\/\/workspace.fiverr.com\/blog\/how-to-subcontract-work-to-grow-your-freelance-business\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"subcontracting work (opens in a new tab)\">subcontracting work<\/a> to others.<br \/><\/p>\n\n\n<p>The idea of training a new contractor on a job you’ve already taught someone else how to do is exhausting.&nbsp;<br \/><\/p>\n\n\n<p>Instead of reinventing the wheel when getting new employees up to speed on how to be productive in your business, <a href=\"https:\/\/www.getcloudapp.com\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"record yourself or your screen explaining (opens in a new tab)\">record yourself or your screen explaining<\/a> things like:<\/p>\n\n\n<ul><li>How to use certain tools<\/li><li>Training videos for accomplishing certain tasks<\/li><li>How to invoice and information on when to expect payment<\/li><\/ul>\n\n\n<p>You can use the same concept for getting clients up to speed with your business with things like a <a href=\"https:\/\/www.the-blogsmith.com\/paperform-client-intake-form-process\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"client intake form (opens in a new tab)\">client intake form<\/a>, <a href=\"https:\/\/ithemes.com\/how-to-onboard-clients\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"intro packet (opens in a new tab)\">intro packet<\/a>, and <a href=\"https:\/\/ithemes.com\/how-to-offboard-clients\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"goodbye packet (opens in a new tab)\">goodbye packet<\/a> when the relationship is over.<br \/><\/p>\n\n\n<p>In addition to screen recordings, start thinking about various checklists you could make to help yourself and contractors accomplish repeatable tasks. <em><a href=\"https:\/\/www.amazon.com\/Checklist-Manifesto-How-Things-Right-ebook\/dp\/B0030V0PEW\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"The Checklist Manifesto (opens in a new tab)\">The Checklist Manifesto<\/a><\/em> details how useful checklists can be for ensuring that you don’t ever miss any important steps when completing tasks — don’t try to keep it all in your head.<br \/><\/p>\n\n\n<p><strong>Ask yourself<\/strong>: what daily tasks can I systematize? What checklists would benefit current or future subcontractors helping me?<\/p>\n\n\n<p><\/p>\n\n\n<h2>#5: Resolve to learn something or do something new<\/h2>\n\n\n<p>In a year-end wrap up call, <a href=\"https:\/\/casabona.org\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Joe Casabona (opens in a new tab)\">Joe Casabona<\/a> told me that he wanted to organize his reading and learning according to various quarterly themes. <br \/><\/p>\n\n\n<p>It’s easy to see the genius behind this New Years resolution idea. Cumulative learning and a deep concentration on a set of related topics ultimately leads to deep understanding.<br \/><\/p>\n\n\n<p>This idea of quarterly learning sprints reminds me of the book, <em><a href=\"https:\/\/www.amazon.com\/12-Week-Year-Others-Months-ebook\/dp\/B00CU9P31K\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"The 12 Week Year (opens in a new tab)\">The 12 Week Year<\/a><\/em>. No, this productivity framework <em>doesn’t<\/em> encourage taking more than half of the year for vacation but instead forces you to think about setting goals meant to be accomplished in 12 week sprints. <br \/><\/p>\n\n\n<p>No matter how you set learning goals for the year, plan to be purposeful. If you’re not planning to use the information right away, you may want to wait on trying to learn it.<\/p>\n\n\n<p>Speaking of being purposeful, if you’re planning to attend any conferences or related events, the beginning of the year is the perfect time to add them to your calendar. While you’re at it, block off time that’s already spoken for in terms of vacation, weddings, and other important events in your personal life.&nbsp;<\/p>\n\n\n<p>Doing this will provide a realistic look at what time you have left for everything else. In terms of conferences, this may also enable you to commit sooner — taking advantage of early bird ticket pricing.<\/p>\n\n\n<p>Additional New Years resolution ideas for learning and trying new things:<\/p>\n\n\n<ul><li>Read business books<\/li><li>Take online courses<\/li><li>Subscribe to industry newsletters<\/li><\/ul>\n\n\n<p><strong>Ask yourself<\/strong>: what big and little things do I want to learn this year?<\/p>\n\n\n<h2>#6: Resolve to use your business to make the world a better place<\/h2>\n\n\n<p>2019 sure seemed like a rough year around the world. While it’s certainly possible that the media makes the bad seem like it outweighs the good, it’s hard to argue against doing whatever’s in your power to make the world a better place.<br \/><\/p>\n\n\n<p>At the end of the day, if your business is designed to only serve <em>you<\/em>, the world is better off without it. But if your business can be used to serve a greater good — your clients and the world around you — that’s something to be proud of.<br \/><\/p>\n\n\n<p>Here are a few New Years resolution ideas for using your business to make the world a better place:<br \/><\/p>\n\n\n<ul><li>Pay your own luck forward by helping someone else. I provide 2 free 30 minute mentoring sessions for anyone who wants them, every week. On that note&#8230;<\/li><li>Mentor someone who may benefit from your knowledge.<\/li><li>Donate a percentage of your proceeds to causes you care about.<\/li><li>Take a stand for a cause that you’re drawn to. Social consciousness is an important brand trait, especially for buyers in the younger generations.<\/li><\/ul>\n\n\n<p><strong>Ask yourself<\/strong>: what small step can I take today to make the world a better place through my business?<br \/><\/p>\n\n\n<h2>Final Thoughts: 6 New Years Resolution Ideas to Build a Better Freelance Business<\/h2>\n\n\n<p>If you do even half of these things, your 2020 will be quite prosperous. But in order to get there, your journey <em>must<\/em> start now. Don’t lose out on the possibilities brought on by the momentum of a new year.<br \/><\/p>\n\n\n<p>While you’re pushing forward to accomplish one or many of these New Years resolution ideas, don’t forget to <a href=\"https:\/\/workspace.fiverr.com\/blog\/boss-10-rules-create-freelancer\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"make time for yourself (opens in a new tab)\">make time for yourself<\/a>, outside of work. For freelancers, it’s easy to get caught up in business stress at all hours — sometimes, you need to protect yourself from going crazy by forcing yourself to disconnect.<br \/><\/p>\n\n\n<p>Ready to be held accountable for a business New Year’s resolution? Tweet your resolution at <a href=\"https:\/\/www.twitter.com\/andco\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"@ANDCO (opens in a new tab)\">@ANDCO<\/a> and we’ll share our favorites!<br \/><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The end of one year and the beginning of another provides a natural opportunity for reflection.&nbsp; Whether you’ve just started freelancing or have been doing it<\/p>\n","protected":false},"author":85,"featured_media":7974,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[6],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>6 New Years Resolution Ideas to Build a Better Freelance Business<\/title>\n<meta name=\"description\" content=\"If you do even half of these things, your 2020 will be quite prosperous. Don’t lose out on the possibilities brought on by the momentum of a new year.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/workspace.fiverr.com\/blog\/6-new-years-resolution-ideas-to-build-a-better-freelance-business\/\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"6 New Years Resolution Ideas to Build a Better Freelance Business\" \/>\n<meta name=\"twitter:description\" content=\"If you do even half of these things, your 2020 will be quite prosperous. Don’t lose out on the possibilities brought on by the momentum of a new year.\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"MADDY OSMAN\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"6 New Years Resolution Ideas to Build a Better Freelance Business","description":"If you do even half of these things, your 2020 will be quite prosperous. Don’t lose out on the possibilities brought on by the momentum of a new year.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/workspace.fiverr.com\/blog\/6-new-years-resolution-ideas-to-build-a-better-freelance-business\/","twitter_card":"summary_large_image","twitter_title":"6 New Years Resolution Ideas to Build a Better Freelance Business","twitter_description":"If you do even half of these things, your 2020 will be quite prosperous. Don’t lose out on the possibilities brought on by the momentum of a new year.","twitter_misc":{"Written by":"MADDY OSMAN","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/workspace.fiverr.com\/#organization","name":"Fiverr","url":"https:\/\/workspace.fiverr.com\/","sameAs":[],"logo":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#logo","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","width":512,"height":512,"caption":"Fiverr"},"image":{"@id":"https:\/\/workspace.fiverr.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/workspace.fiverr.com\/#website","url":"https:\/\/workspace.fiverr.com\/","name":"Fiverr Workspace","description":"","publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/workspace.fiverr.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/blog\/6-new-years-resolution-ideas-to-build-a-better-freelance-business\/#primaryimage","inLanguage":"en-US","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/workspace.fiverr.com\/blog\/6-new-years-resolution-ideas-to-build-a-better-freelance-business\/#webpage","url":"https:\/\/workspace.fiverr.com\/blog\/6-new-years-resolution-ideas-to-build-a-better-freelance-business\/","name":"6 New Years Resolution Ideas to Build a Better Freelance Business","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/6-new-years-resolution-ideas-to-build-a-better-freelance-business\/#primaryimage"},"datePublished":"2020-01-06T22:18:22+00:00","dateModified":"2020-01-06T22:18:22+00:00","description":"If you do even half of these things, your 2020 will be quite prosperous. Don’t lose out on the possibilities brought on by the momentum of a new year.","breadcrumb":{"@id":"https:\/\/workspace.fiverr.com\/blog\/6-new-years-resolution-ideas-to-build-a-better-freelance-business\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/workspace.fiverr.com\/blog\/6-new-years-resolution-ideas-to-build-a-better-freelance-business\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/workspace.fiverr.com\/blog\/6-new-years-resolution-ideas-to-build-a-better-freelance-business\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Fiverr Workspace","item":"https:\/\/workspace.fiverr.com\/"},{"@type":"ListItem","position":2,"name":"6 New Years Resolution Ideas to Build a Better Freelance Business"}]},{"@type":["Article","BlogPosting"],"@id":"https:\/\/workspace.fiverr.com\/blog\/6-new-years-resolution-ideas-to-build-a-better-freelance-business\/#article","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/blog\/6-new-years-resolution-ideas-to-build-a-better-freelance-business\/#webpage"},"author":{"@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/11c2792d325fbc355454080d81b279aa"},"headline":"6 New Years Resolution Ideas to Build a Better Freelance Business","datePublished":"2020-01-06T22:18:22+00:00","dateModified":"2020-01-06T22:18:22+00:00","mainEntityOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/6-new-years-resolution-ideas-to-build-a-better-freelance-business\/#webpage"},"wordCount":2012,"publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"image":{"@id":"https:\/\/workspace.fiverr.com\/blog\/6-new-years-resolution-ideas-to-build-a-better-freelance-business\/#primaryimage"},"thumbnailUrl":"","articleSection":["Inspiration"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/11c2792d325fbc355454080d81b279aa","name":"MADDY OSMAN","image":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/ec0a6ac9bd172932148a187240330fd8?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/ec0a6ac9bd172932148a187240330fd8?s=96&d=mm&r=g","caption":"MADDY OSMAN"},"description":"Maddy Osman creates engaging content with SEO best practices for marketing thought leaders and agencies that have their hands full with clients and projects. Learn more about her process and experience on her website The Blogsmith and read her latest articles on Twitter: @MaddyOsman.","sameAs":["https:\/\/www.the-blogsmith.com"]}]}},"_links":{"self":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/7336"}],"collection":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/users\/85"}],"replies":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/comments?post=7336"}],"version-history":[{"count":0,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/7336\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media?parent=7336"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/categories?post=7336"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/tags?post=7336"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}