{"id":7342,"date":"2020-11-25T22:16:43","date_gmt":"2020-01-20T12:00:00","guid":{"rendered":"https:\/\/www.and.co\/blog\/?p=7342"},"modified":"2021-10-20T16:21:52","modified_gmt":"2021-10-20T16:21:52","slug":"how-to-turn-one-time-job-listings-into-long-term-freelance-clients","status":"publish","type":"post","link":"https:\/\/workspace.fiverr.com\/blog\/how-to-turn-one-time-job-listings-into-long-term-freelance-clients\/","title":{"rendered":"How to turn one-time job listings into long-term freelance clients"},"content":{"rendered":"\n<p>After working with freelancers for more than a decade, the biggest complaint I still hear over and over again is how hard it is to find new freelance jobs.<\/p>\n\n\n\n<p>Despite the <a href=\"https:\/\/millo.co\/freelance-job-sites\">abundance of freelance job sites<\/a> around the web, freelancers still struggle to find enough work to pay the bills every month.<\/p>\n\n\n\n<p>The looming feast-famine cycle is beyond cliche in the freelancing community and many freelancers seem to have simply resigned themselves to it.<\/p>\n\n\n\n<p>But it doesn’t have to be like that.<\/p>\n\n\n\n<p>There’s one thing long-term, successful freelancers know about finding new freelance jobs that you may not have learned yet:<\/p>\n\n\n\n<p>The best way to build a successful freelance business is to focus on long-term, repeat clients.<\/p>\n\n\n\n<p>Of course, <a href=\"https:\/\/workspace.fiverr.com\/blog\/get-clients-short-long-term-strategy-success\/\">getting freelance clients<\/a> in the first place can be difficult. But getting new clients over and over again each month is just outright exhausting.<\/p>\n\n\n\n<p>Instead, to save your sanity and grow your business with less effort, you’ve got to think long-term when it comes to clients.<\/p>\n\n\n\n<p>So today, I’d like to share how you can turn one-time job listings into long-term freelance clients.<\/p>\n\n\n\n<p>It’s something we teach to our members at <a href=\"https:\/\/solidgigs.com\">SolidGigs<\/a> (our job-finding community for freelancers) and hundreds of freelancers have had major success converting one-time listings into long-term clients.<\/p>\n\n\n\n<p>Let’s dive in!<\/p>\n\n\n\n<h2><strong>1. Change how you think about job listings<\/strong><\/h2>\n\n\n\n<p>First, you have to change how you think about job listings. Here’s the biggest mindset change that will greatly impact your ability to find long-term clients:<\/p>\n\n\n\n<h3><strong>A job listing doesn’t have to say “freelance” to be a potential client<\/strong><\/h3>\n\n\n\n<p>If you’re only searching for freelance job listings that specifically ask for a freelancer or a contractor, you’re missing out on a lot of opportunities.<\/p>\n\n\n\n<p>Put yourself in the position of a potential hirer for just a moment.&nbsp;<\/p>\n\n\n\n<p>They have a problem that needs solved. Work that needs to be done. And most likely, they have a budget for which the work can be completed (the new employee’s salary or hourly wage).<\/p>\n\n\n\n<p>That all works in your favor.<\/p>\n\n\n\n<p>In fact, many times you can convince someone trying to hire a part-time employee that hiring a contractor or freelancer is better. Here are just a few ideas you can use when pitching someone on hiring a freelancer instead of an employee:<\/p>\n\n\n\n<ul><li>They can send you more work (longer hours) without having to pay health benefits.<\/li><li>They only pay for the work you complete (no watercooler cost).<\/li><li>They save money on overhead (your desk, computer, office supplies, etc.)<\/li><\/ul>\n\n\n\n<p><a href=\"https:\/\/workspace.fiverr.com\/blog\/hiring-managers-tell-get-freelance-job\/\">Lots of employers are hiring freelancers<\/a> more often for these and many more reasons. Which creates an excellent opportunity for you.<\/p>\n\n\n\n<p>And because these potential employers have a long-term problem they need solved with a long-term employee, they’re a natural fit for a long-term client.<\/p>\n\n\n\n<p>Which brings me to my next point:<\/p>\n\n\n\n<h2><strong>2. Aim for clients who are good long-term candidates<\/strong><\/h2>\n\n\n\n<p>Naturally, someone who’s trying to hire a part- or full-time employee makes a pretty great candidate for a long-term client.<\/p>\n\n\n\n<p>There are other client types that lend themselves to the likelihood of a long-term relationship too.<\/p>\n\n\n\n<p>In order to identify these clients, you’ll need to earnestly think through the situation a potential hirer may find themselves in. Here are a few examples to illustrate what I’m saying:<\/p>\n\n\n\n<p><\/p>\n\n\n\n<figure class=\"wp-block-table\"><table><tbody><tr><td><strong>Good long-term candidate<\/strong><\/td><td><strong>Unlikely to become a long-term client<\/strong><\/td><\/tr><tr><td><strong>Someone with a recurring problem that needs solved.<\/strong> <br>ie: a small business that needs a new blog post published every Monday morning.<\/td><td><strong>Someone that has one small problem to be solved only right now.<br><\/strong>ie: a small business that needs an email signature template designed for all its employees.<\/td><\/tr><tr><td><strong>Someone with an established business and proven revenue model.<\/strong>ie: a business that has been around for at least a few years and has a handful or more of employees.<\/td><td><strong>Someone just getting started with their business or idea.<\/strong>ie: your friend who has a great idea for a new app but isn’t quitting his day job quite yet.<\/td><\/tr><tr><td><strong>Someone with a long-term budget.<\/strong>ie: a business owner who wants to hire a part-time social media marketer for the foreseeable future.<\/td><td><strong>Someone who nickels and dimes you on your first project.<\/strong>ie: potential clients who spend dozens of emails negotiating your rates before you even begin their project.<\/td><\/tr><\/tbody><\/table><\/figure>\n\n\n\n<p>I’m not saying the clients on the right can’t provide a quality experience or portfolio pieces. They may be a good fit if you’ve never freelanced before and you just need to get your feet wet.<br>But if you’re ready to take your freelance business to a more predictable, successful level, then you’ll want to focus on clients similar to the ones found on the left in the table above.<\/p>\n\n\n\n<p>You’ll find it’s much easier to convert these kinds of clients to long-term business (step 4).<\/p>\n\n\n\n<h2><strong>3. Add immense value to new clients<\/strong><\/h2>\n\n\n\n<p>Do you know the biggest mistake people make when asking their boss for a raise? It’s that they blind-side them. They walk into their boss’s office asking for more money out of the blue.<\/p>\n\n\n\n<p>(I know we’re talking about freelancing here, but stick with me. This will be super helpful when I tie it all back together.)<\/p>\n\n\n\n<p>One of the smartest and most talented negotiators I know of, Ramit Sethi, <a href=\"https:\/\/www.iwillteachyoutoberich.com\/blog\/salary-negotiation\/\">explains<\/a> this important point when asking for a raise:<\/p>\n\n\n\n<p>The key to getting a raise is remembering that it’s not about you. It’s about what you can do for your employer.<\/p>\n\n\n\n<p>You can’t tell them you need more money because your expenses are high. Nobody cares. BUT you can show how your work has clearly been contributing to the company’s success and ask to be compensated fairly.<\/p>\n\n\n\n<p>That’s why <strong>three months before you ask for a raise, you’re going to start tracking everything you do at work and the results you get<\/strong>.<\/p>\n\n\n\n<p>As a freelancer, converting one-time jobs into long-term clients works exactly the same way.<\/p>\n\n\n\n<p>You can’t just blindside your client with a request for ongoing revenue every month when you haven’t proven your contribution to your client’s success.<\/p>\n\n\n\n<p>99% of the time, you’ll fail. They’ll tell you they can’t afford to bring you on as a regular freelancer or pay you each month for regular work.<\/p>\n\n\n\n<p>The truth is: they probably <em>can<\/em> afford it.<\/p>\n\n\n\n<p>When it comes to business, if you bring a positive ROI for an employer they can <em>always<\/em> afford it.<\/p>\n\n\n\n<p>So your first and most important task is to: <strong>Add immense value to your client’s business.<\/strong><\/p>\n\n\n\n<p>Track that value where possible. Highlight it frequently. Ensure your client sees just how vital your work is to their business’ success. Be invested in your client’s success.<\/p>\n\n\n\n<p>If you can do that, the next steps (where we convert clients to long-term business partnerships) becomes infinitely easier.<\/p>\n\n\n\n<p>In a recent interview we did with agency builder and Emmy-award winning designer <a href=\"https:\/\/millo.co\/chris-do-interview\">Chris Do<\/a>, he reminded us:<\/p>\n\n\n\n<p>&#8220;If you don&#8217;t learn the language of business, you may limit your growth and be relegated to the role of an &#8216;order taker&#8217;.&#8221;<\/p>\n\n\n\n<h2><strong>4. Identify the best moments for pitching a long-term relationship.<\/strong><\/h2>\n\n\n\n<p>Once you’re sure you’ve added actual value to your client’s business, it’s time to identify the right moment to pitch a long-term relationship.<\/p>\n\n\n\n<p>Of course, this can be a lot like dating. If you come at it too soon, you might scare them away. If you take too long, they might just forget about you and move on.<\/p>\n\n\n\n<p>Timing is everything.<\/p>\n\n\n\n<p>Here are just a few moments that work well for pitching a long-term client\/freelancer relationship:<\/p>\n\n\n\n<p><strong>At the beginning of a project<\/strong> when you’re identifying the scope of the work. You might say something like:<br><em> “This sounds great. And it looks like it might require some updates every couple of weeks, which I’d be happy to help with on a recurring basis as well. Would you be open to an arrangement like that?<\/em>&#8220;<\/p>\n\n\n\n<p><strong>In the middle of a project <\/strong>when you’re both enjoying working together and your client can see how much value you’re adding. You might try something like:<\/p>\n\n\n\n<p><em>“This first portion went really smoothly and I can see it’s performing really well for you. Maybe we ought to think about a more long-term setup where I can help you get results like this on a regular basis. Would that be interesting to you at all?”<\/em><\/p>\n\n\n\n<p><strong>At the conclusion of a project <\/strong>when your client is super-satisfied with your work and excited about results. Your conversation might look like this:<\/p>\n\n\n\n<p><em>“That wraps up this project. Thanks so much! I’d love to chat about ways we could work together more regularly in the future so we can keep driving results for you. Is that something you’d want to discuss this week?”<\/em><\/p>\n\n\n\n<p><strong>A while after the project has concluded <\/strong>and results are in. You might try pitching along these lines:<\/p>\n\n\n\n<p><em>“I see the project went live and has really over-delivered for your customers. That’s fantastic! I’d love to chat about hitting these kinds of numbers on a regular basis together. Sound interesting?”<\/em><\/p>\n\n\n\n<p>However you phrase it, use conversational language and just gauge interest. Once you’ve got someone interested you can talk details.<\/p>\n\n\n\n<h3><strong>Remember, “no” doesn’t mean forever<\/strong><\/h3>\n\n\n\n<p>If your client turns you down on your first pitch, remember: it’s not the end of the world.&nbsp;<\/p>\n\n\n\n<p>If this client is still a good match (you work well together, they seem to have budget and repeat work, etc.) then don’t give up.<\/p>\n\n\n\n<p>It could be that, at the moment, they can only send you one-off jobs but as their business grows they’ll find more budget for more regular freelance work.<\/p>\n\n\n\n<p>Perhaps they have an overstaffed team right now, but when someone leaves, they’ll have a gap in workload they’d like to fill with a freelancer.<\/p>\n\n\n\n<p>The idea is to remain positive, always offering to support and help and therefore remaining top-of-mind for when the perfect moment arises.<\/p>\n\n\n\n<p>Don’t be afraid to bring it up multiple times too. My friend <a href=\"https:\/\/businessbitch.com\/\">Chelsea Baldwin<\/a> who has built a thriving copywriting agency using these methods told me:<\/p>\n\n\n\n<p>“If you have an idea [of how to add value on a recurring basis], just pitch the idea. I tell freelancers to just put a pitch for a retainer in every proposal that they write.<\/p>\n\n\n\n<p>Keep it low key and low-stress so they don’t feel like you’re pushing them real hard. Some people will buy into it; some people won’t. But it puts the idea there in front of them.&nbsp;<\/p>\n\n\n\n<p>And then at the end of the project or when you’re close to the end of the project, you can pitch the idea again.”&nbsp;<\/p>\n\n\n\n<h2><strong>5. Continue to add value and renegotiate when the time is right<\/strong><\/h2>\n\n\n\n<p>If you manage to convert a one-time client into recurring business, then congratulations! You’ve made it a lot farther than many freelancers.<\/p>\n\n\n\n<p>You’re well on your way to building <a href=\"https:\/\/workspace.fiverr.com\/blog\/freelancing-business-setting-career-goals\/\">a sustainable freelance business<\/a>.<\/p>\n\n\n\n<p>The goal now becomes to continue to add value to your current client roster as much as possible (which should be fairly straightforward since you don’t have to spend hours every week hunting and begging for new freelance jobs).<\/p>\n\n\n\n<p>If you use an app like AND.CO, you can even <a href=\"https:\/\/workspace.fiverr.com\/recurring-payments\">set up recurring payments<\/a> so your client’s account is just billed automatically every month and you never have to stress again about <a href=\"https:\/\/millo.co\/getting-paid-as-a-freelancer\">getting paid as a freelancer<\/a>.<\/p>\n\n\n\n<p>It’s kind of amazing, honestly.<\/p>\n\n\n\n<p>As you continue to add value, keep pitching new ideas, higher rates, and more ways you can add value to your client’s business.<\/p>\n\n\n\n<p>From there, you can repeat the process above to negotiate a higher monthly retainer or more billable hours from your clients.<\/p>\n\n\n\n<h2><strong>That’s it…<\/strong><\/h2>\n\n\n\n<p>Turning one-time clients into recurring revenue can really be that simple.<\/p>\n\n\n\n<p>Over time, you’ll learn how to get better at the timing, the pitch, and the negotiations. But for now: just give it a try.&nbsp;<\/p>\n\n\n\n<p>You don’t have a lot to lose, honestly. If a one-time client declines a recurring relationship, you’ve still got the original one-time project you agreed to, so you’re not out anything but maybe the time you spent discussing it with them.<\/p>\n\n\n\n<p>But the upside is huge.<\/p>\n\n\n\n<p>Recurring revenue can be the thing that changes your freelance career from stressful, painful and wondering if you should just “get another job already” to working on projects you love, having time fly by, and maybe even <a href=\"https:\/\/workspace.fiverr.com\/blog\/how-to-subcontract-work-to-grow-your-freelance-business\/\">subcontracting as a way to grow your freelance business<\/a>.<\/p>\n\n\n\n<p>However you go about it—or whatever your motivations are—I sincerely wish you the best of luck!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>After working with freelancers for more than a decade, the biggest complaint I still hear over and over again is how hard it is to find<\/p>\n","protected":false},"author":110,"featured_media":10214,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[2],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to turn one-time job listings into long-term freelance clients<\/title>\n<meta name=\"description\" content=\"To vacation or not to vacation? It&#039;s near taboo to suggest a break for personal time. So, how do you successfully negotiate this seemingly thin ice?\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/workspace.fiverr.com\/blog\/how-to-turn-one-time-job-listings-into-long-term-freelance-clients\/\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"How to turn one-time job listings into long-term freelance clients\" \/>\n<meta name=\"twitter:description\" content=\"To vacation or not to vacation? It&#039;s near taboo to suggest a break for personal time. So, how do you successfully negotiate this seemingly thin ice?\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/DHwt5tHg.jpeg\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Preston Lee\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How to turn one-time job listings into long-term freelance clients","description":"To vacation or not to vacation? It's near taboo to suggest a break for personal time. So, how do you successfully negotiate this seemingly thin ice?","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/workspace.fiverr.com\/blog\/how-to-turn-one-time-job-listings-into-long-term-freelance-clients\/","twitter_card":"summary_large_image","twitter_title":"How to turn one-time job listings into long-term freelance clients","twitter_description":"To vacation or not to vacation? It's near taboo to suggest a break for personal time. So, how do you successfully negotiate this seemingly thin ice?","twitter_image":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/DHwt5tHg.jpeg","twitter_misc":{"Written by":"Preston Lee","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/workspace.fiverr.com\/#organization","name":"Fiverr","url":"https:\/\/workspace.fiverr.com\/","sameAs":[],"logo":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#logo","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","width":512,"height":512,"caption":"Fiverr"},"image":{"@id":"https:\/\/workspace.fiverr.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/workspace.fiverr.com\/#website","url":"https:\/\/workspace.fiverr.com\/","name":"Fiverr Workspace","description":"","publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/workspace.fiverr.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/blog\/how-to-turn-one-time-job-listings-into-long-term-freelance-clients\/#primaryimage","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/DHwt5tHg.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/DHwt5tHg.jpeg","width":1200,"height":576},{"@type":"WebPage","@id":"https:\/\/workspace.fiverr.com\/blog\/how-to-turn-one-time-job-listings-into-long-term-freelance-clients\/#webpage","url":"https:\/\/workspace.fiverr.com\/blog\/how-to-turn-one-time-job-listings-into-long-term-freelance-clients\/","name":"How to turn one-time job listings into long-term freelance clients","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/how-to-turn-one-time-job-listings-into-long-term-freelance-clients\/#primaryimage"},"datePublished":"2020-01-20T12:00:00+00:00","dateModified":"2021-10-20T16:21:52+00:00","description":"To vacation or not to vacation? It's near taboo to suggest a break for personal time. So, how do you successfully negotiate this seemingly thin ice?","breadcrumb":{"@id":"https:\/\/workspace.fiverr.com\/blog\/how-to-turn-one-time-job-listings-into-long-term-freelance-clients\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/workspace.fiverr.com\/blog\/how-to-turn-one-time-job-listings-into-long-term-freelance-clients\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/workspace.fiverr.com\/blog\/how-to-turn-one-time-job-listings-into-long-term-freelance-clients\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Fiverr Workspace","item":"https:\/\/workspace.fiverr.com\/"},{"@type":"ListItem","position":2,"name":"How to turn one-time job listings into long-term freelance clients"}]},{"@type":["Article","BlogPosting"],"@id":"https:\/\/workspace.fiverr.com\/blog\/how-to-turn-one-time-job-listings-into-long-term-freelance-clients\/#article","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/blog\/how-to-turn-one-time-job-listings-into-long-term-freelance-clients\/#webpage"},"author":{"@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/93abecc3e7c99b3d39eb331cc36558ae"},"headline":"How to turn one-time job listings into long-term freelance clients","datePublished":"2020-01-20T12:00:00+00:00","dateModified":"2021-10-20T16:21:52+00:00","mainEntityOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/how-to-turn-one-time-job-listings-into-long-term-freelance-clients\/#webpage"},"wordCount":2157,"publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"image":{"@id":"https:\/\/workspace.fiverr.com\/blog\/how-to-turn-one-time-job-listings-into-long-term-freelance-clients\/#primaryimage"},"thumbnailUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2020\/11\/DHwt5tHg.jpeg","articleSection":["Freelance knowledge"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/93abecc3e7c99b3d39eb331cc36558ae","name":"Preston Lee","image":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cdd223e61a05b88bc936adf70f54ee73?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cdd223e61a05b88bc936adf70f54ee73?s=96&d=mm&r=g","caption":"Preston Lee"},"description":"Preston Lee is the founder of Millo where he and his team help freelancers find remote work so they can live anywhere and do work they love. If you’re ready to take the leap into freelancing, join their community of freelancers at Millo.co.","sameAs":["https:\/\/millo.co\/"]}]}},"_links":{"self":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/7342"}],"collection":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/users\/110"}],"replies":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/comments?post=7342"}],"version-history":[{"count":0,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/7342\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media\/10214"}],"wp:attachment":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media?parent=7342"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/categories?post=7342"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/tags?post=7342"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}