{"id":7436,"date":"2020-11-25T22:16:46","date_gmt":"2020-05-01T12:00:00","guid":{"rendered":"https:\/\/www.and.co\/blog\/?p=7436"},"modified":"2022-02-15T14:36:18","modified_gmt":"2022-02-15T14:36:18","slug":"12-pro-freelancers-share-how-theyre-using-covids-downtime-to-build-for-the-future","status":"publish","type":"post","link":"https:\/\/workspace.fiverr.com\/blog\/12-pro-freelancers-share-how-theyre-using-covids-downtime-to-build-for-the-future\/","title":{"rendered":"12 Pro Freelancers Share How They&#039;re Using COVID&#039;s Downtime to Build for the Future"},"content":{"rendered":"\n<p>In the months and years following the COVID-19 pandemic, you’re going to start hearing interviews on podcasts, TV, and the radio with people who did really incredible things while they were stuck in their homes.<\/p>\n\n\n\n<p>It happened following massive lay-offs in 2008 and, in hindsight, the “great recession” was nothing compared to what we’re seeing in 2020.<\/p>\n\n\n\n<p>I think best-selling author Richie Norton <a href=\"https:\/\/www.instagram.com\/p\/B_cUjB-BX7-\/\">put it best<\/a> when he said:<\/p>\n\n\n\n<p><em>&#8220;For the first time in history, every person can claim being the victim at the same time. Will you?&#8221;<\/em><\/p>\n\n\n\n<p>When we look back on 2020, it’s going to be a pivotal moment in human history.&nbsp;<\/p>\n\n\n\n<p>While there are lots of bad that has come out of this whole thing, there are also <a href=\"https:\/\/workspace.fiverr.com\/blog\/5-unique-opportunities-covid-19-could-open-to-freelancers\">some real opportunities for freelancers<\/a>.&nbsp;<\/p>\n\n\n\n<p>The question is: will you take advantage of the current situation to build for your future?<\/p>\n\n\n\n<p>Because you should.<\/p>\n\n\n\n<p>And to prove there’s no shortage of new opportunities and ideas for looking toward a post-COVID world, I’ve reached out to some of the smartest business thinkers and pro freelancers I personally know to ask how they’re using this new “downtime” as a way to grow.<\/p>\n\n\n\n<p>Here’s what they had to say:<\/p>\n\n\n\n<h2><strong>“Downtime? What Downtime?”&nbsp;<\/strong><\/h2>\n\n\n\n<p>The first response I received was from my friend Lexi who runs <a href=\"https:\/\/thewritelife.com\/\"><em>The Write Life<\/em><\/a>, a resource for freelance writers.<\/p>\n\n\n\n<p>“No downtime here. We have a 2- and 4-year-old home with us now. ALL THE TIME.&nbsp;<\/p>\n\n\n\n<p>“Both my husband and I had to reduce expectations for our businesses since we&#8217;re splitting childcare hours.&nbsp;<\/p>\n\n\n\n<p>“I suppose our building for the future is teaching the kids about science and nature and baking and spelling and ensuring they feel loved and safe during an uncertain time.&nbsp;<\/p>\n\n\n\n<p>“But for type-A entrepreneurs, it&#8217;s painful to not be able to follow through on business ambitions.<\/p>\n\n\n\n<p>I genuinely LOVE that the first response I received completely threw the entire premise of my question back in my face.<\/p>\n\n\n\n<h2><strong>Taking care of YOU<\/strong><\/h2>\n\n\n\n<p>Lexi wasn’t the only one to remind me how important it is to find balance during this unprecedented time.<\/p>\n\n\n\n<p>My friend Ian Paget from <a href=\"https:\/\/logogeek.uk\/\"><em>LogoGeek<\/em><\/a> had this to say:<\/p>\n\n\n\n<p><em>“The current situation is new for all of us&#8230;and it&#8217;s affecting everyone differently. Basic things like <a href=\"https:\/\/www.psychologytoday.com\/us\/blog\/the-gen-y-psy\/201810\/the-power-routines-in-your-mental-health\">keeping a routine can help [your mental health]<\/a>&#8211; waking up as you would normally, washing, getting changed, and going to bed at a normal time. Talking about how you feel is important too, and staying connected with friends and family. That should help to keep you positive and motivated.<\/em><\/p>\n\n\n\n<p><em>Don&#8217;t feel like you need to use the &#8220;downtime&#8221; to cram your day with study, courses and work &#8211; it&#8217;s ok to stop and to look after yourself so you&#8217;re healthy and well for when the world returns to a more normal state.”<\/em><\/p>\n\n\n\n<p>If you feel like you personally need to take time off to deal with what’s happening, you’re not alone. Chelsea Baldwin decided to regroup physically and emotionally before charging into what’s next (and set up a free freelancer’s summit to help you do the same):<\/p>\n\n\n\n<p><em>“Like a lot of freelancers or agency owners, I saw my sales tank in March, and they haven&#8217;t fully recovered yet. I took some time off, doing the minimum to maintain my business while figuring out what to do or how to recover from the situation.”<\/em><\/p>\n\n\n\n<p>As you read through some of the opportunities presented below, please keep in mind Lexi’s wise thoughts and remember:<\/p>\n\n\n\n<ul><li>You don’t have to be perfect.<\/li><li>You don’t have to do everything right now.<\/li><li>There are other priorities in addition to your business.<\/li><\/ul>\n\n\n\n<p>With that important reminder, here are still a few motivational ways freelancers are using “downtime” (if they have it) to grow their businesses.<\/p>\n\n\n\n<h2><strong>Building &amp; Nurturing Important Relationships<\/strong><\/h2>\n\n\n\n<p>When everything is running full-tilt, it can be easy to neglect important relationships with people both inside and outside of your business.<\/p>\n\n\n\n<p>But since <a href=\"https:\/\/hbr.org\/2014\/10\/the-freelance-economy-still-runs-on-word-of-mouth\">some studies have shown<\/a> “word of mouth” to be the top-performing marketing vehicle for as much as 84% of the world’s 77 million freelancers, neglecting relationships can be deadly to your income.<\/p>\n\n\n\n<p>That’s why a lot of my friends recommended taking time to nurture and foster important relationships during COVID:<\/p>\n\n\n\n<p><em>“This is a great time to build your reputation and strengthen relationships.”&nbsp; Jay Clouse from <a href=\"https:\/\/freelancing.school\">Freelancing School<\/a> shared with me.&nbsp;<\/em><\/p>\n\n\n\n<p><em>Dedicate a lot of time to reaching out to your advocates: your friends, family, clients, and collaborators. Ask them how they are doing, and listen to any problems they bring up.&nbsp;<\/em><\/p>\n\n\n\n<p><em>If you are able to help them, or introduce them to someone else who can, you&#8217;ll really build strong relationships.”<\/em><\/p>\n\n\n\n<p>Taking it a step further, Chelsea Baldwin agrees and adds encouragement to reach out to new people you’d like to build a relationship with.<\/p>\n\n\n\n<p><em>“Use this opportunity (Covid) as a basis to reach out to new and interesting people you&#8217;ve always wanted to collaborate with, and introduce yourself.&nbsp;<\/em><\/p>\n\n\n\n<p><em>Even if nothing comes out of it now, you never know what will happen in the future.”<\/em><\/p>\n\n\n\n<p>While networking and building relationships may not lead to immediate sales, it’s still worth the effort in the long-term.<\/p>\n\n\n\n<p><em>“Even if people aren&#8217;t ready to buy right now,” Clayton from <a href=\"https:\/\/freeup.net\">Freeup<\/a> reminded me, “they will remember you for what you do during this time. When the economies come back, you&#8217;ll be at the top of their list.”<\/em><\/p>\n\n\n\n<p><a href=\"https:\/\/adamwrightdesign.com\">Adam Wright<\/a> adds:<\/p>\n\n\n\n<p><em>“Although [networking] doesn’t produce fruit quickly, it’s planting seeds for those who don’t know about my business.”<\/em><\/p>\n\n\n\n<h2><strong>Growing an audience<\/strong><\/h2>\n\n\n\n<p>Of course, networking and word-of-mouth marketing aren’t the only ways to grow your business now and when COVID finally lets us all out of the house again.<\/p>\n\n\n\n<p>Many freelancers and solopreneurs I spoke with are turning to the web to connect with more people (and often, more clients) by building some kind of audience.<\/p>\n\n\n\n<p><em>“During the quarantine I have been putting together an email list—something that has been on my to-do list for years!” explained Auni Milne, who runs her design company <a href=\"https:\/\/sumackloft.com\">Sumack Loft<\/a>.&nbsp;<\/em><\/p>\n\n\n\n<p><em>I launched an initiative reaching out to businesses in the community using my new email marketing knowledge and <a href=\"https:\/\/millo.co\/how-to-offer-a-professional-discount-without-cheapening-your-services\">offered a discount via email<\/a> on design services for the month of April.<\/em><\/p>\n\n\n\n<p><em>I have had three projects come out of it, providing me with more income than I might normally have had, while showing the business community that I care about their current challenges.”<\/em><\/p>\n\n\n\n<p>Building an email list is just one of many ways you can engage with other people (and potential clients) online too.<\/p>\n\n\n\n<p><a href=\"https:\/\/www.brentgalloway.me\">Brent Galloway<\/a>, who works primarily in the music industry, uses social media to get his brand in front of potential new clients.<\/p>\n\n\n\n<p><em>“I’ve used the recent downtime to focus on creating content for my Instagram and YouTube channel.&nbsp;<\/em><\/p>\n\n\n\n<p><em>While there’s potential for earning extra income through Google Adsense or affiliate links – the greatest benefit is the exposure it creates for my business.&nbsp;<\/em><\/p>\n\n\n\n<p><em>By creating content and sharing my design processes, I&#8217;m putting myself out there. It can be difficult, but creating content has been the most effective way to grow my brand and attract new freelance clients.”<\/em><\/p>\n\n\n\n<p>Clayton Johnson is following suit:<\/p>\n\n\n\n<p><em>“We&#8217;re using this time to double down on helping people &amp; connecting with our audience with valuable content.&nbsp;<\/em><\/p>\n\n\n\n<p><em>Everyone needs connection right now, so we&#8217;re running more webinars, writing more advice articles on what&#8217;s happening right now, and communicating more with clients directly.”<\/em><\/p>\n\n\n\n<h2><strong>Pitching New Clients (or Old Ones)<\/strong><\/h2>\n\n\n\n<p>For many freelancers, they haven’t used COVID-19 as an excuse to stop pitching clients. Reaching out via email or phone is still one of the most <a href=\"https:\/\/millo.co\/how-to-get-freelance-clients\">common ways to find freelance clients<\/a>.<\/p>\n\n\n\n<p>&#8220;<em>Many companies are trying to figure out how to navigate all the changes COVID-19 brings.&nbsp;<\/em><\/p>\n\n\n\n<p><em>I am going through my client list and reaching out to previous ones to see if I can be of help right now. I hope to regain their business. I am also reaching out to current customers in the same way.”<\/em><\/p>\n\n\n\n<p>And Lexie’s not the only one that still sees pitching as a vital part of their freelance business.<\/p>\n\n\n\n<p>Andy, a co-founder at <a href=\"https:\/\/harpoonapp.com\">Harpoon<\/a> gives this advice:<\/p>\n\n\n\n<p><em>“Try offering your existing clients limited-time, reduced pricing on select services.&nbsp;<\/em><\/p>\n\n\n\n<p><em>Even if you’re “morally opposed” to giving out discounts, these are unique times we’re faced with, and reduced pricing might be just the incentive a client needs to loosen their budget a bit, converting your downtime into paid time.”<\/em><\/p>\n\n\n\n<p>You might wonder who you can actually pitch to if <a href=\"https:\/\/workspace.fiverr.com\/blog\/4-ways-to-build-passive-income-while-covid-has-your-clients-on-hold\">all your client budgets seem to be “on hold”<\/a>. But Adam Wright is being smart on this one.&nbsp;<\/p>\n\n\n\n<p>Adam focuses on companies that seem to be thriving during the pandemic and he’s focusing on the long-term potential his outreach can offer.<\/p>\n\n\n\n<p><em>“I’ve been reaching out to businesses who aren’t necessarily hurting as much right now, like landscaping &amp; lawn maintenance.&nbsp;<\/em><\/p>\n\n\n\n<p><em>The idea is to do as much outreach right now with the hopes that they’ll either 1) come back to me, and\/or 2) refer me to somebody they know that needs my services.”<\/em><\/p>\n\n\n\n<p>Chelsea is also testing some unorthodox ways of reaching new clients.<\/p>\n\n\n\n<p><em>&#8220;I&#8217;m doing some low-cost marketing experiments I wouldn&#8217;t normally have the bandwidth to deal with. For example, yesterday I put up three ads on Craigslist to see what kind of traction I could gain there, and if I&#8217;d be able to turn that opportunity around into some quick cash. Each ad was $5, so it was only $15 to try out something new and a little unorthodox for me.&nbsp;<\/em><\/p>\n\n\n\n<p><em>Go ahead and try some crazy marketing ideas that don&#8217;t cost much money. If they flop, they flop&#8230; but they probably won&#8217;t be total failures, and you&#8217;ll learn more about your business in the process.”<\/em><\/p>\n\n\n\n<h2><strong>Diversifying Your Income<\/strong><\/h2>\n\n\n\n<p>If you find yourself a bit low on traditional client work, you may also want to consider finding new ways to <a href=\"https:\/\/skillcrush.com\/blog\/earn-more-money-freelancing-for-beginners\">make money as a freelancer<\/a>.&nbsp;<\/p>\n\n\n\n<p>That’s what a lot of the freelancers I talked to are doing, in fact.<\/p>\n\n\n\n<p>Brent Galloway, who designs t-shirts for some of the biggest names in the music business, shares this:<\/p>\n\n\n\n<p><em>“I use downtime during business hours to focus on passive income projects and tasks which help grow my brand.&nbsp;<\/em><\/p>\n\n\n\n<p><em>Being a freelance graphic designer who creates merch for the music industry, I’ve found success in selling digital assets.&nbsp;<\/em><\/p>\n\n\n\n<p><em>Things like t-shirt mockups and texture packs. These are assets I need. And if I find value in them, then so could other designers.”<\/em><\/p>\n\n\n\n<p>And quite a few freelancers are turning to course creation to add a little extra revenue to the bottom line.&nbsp;<\/p>\n\n\n\n<p>Whether you create (or even take) <a href=\"https:\/\/millo.co\/15-best-freelancing-courses-for-beginners\">courses for freelancers<\/a> or courses for your client base, course creation can represent a nice long-tail of revenue for months and years to come.<\/p>\n\n\n\n<p>I&#8217;ve chosen to use some of the downtime to push myself hard to launch a course,” <a href=\"https:\/\/mackeymedia.com\/\">Bobby Macey<\/a> shared with me.&nbsp;<\/p>\n\n\n\n<p><em>“I&#8217;ve wanted to have something that could provide passive income over time, and this was the perfect opportunity to build it.”&nbsp;<\/em><\/p>\n\n\n\n<p><a href=\"https:\/\/freelancegrowthacademy.com\">Bruno Padilha<\/a> is doing the same thing—utilizing this extra time to finally get to the courses he’s been dreaming up in his mind.<\/p>\n\n\n\n<p><em>“I&#8217;m using this time to create content for 2 new online courses. I guess I had been waiting for the perfect moment to focus on course creation, and this is it!<\/em><\/p>\n\n\n\n<p><em>Client work has decreased significantly, and with more free time I can finally work on my own projects.”<\/em><\/p>\n\n\n\n<h2><strong>Doing Your Own Creative Work<\/strong><\/h2>\n\n\n\n<p>I had lots of people respond to my questions with a suggestion to focus on your own passion projects, your own creative work, and stuff you’ve had on the back-burner if you find yourself with extra time during the pandemic.<\/p>\n\n\n\n<p><em>“There has never been a better time to work on your OWN creative projects,” said podcaster Jay Clouse, “whether that&#8217;s refreshing your portfolio, writing an article, starting a podcast, or something else entirely.”<\/em><\/p>\n\n\n\n<h2><strong>Making the Most without Burning Out<\/strong><\/h2>\n\n\n\n<p>I hope this compilation of ideas from some of the smartest freelancers and entrepreneurs I know has inspired you to make the most of this unique time.<\/p>\n\n\n\n<p>Above everything, remember to focus on your mental health and the well-being of the people you love. If you can take on extra projects right now, then go for it!<\/p>\n\n\n\n<p>I wish you the best of luck as you navigate these unprecedented times as a freelancer and business owner. We’ve got this!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In the months and years following the COVID-19 pandemic, you’re going to start hearing interviews on podcasts, TV, and the radio with people who did really<\/p>\n","protected":false},"author":110,"featured_media":7993,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[2,6],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>12 Pro Freelancers Share How They&#039;re Using COVID&#039;s Downtime to Build for the Future<\/title>\n<meta name=\"description\" content=\"I’ve reached out to some of the smartest business thinkers and pro freelancers I personally know to ask how they’re using this new “downtime” as a way to grow.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/workspace.fiverr.com\/blog\/12-pro-freelancers-share-how-theyre-using-covids-downtime-to-build-for-the-future\/\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"12 Pro Freelancers Share How They&#039;re Using COVID&#039;s Downtime to Build for the Future\" \/>\n<meta name=\"twitter:description\" content=\"I’ve reached out to some of the smartest business thinkers and pro freelancers I personally know to ask how they’re using this new “downtime” as a way to grow.\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Preston Lee\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"12 Pro Freelancers Share How They're Using COVID's Downtime to Build for the Future","description":"I’ve reached out to some of the smartest business thinkers and pro freelancers I personally know to ask how they’re using this new “downtime” as a way to grow.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/workspace.fiverr.com\/blog\/12-pro-freelancers-share-how-theyre-using-covids-downtime-to-build-for-the-future\/","twitter_card":"summary_large_image","twitter_title":"12 Pro Freelancers Share How They're Using COVID's Downtime to Build for the Future","twitter_description":"I’ve reached out to some of the smartest business thinkers and pro freelancers I personally know to ask how they’re using this new “downtime” as a way to grow.","twitter_misc":{"Written by":"Preston Lee","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/workspace.fiverr.com\/#organization","name":"Fiverr","url":"https:\/\/workspace.fiverr.com\/","sameAs":[],"logo":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#logo","inLanguage":"en-US","url":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","contentUrl":"https:\/\/workspace.fiverr.com\/wp-content\/uploads\/2021\/12\/512x512bb.jpeg","width":512,"height":512,"caption":"Fiverr"},"image":{"@id":"https:\/\/workspace.fiverr.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/workspace.fiverr.com\/#website","url":"https:\/\/workspace.fiverr.com\/","name":"Fiverr Workspace","description":"","publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/workspace.fiverr.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/blog\/12-pro-freelancers-share-how-theyre-using-covids-downtime-to-build-for-the-future\/#primaryimage","inLanguage":"en-US","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/workspace.fiverr.com\/blog\/12-pro-freelancers-share-how-theyre-using-covids-downtime-to-build-for-the-future\/#webpage","url":"https:\/\/workspace.fiverr.com\/blog\/12-pro-freelancers-share-how-theyre-using-covids-downtime-to-build-for-the-future\/","name":"12 Pro Freelancers Share How They're Using COVID's Downtime to Build for the Future","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/12-pro-freelancers-share-how-theyre-using-covids-downtime-to-build-for-the-future\/#primaryimage"},"datePublished":"2020-05-01T12:00:00+00:00","dateModified":"2022-02-15T14:36:18+00:00","description":"I’ve reached out to some of the smartest business thinkers and pro freelancers I personally know to ask how they’re using this new “downtime” as a way to grow.","breadcrumb":{"@id":"https:\/\/workspace.fiverr.com\/blog\/12-pro-freelancers-share-how-theyre-using-covids-downtime-to-build-for-the-future\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/workspace.fiverr.com\/blog\/12-pro-freelancers-share-how-theyre-using-covids-downtime-to-build-for-the-future\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/workspace.fiverr.com\/blog\/12-pro-freelancers-share-how-theyre-using-covids-downtime-to-build-for-the-future\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Fiverr Workspace","item":"https:\/\/workspace.fiverr.com\/"},{"@type":"ListItem","position":2,"name":"12 Pro Freelancers Share How They&#039;re Using COVID&#039;s Downtime to Build for the Future"}]},{"@type":["Article","BlogPosting"],"@id":"https:\/\/workspace.fiverr.com\/blog\/12-pro-freelancers-share-how-theyre-using-covids-downtime-to-build-for-the-future\/#article","isPartOf":{"@id":"https:\/\/workspace.fiverr.com\/blog\/12-pro-freelancers-share-how-theyre-using-covids-downtime-to-build-for-the-future\/#webpage"},"author":{"@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/93abecc3e7c99b3d39eb331cc36558ae"},"headline":"12 Pro Freelancers Share How They&#039;re Using COVID&#039;s Downtime to Build for the Future","datePublished":"2020-05-01T12:00:00+00:00","dateModified":"2022-02-15T14:36:18+00:00","mainEntityOfPage":{"@id":"https:\/\/workspace.fiverr.com\/blog\/12-pro-freelancers-share-how-theyre-using-covids-downtime-to-build-for-the-future\/#webpage"},"wordCount":2135,"publisher":{"@id":"https:\/\/workspace.fiverr.com\/#organization"},"image":{"@id":"https:\/\/workspace.fiverr.com\/blog\/12-pro-freelancers-share-how-theyre-using-covids-downtime-to-build-for-the-future\/#primaryimage"},"thumbnailUrl":"","articleSection":["Freelance knowledge","Inspiration"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/workspace.fiverr.com\/#\/schema\/person\/93abecc3e7c99b3d39eb331cc36558ae","name":"Preston Lee","image":{"@type":"ImageObject","@id":"https:\/\/workspace.fiverr.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cdd223e61a05b88bc936adf70f54ee73?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cdd223e61a05b88bc936adf70f54ee73?s=96&d=mm&r=g","caption":"Preston Lee"},"description":"Preston Lee is the founder of Millo where he and his team help freelancers find remote work so they can live anywhere and do work they love. If you’re ready to take the leap into freelancing, join their community of freelancers at Millo.co.","sameAs":["https:\/\/millo.co\/"]}]}},"_links":{"self":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/7436"}],"collection":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/users\/110"}],"replies":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/comments?post=7436"}],"version-history":[{"count":0,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/posts\/7436\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/media?parent=7436"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/categories?post=7436"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/workspace.fiverr.com\/wp-json\/wp\/v2\/tags?post=7436"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}